Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: detail mail rpki mx-ns-valid exp
nl: We testen of de validatie-status van alle IP-adressen van de nameservers van je mailservers (MX) `Valid` is. Als er meerdere overlappende route-aankondigingen voor het IP-adres zijn, dan testen we of die allemaal `Valid` zijn. Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Dat doet hij door (delen van) zijn IP-adresblokken (Route Prefix) aan het unieke nummer van zijn providernetwerk (Route Origin ASN) te koppelen, en door deze routeringsinformatie vervolgens te verspreiden. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen moeten sturen. Aanvullend kan je hoster (of zijn netwerkprovider) voor iedere route-aankondiging een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation, afgekort: ROA) publiceren met behulp van Resource Public Key Infrastructure (RPKI). Een andere netwerkprovider die gevraagd wordt om internetverkeer te sturen naar het IP-adres van je server, kan de bijbehorende verklaring cryptografisch controleren. De gecontroleerde inhoud (Validated ROA Payload; afgekort: VRP) omvat welke providernetwerken (VRP ASN) voor ieder opgenomen IP-adresblok (VRP Prefix) geautoriseerd zijn om internetverkeer te ontvangen. De netwerkprovider kan deze inhoud vervolgens gebruiken om BGP-routes te filteren. Hij kan bijvoorbeeld eventuele `Invalid` routes weigeren om te voorkomen dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd. Het vergelijken van route-aankondigingen met route-autorisaties (RPKI Origin Validation; afgekort: ROV) kent de onderstaande drie mogelijk uitkomsten. - `Valid`: De route-aankondiging van het desbetreffende IP-adres wordt gematcht door tenminste één gepubliceerde route-autorisatie. Een route-autorisatie is ook matchend voor meer specifieke route-aankondigingen (d.w.z. voor een deel van het IP-adresblok dat in de route-autorisatie staat), tenzij deze meer specifiek zijn dan de limiet die in de route-autorisatie is bepaald (via het `maxLength` attribuut). - `Invalid`: De route-aankondiging van het desbetreffende IP-adres is wel afgedekt door een route-autorisatie, maar deze matcht *niet*. Er zijn twee mogelijke oorzaken: 1. het IP-adresblok (Route Prefix) wordt aangekondigd vanaf een providernetwerk (Route Origin ASN) dat in de route-autorisatie *niet* is geautoriseerd (resultaat in onderstaande tabel: "invalid (as)"); 2. het IP-adresblok (Route Prefix) dat wordt aangekondigd is *kleiner* dan wordt toegestaan in de route-autorisatie, d.w.z. overschrijding van `maxLength` waarde (resultaat in onderstaande tabel: "invalid (length)"). Let op: De status `Invalid` duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je hoster of zijn netwerkprovider (interne fout) óf door een derde partij (externe fout). In beide gevallen kan het leiden tot de onbereikbaarheid van je server of het onderscheppen van internetverkeer naar je server. Neem zo spoedig mogelijk contact op met je hoster. Bij een interne fout moet je hoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen. - `NotFound`: Er is geen verklaring met route-autorisatie gevonden die de route-aankondiging van het desbetreffende IP-adres afdekt. De routering van internetverkeer naar jouw server is daardoor minder veilig. Neem hierover contact op met je hoster. Deze kan zijn netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren. *Niveau van vereistheid: Aanbevolen*

source: detail mail rpki mx-ns-valid label
nl: Geldigheid van route-aankondiging

source: detail mail rpki mx-ns-valid tech table
nl: Nameserver van MX|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation status

source: detail mail rpki mx-ns-valid verdict bad
nl: Ten minste één IP-adres van de nameservers van je ontvangende mailservers heeft een `NotFound` validatie-status. Er is *geen* RPKI Route Origin Authorization (ROA) gepubliceerd voor de route-aankondiging van ieder van de desbetreffende IP-adressen.

source: detail mail rpki mx-ns-valid verdict good
nl: Alle IP-adressen van de nameservers van je ontvangende mailservers hebben een `Valid` validatie-status. De route-aankondiging van deze IP-adressen wordt gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA).

source: detail mail rpki mx-ns-valid verdict invalid
nl: Tenminste één IP-adres van de nameservers van je ontvangende mailservers heeft een `Invalid` validatie-status. De route-aankondiging van de desbetreffende IP-adressen wordt *niet* gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je mailhoster (interne fout) óf door een derde partij (externe fout). In beide gevallen kan het leiden tot de onbereikbaarheid van je server of het onderscheppen van internetverkeer naar je server. Neem zo spoedig mogelijk contact op met je mailhoster. Bij een interne fout moet je mailhoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.

source: detail mail rpki mx-ns-valid verdict not-routed
nl: Deze subtest werd *niet* uitgevoerd, omdat er voor *geen* van de IP-adressen een route-aankondiging beschikbaar was.

source: detail mail rpki valid exp
nl: We testen of de validatie-status van alle IP-adressen van je mailservers (MX) `Valid` is. Als er meerdere overlappende route-aankondigingen voor het IP-adres zijn, dan testen we of die allemaal `Valid` zijn. Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Dat doet hij door (delen van) zijn IP-adresblokken (Route Prefix) aan het unieke nummer van zijn providernetwerk (Route Origin ASN) te koppelen, en door deze routeringsinformatie vervolgens te verspreiden. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen moeten sturen. Aanvullend kan je hoster (of zijn netwerkprovider) voor iedere route-aankondiging een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation, afgekort: ROA) publiceren met behulp van Resource Public Key Infrastructure (RPKI). Een andere netwerkprovider die gevraagd wordt om internetverkeer te sturen naar het IP-adres van je server, kan de bijbehorende verklaring cryptografisch controleren. De gecontroleerde inhoud (Validated ROA Payload; afgekort: VRP) omvat welke providernetwerken (VRP ASN) voor ieder opgenomen IP-adresblok (VRP Prefix) geautoriseerd zijn om internetverkeer te ontvangen. De netwerkprovider kan deze inhoud vervolgens gebruiken om BGP-routes te filteren. Hij kan bijvoorbeeld eventuele `Invalid` routes weigeren om te voorkomen dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd. Het vergelijken van route-aankondigingen met route-autorisaties (RPKI Origin Validation; afgekort: ROV) kent de onderstaande drie mogelijk uitkomsten. - `Valid`: De route-aankondiging van het desbetreffende IP-adres wordt gematcht door tenminste één gepubliceerde route-autorisatie. Een route-autorisatie is ook matchend voor meer specifieke route-aankondigingen (d.w.z. voor een deel van het IP-adresblok dat in de route-autorisatie staat), tenzij deze meer specifiek zijn dan de limiet die in de route-autorisatie is bepaald (via het `maxLength` attribuut). - `Invalid`: De route-aankondiging van het desbetreffende IP-adres is wel afgedekt door een route-autorisatie, maar deze matcht *niet*. Er zijn twee mogelijke oorzaken: 1. het IP-adresblok (Route Prefix) wordt aangekondigd vanaf een providernetwerk (Route Origin ASN) dat in de route-autorisatie *niet* is geautoriseerd (resultaat in onderstaande tabel: "invalid (as)"); 2. het IP-adresblok (Route Prefix) dat wordt aangekondigd is *kleiner* dan wordt toegestaan in de route-autorisatie, d.w.z. overschrijding van `maxLength` waarde (resultaat in onderstaande tabel: "invalid (length)"). Let op: De status `Invalid` duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je hoster of zijn netwerkprovider (interne fout) óf door een derde partij (externe fout). In beide gevallen kan het leiden tot de onbereikbaarheid van je server of het onderscheppen van internetverkeer naar je server. Neem zo spoedig mogelijk contact op met je hoster. Bij een interne fout moet je hoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen. - `NotFound`: Er is geen verklaring met route-autorisatie gevonden die de route-aankondiging van het desbetreffende IP-adres afdekt. De routering van internetverkeer naar jouw server is daardoor minder veilig. Neem hierover contact op met je hoster. Deze kan zijn netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren. *Niveau van vereistheid: Aanbevolen*

source: detail mail rpki valid label
nl: Geldigheid van route-aankondiging

source: detail mail rpki valid tech table
nl: Mailserver|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation status

source: detail mail rpki valid verdict bad
nl: Ten minste één IP-adres van je ontvangende mailservers heeft een `NotFound` validatie-status. Er is *geen* RPKI Route Origin Authorization (ROA) gepubliceerd voor de route-aankondiging van ieder van de desbetreffende IP-adressen.

source: detail mail rpki valid verdict good
nl: Alle IP-adressen van je ontvangende mailservers hebben een `Valid` validatie-status. De route-aankondiging van deze IP-adressen wordt gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA).

source: detail mail rpki valid verdict invalid
nl: Tenminste één IP-adres van je ontvangende mailservers heeft een `Invalid` validatie-status. De route-aankondiging van de desbetreffende IP-adressen wordt *niet* gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je mailhoster (interne fout) óf door een derde partij (externe fout). In beide gevallen kan het leiden tot de onbereikbaarheid van je server of het onderscheppen van internetverkeer naar je server. Neem zo spoedig mogelijk contact op met je mailhoster. Bij een interne fout moet je mailhoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.

source: detail mail rpki valid verdict not-routed
nl: Deze subtest werd *niet* uitgevoerd, omdat er voor *geen* van de IP-adressen een route-aankondiging beschikbaar was.

source: detail mail tls cert-hostmatch exp
nl: We testen of de domeinnaam van ieder van je ontvangende mailservers (MX) overeenkomt met de domeinnaam op het gepresenteerde certificaat. Verzendende mailservers negeren doorgaans het domein op het certificaat. Zonder DNSSEC is de opvraging van het mailserverdomein kwetsbaar voor manipulatie. Daardoor voegt de controle of de domeinnaam op het certificaat overeenkomt met het mailserverdomeinnaam geen enkele authenticiteitswaarde toe. Ontvangende mailservers gebruiken daarom regelmatig zelf-ondertekende certificaten, vaak uitgegeven door een interne (private) certificaatautoriteit. Voor authenticiteit dient een mailserver gebruikt te maken van DNSSEC en DANE. Een certificaat met domeinnaam die overeenkomt met de domeinnaam van je mailserver is alleen vereist als je gebruik maakt van DANE 'trust anchor assertion' (DANE-TA, 2). Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B3-1. *Niveau van vereistheid: Optioneel / Vereist (alleen als DANE-TA wordt gebruikt)*

source: detail mail tls cert-hostmatch label
nl: Domeinnaam op certificaat

source: detail mail tls cert-hostmatch tech table
nl: Mailserver (MX)|Niet-overeenkomende domeinen op certificaat

source: detail mail tls cert-hostmatch verdict bad
nl: De domeinnaam van tenminste één van je mailservers komt *niet* overeen met de domeinnaam op het mailservercertificaat.

source: detail mail tls cert-hostmatch verdict good
nl: De domeinnamen van al je mailservers komen overeen met de domeinnamen op je mailservercertificaten.

source: detail mail tls cert-pubkey exp
nl: We testen of de (ECDSA of RSA) digitale handtekening van ieder van je mailserver-certificaten veilige parameters gebruikt. Bij de verificatie van certificaten wordt gebruik gemaakt van digitale handtekeningen. Om de authenticiteit van de verbinding te garanderen, moet een betrouwbaar algoritme voor certificaatverificatie gekozen worden. Het algoritme dat gebruikt wordt om een certificaat te ondertekenen, wordt door de certificaatleverancier geselecteerd. Het certificaat specificeert het algoritme voor digitale handtekeningen dat tijdens de sleuteluitwisseling door zijn eigenaar wordt gebruikt. Het is mogelijk om meerdere certificaten te configureren, zodat er ook meer dan één algoritme ondersteund kan worden. De veiligheid van de ECDSA-digitale-handtekeningen is afhankelijk van de geselecteerde kromme. De veiligheid van RSA voor de versleuteling en digitale handtekeningen houdt verband met de sleutellengte van de publieke sleutel. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B5-1 en tabel 9 voor ECDSA, en richtlijn B3-3 en tabel 8 voor RSA. --- **Elliptische krommen voor ECDSA** * Goed: `secp384r1`, `secp256r1`, `x448`, and `x25519` * Uit te faseren: `secp224r1` * Onvoldoende: Andere krommen **Lengte van RSA-sleutels** * Goed: Minimaal 3072 bit * Voldoende: 2048 – 3071 bit * Onvoldoende: Minder dan 2048 bit

source: detail mail tls cert-pubkey label
nl: Publieke sleutel van certificaat

source: detail mail tls cert-pubkey tech table
nl: Mailserver (MX)|Getroffen handtekening-parameters|Status

source: detail mail tls cert-pubkey verdict bad
nl: De digitale handtekening van tenminste één van je mailserver-certificaten gebruikt *onvoldoende* veilige parameters.

source: detail mail tls cert-pubkey verdict good
nl: De digitale handtekeningen van al je mailserver-certificaten gebruiken veilige parameters.

source: detail mail tls cert-pubkey verdict phase-out
nl: De digitale handtekening van tenminste één van je mailserver-certificaten gebruikt parameters die de status *uit te faseren* hebben, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst *onvoldoende* veilig te worden.

source: detail mail tls cert-signature exp
nl: We testen of de ondertekende fingerprint van ieder van je mailserver-certificaten is gemaakt met een veilig algoritme voor hashing. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B3-2 en tabel 3. --- **Hashfuncties voor certificaatverificatie** * Goed: SHA-512, SHA-384, SHA-256 * Onvoldoende: SHA-1, MD5

source: detail mail tls cert-signature label
nl: Handtekening van certificaat

source: detail mail tls cert-signature tech table
nl: Mailserver (MX)|Getroffen hashing-algoritme|Status

source: detail mail tls cert-signature verdict bad
nl: Tenminste één van je mailserver-certificaten is ondertekend met een algoritme voor hashing dat *onvoldoende* veilig is.

source: detail mail tls cert-signature verdict good
nl: Al je mailserver-certificaten zijn ondertekend met een veilig algoritme voor hashing.

source: detail mail tls cert-trust exp
nl: We testen of we een geldige vertrouwensketen voor je mailserver-certificaten kunnen opbouwen. Er is sprake van een geldige vertrouwensketen, als je certificaat is uitgegeven door een [publiekelijk vertrouwde certificaatautoriteit](https://www.mozilla.org/en-US/about/governance/policies/security-group/certs/) én je ontvangende mailserver alle noodzakelijke tussenliggende certificaten presenteert. Verzendende mailservers negeren doorgaans of een mailservercertificaat is uitgegeven door een publiekelijk vertrouwde certificaatautoriteit. Zonder DNSSEC is de opvraging van het mailserverdomein kwetsbaar voor manipulatie. Daardoor kan een certificaat dat is uitgegeven door een publiekelijk vertrouwde certificaatautoriteit geen enkele authenticiteitswaarde toevoegen. Ontvangende mailservers gebruiken daarom regelmatig zelf-ondertekende certificaten, vaak uitgegeven door een interne (private) certificaatautoriteit. Voor authenticiteit dient een mailserver gebruikt te maken van DNSSEC en DANE. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B3-4. *Niveau van vereistheid: Optioneel*

source: detail mail tls cert-trust label
nl: Vertrouwensketen van certificaat

source: detail mail tls cert-trust tech table
nl: Mailserver (MX)|Onvertrouwde certificaatketen

source: detail mail tls cert-trust verdict bad
nl: De vertrouwensketen van tenminste één van je mailserver-certificaten is *niet* compleet en/of *niet* ondertekend door een vertrouwde certificaatautoriteit.

source: detail mail tls cert-trust verdict good
nl: De vertrouwensketen van al je mailserver-certificaten is compleet én ondertekend door een vertrouwde certificaatautoriteit.

source: detail mail tls cipher-order exp
nl: We testen of je ontvangende mailservers (MX) hun eigen cipher-voorkeur afdwingen ('I'), en ciphers aanbieden conform de voorgeschreven volgorde ('II'). Als je mailserver alleen 'Goede' ciphers ondersteunt, dan is deze test niet van toepassing omdat de volgorde dan geen significant beveiligingsvoordeel oplevert. I. *Server afgedwongen cipher-volgorde*: Ontvangende mailservers dwingen hun cipher-voorkeur af tijdens de onderhandeling met verzendende mailservers, en accepteren geen voorkeur van de verzendende mailservers; II. *Voorgeschreven volgorde*: Ciphers worden aangeboden door de ontvangende mailservers in overeenstemming met de voorgeschreven volgorde waarbij *Goede* boven *Voldoende* boven *Uit te faseren* ciphers worden geprefereerd. In de bovenstaande tabel met technische details staan **alleen de eerst gevonden algoritmeselecties die niet voldoen aan de voorgeschreven volgorde**. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B2-5.

source: detail mail tls cipher-order label
nl: Cipher-volgorde

source: detail mail tls cipher-order tech table
nl: Mail server (MX)|Eerst gevonden getroffen cipher-paren|Overtreden regel # ('II-B')

source: detail mail tls cipher-order verdict bad
nl: Tenminste één van je mailservers dwingt *niet* zijn eigen cipher-voorkeur af ('I').

source: detail mail tls cipher-order verdict good
nl: Al je mailservers dwingen hun eigen cipher-voorkeur af ('I'), en bieden ciphers aan conform de voorgeschreven volgorde ('II').

source: detail mail tls cipher-order verdict na
nl: Deze subtest is niet van toepassing aangezien je mailserver alleen 'Goede' ciphers ondersteunt.

source: detail mail tls cipher-order verdict seclevel-bad
nl: Tenminste één van je mailservers prefereert *niet* 'Goede' boven 'Voldoende' en dan pas 'Uit te faseren' ciphers ('II').

source: detail mail tls cipher-order verdict warning
nl: OUTDATED TEXT; VERDICT NOT USED Tenminste een van je mailservers biedt *niet* ciphers aan conform de voorgeschreven volgorde binnen een bepaald veiligheidsniveau ('II-B').

source: detail mail tls ciphers exp
nl: We testen of je ontvangende mailservers (MX) alleen veilige, d.w.z. 'Goede' en/of 'Voldoende', ciphers (ook algoritmeselecties genoemd) ondersteunen. Om te voorkomen dat we tegen 'rate limits' van ontvangende mailservers aanlopen, bevat het testresultaat **alleen de eerstgevonden getroffen algoritmeselectie**. Een algoritmeselectie bestaat uit ciphers voor vier cryptografische functies: 1) sleuteluitwisseling, 2) certificaatverificatie, 3) bulkversleuteling, en 4) hashing. * Vanaf TLS 1.3 omvat de term 'cipher suite' alleen ciphers voor bulkversleuteling en hashing. Als TLS 1.3 gebruikt wordt dan zijn de ciphers voor sleuteluitwisseling en certificaatverificatie onderhandelbaar en niet langer onderdeel van de naam van de cipher suite. Omdat dit de term 'cipher suite' ambigu maakt, gebruikt NCSC de term 'algoritmeselectie' om alle vier de functies te omvatten. * NCSC gebruikt de [IANA-naamgeving](https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml#tls-parameters-4) voor algoritmeselectie. Internet.nl hanteert de [OpenSSL-naamgeving](https://www.openssl.org/docs/manmaster/man1/openssl-ciphers.html#CIPHER-SUITE-NAMES). Vanaf TLS 1.3 volgt OpenSSL de IANA-naamgeving. Een vertaling tussen beide is onderdeel van de OpenSSL-documentation. * Merk op dat ciphers die PSK of SRP gebruiken voor sleuteluitwisseling (die onvoldoende veilig zijn) in deze test niet worden gedetecteerd vanwege een beperking die samenhangt met onze testwijze. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B2-1 t/m B2-4 en tabel 2, 4, 6 en 7. --- Hieronder staan 'Goede', 'Voldoende' en 'Uit te faseren' algoritmeselecties in de door NCSC voorgeschreven volgorde, gebaseerd op bijlage C van de 'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.0'. Achter iedere algoritmeselectie staat de minimale TLS-versie (bijv. [1.2]) die deze algoritmeselectie ondersteunt en die tenminste 'Uit te faseren' is. Goed: * `ECDHE-ECDSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-ECDSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-ECDSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-RSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] Voldoende: * `ECDHE-ECDSA-AES256-SHA384` [1.2] * `ECDHE-ECDSA-AES256-SHA` [1.0] * `ECDHE-ECDSA-AES128-SHA256` [1.2] * `ECDHE-ECDSA-AES128-SHA` [1.0] * `ECDHE-RSA-AES256-SHA384` [1.2] * `ECDHE-RSA-AES256-SHA` [1.0] * `ECDHE-RSA-AES128-SHA256` [1.2] * `ECDHE-RSA-AES128-SHA` [1.0] * `DHE-RSA-AES256-GCM-SHA384` [1.2] * `DHE-RSA-CHACHA20-POLY1305` [1.2] * `DHE-RSA-AES128-GCM-SHA256` [1.2] * `DHE-RSA-AES256-SHA256` [1.2] * `DHE-RSA-AES256-SHA` [1.0] * `DHE-RSA-AES128-SHA256` [1.2] * `DHE-RSA-AES128-SHA` [1.0] Uit te faseren: * `ECDHE-ECDSA-DES-CBC3-SHA` [1.0] * `ECDHE-RSA-DES-CBC3-SHA` [1.0] * `DHE-RSA-DES-CBC3-SHA` [1.0] * `AES256-GCM-SHA384` [1.2] * `AES128-GCM-SHA256` [1.2] * `AES256-SHA256` [1.2] * `AES256-SHA` [1.0] * `AES128-SHA256` [1.2] * `AES128-SHA` [1.0] * `DES-CBC3-SHA` [1.0]

source: detail mail tls ciphers label
nl: Ciphers (Algoritmeselecties)

source: detail mail tls ciphers tech table
nl: Mailserver (MX)|Eerst gevonden onveilige cipher|Status

source: detail mail tls ciphers verdict bad
nl: Tenminste één van je mailservers ondersteunt een of meer *onvoldoende* veilige ciphers.
