Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: detail mail auth spf exp
nl: We testen of je domeinnaam een SPF-record heeft. Een ontvangende mailserver kan de IP-adressen in je SPF-record gebruiken om de verzendende mailserver van een ontvangen e-mail met jouw domein als afzender te authenticeren. Het bijbehorende beleid kan worden gebruikt om passende actie te ondernemen als de authenticatie mislukt. Meer dan één SPF-record op hetzelfde domein is niet geldig en zorgt ervoor dat het domein voor de test faalt. Voor een "good practice voor domeinnamen zonder mail" zie de [uitleg van de "DMARC-policy" subtest](#control-panel-9).

source: detail mail auth spf label
nl: SPF aanwezigheid

source: detail mail auth spf tech table
nl: SPF-record

source: detail mail auth spf verdict bad
nl: Je domeinnaam heeft geen geldig SPF-record.

source: detail mail auth spf verdict good
nl: Je domein heeft een SPF-record.

source: detail mail auth spf-policy exp
nl: We controleren of de syntax van je SPF-record geldig is en of deze een voldoende strikte policy, d.w.z. `~all` (softfail) of `-all` (hardfail), bevat om misbruik van je domein door phishers en spammers tegen te gaan. Om misbruik van je domein tegen te gaan is een liberale policy, d.w.z. `+all` (pass) of `?all` (neutral), onvoldoende. Als `all` ontbreekt en er is geen `redirect` aanwezig in je SPF-record, dan is de default policy `?all`. We volgen ook `include` en `redirect` voor geldige SPF-records. Bovendien controleren we of je SPF-record het toegestane aantal van 10 DNS-opvragingen niet overschrijdt waardoor het geen werking meer heeft. Ieder van de volgende SPF-termen telt als een DNS-opvraging: `redirect`, `include`, `a`, `mx`, `ptr` en `exist`. Terwijl de SPF-termen `all`, `ip4`, `ip6` en `exp` niet tellen als DNS-opvragingen. Merk op dat als het domein onder `include` of `redirect` uit macro's bestaat, dan volgen we deze niet omdat we niet over de noodzakelijk informatie van een daadwerkelijke mail of mailserververbinding beschikken om de macro's uit te voeren. Dit betekent dat wij het gevolg van macro's niet beoordelen. Bovendien tellen we de door macro's veroorzaakte DNS-opvragingen niet mee om te bepalen of het toegestane aantal DNS-opvragingen is overschreden. Voor verzendende domeinen heeft het gebruik van `~all` (softfail) in plaats van `-all` (fail) meestal de voorkeur. De reden hiervoor is dat wanneer de SPF-authenticatie faalt met een SPF fail, een ontvangende mailserver de verbinding al kan blokkeren zonder de DKIM-handtekening en het DMARC-beleid te evalueren. Dit kan leiden tot ten onrechte geblokkeerde mails (bijvoorbeeld wanneer mails door de ontvangende mailserver automatisch worden doorgestuurd naar een andere ontvangende mailserver). Merk op dat een getriggerde SPF softfail er nog steeds voor zorgt dat een strikte DMARC policy je domein beschermt als ook de DKIM-autneticatie faalt. Voor domeinen zonder mail zie de good practice op [uitleg van de "DMARC-policy" subtest](#control-panel-9).

source: detail mail auth spf-policy label
nl: SPF policy

source: detail mail auth spf-policy tech table
nl: Domein|SPF-record

source: detail mail auth spf-policy verdict all
nl: Je SPF-policy is *niet* voldoende strikt.

source: detail mail auth spf-policy verdict bad
nl: Je SPF-policy is syntactisch *niet* correct.

source: detail mail auth spf-policy verdict good
nl: Je SPF-policy is voldoende strikt.

source: detail mail auth spf-policy verdict include
nl: Je SPF-policy is *niet* voldoende strikt. Het 'include'-mechanisme in je SPF-record verwijst naar een onvoldoende strikte SPF-policy of naar een niet-bestaand SPF-record.

source: detail mail auth spf-policy verdict max-lookups
nl: Je SPF-policy is *niet* effectief omdat deze meer dan de toegestane 10 DNS-opvragingen vereist. Elk van de volgende SPF-termen telt als een DNS-opvraging: `redirect`, `include`, `a`, `mx`, `ptr` en `exist`. Terwijl de SPF-termen `all`, `ip4`, `ip6` en `exp` niet tellen als DNS-opvragingen.

source: detail mail auth spf-policy verdict redirect
nl: Je SPF-policy is *niet* voldoende strikt. De 'redirect modifier' in je SPF-record verwijst naar een onvoldoende strikte SPF-policy of naar een niet-bestaand SPF-record.

source: detail mail dnssec exists exp
nl: We testen of de domeinnaam in je e-mailadres, meer specifiek het SOA-record, ondertekend is met DNSSEC. De handtekening zorgt ervoor dat een verzender, die domeinhandtekeningen controleert, op een betrouwbare wijze jouw mailserverdomeinen (MX) kan opvragen. Dit voorkomt dat een aanvaller het antwoord manipuleert en aan jou gerichte mail omleidt naar een mailserverdomein dat onder controle is van de aanvaller. Als een domein via `CNAME` doorverwijst naar een ander domein, dan checken we (conform de DNSSEC-standaard) ook of het CNAME-domein ondertekend is met DNSSEC. Als het CNAME-domein niet ondertekend is, dan zal deze subtest een negatief resultaat tonen. Let op: de geldigheid van de ondertekening wordt niet getest in deze subtest maar wel in de volgende subtest.

source: detail mail dnssec exists label
nl: DNSSEC aanwezigheid

source: detail mail dnssec exists tech table
nl: E-mailadresdomein|Registrar

source: detail mail dnssec exists verdict bad
nl: Je e-mailadresdomein is onveilig oftewel 'insecure', omdat het *niet* ondertekend is met DNSSEC.

source: detail mail dnssec exists verdict good
nl: Je e-mailadresdomein is met DNSSEC ondertekend.

source: detail mail dnssec exists verdict resolver-error
nl: Helaas is in de resolver van Internet.nl een fout opgetreden. Neem a.j.b. [contact](/about/) met ons op.

source: detail mail dnssec exists verdict servfail
nl: De nameservers van je e-mailadresdomein zijn *kapot*. Ze gaven een foutmelding (`SERVFAIL`) terug op onze bevragingen voor een DNSSEC-handtekening. Vraag de nameserver-beheerder (vaak je registrar en/of hostingprovider) om dit spoedig op te lossen.

source: detail mail dnssec mx-exists exp
nl: We testen of de domeinnamen van je mailservers (MX), meer specifiek hun SOA-records, ondertekend zijn met DNSSEC. De handtekening zorgt ervoor dat een verzender, die domeinhandtekeningen controleert, op een betrouwbare wijze de IP-adressen en DANE-records van jouw mailservers kan opvragen. Dit voorkomt dat een aanvaller het antwoord manipuleert en aan jou gerichte mail omleidt naar IP-adressen die onder controle staan van de aanvaller óf de beveiligde mailserver-verbinding afluistert. Als een domein via `CNAME` doorverwijst naar een ander domein, dan checken we (conform de DNSSEC-standaard) ook of het CNAME-domein ondertekend is met DNSSEC. Als het CNAME-domein niet ondertekend is, dan zal deze subtest een negatief resultaat tonen. Let op: de geldigheid van de ondertekening wordt niet getest in deze subtest maar wel in de volgende subtest.

source: detail mail dnssec mx-exists label
nl: DNSSEC aanwezigheid

source: detail mail dnssec mx-exists tech table
nl: Domein van mailserver (MX)|DNSSEC aanwezig

source: detail mail dnssec mx-exists verdict bad
nl: Tenminste één van jouw mailserverdomeinen is onveilig oftewel 'insecure', omdat deze *niet* ondertekend is met DNSSEC.

source: detail mail dnssec mx-exists verdict good
nl: Al je mailserverdomeinen zijn ondertekend met DNSSEC.

source: detail mail dnssec mx-exists verdict invalid-null-mx
nl: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, óf je domeinnaam heeft geen A/AAAA records, waardoor het "Null MX" record onnodig is. Óf op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de "Null MX" tegenstrijdig is.

source: detail mail dnssec mx-exists verdict no-mailservers
nl: Er zijn geen ontvangende mailservers (MX) ingesteld op je domeinnaam die geen A/AAAA records heeft. Dat is prima als je geen e-mail wilt ontvangen.

source: detail mail dnssec mx-exists verdict no-null-mx
nl: Je domeinnaam die A/AAAA-records heeft, geeft duidelijk aan dat het geen e-mail accepteert door een "Null MX" record te adverteren. Dat is prima als je geen e-mail wilt ontvangen.

source: detail mail dnssec mx-exists verdict null-mx
nl: Jouw domeinnaam laat duidelijk zien dat het geen e-mail accepteert door een "Null MX" record te adverteren.

source: detail mail dnssec mx-exists verdict null-mx-with-other-mx
nl: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de "Null MX" tegenstrijdig is.

source: detail mail dnssec mx-exists verdict null-mx-without-a-aaaa
nl: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, je domeinnaam heeft geen A/AAAA records, waardoor het "Null MX" record onnodig is.

source: detail mail dnssec mx-exists verdict resolver-error
nl: Helaas is in de resolver van Internet.nl een fout opgetreden. Neem a.j.b. [contact](/about/) met ons op.

source: detail mail dnssec mx-exists verdict servfail
nl: De nameservers van tenminste één van je mailserverdomeinen zijn *kapot*. Ze gaven een foutmelding (`SERVFAIL`) terug op onze bevragingen voor een DNSSEC-handtekening. Vraag de nameserver-beheerder (vaak je mailprovider) om dit spoedig op te lossen.

source: detail mail dnssec mx-valid exp
nl: We testen of de domeinen van je ontvangende mailservers (MX), meer specifiek hun SOA-records, zijn ondertekend met een geldige DNSSEC-handtekening die ze veilig oftewel 'secure' maakt. Als een domein via `CNAME` verwijst naar een ander ondertekend domein, dan checken we (conform de DNSSEC-standaard) ook of de ondertekening van het CNAME-domein geldig is. Als de ondertekening CNAME-domein niet geldig is, dan zal deze subtest een negatief resultaat tonen.

source: detail mail dnssec mx-valid label
nl: DNSSEC geldigheid

source: detail mail dnssec mx-valid tech table
nl: Domein van mailserver (MX)|Status

source: detail mail dnssec mx-valid verdict bad
nl: Tenminste één van de ondertekende domeinen van je mailservers is onbetrouwbaar oftewel 'bogus', omdat zijn DNSSEC-handtekening niet geldig is. Óf iemand manipuleerde de antwoorden van de nameservers, óf je mailserverdomein heeft serieuze DNSSEC-configuratiefouten. Dit laatste maakt je ontvangende mailserver onbereikbaar voor alle verzendende mailservers die DNSSEC-handtekeningen controleren. Neem zo spoedig mogelijk contact op met de nameserver-beheerder (vaak je mailprovider).

source: detail mail dnssec mx-valid verdict good
nl: Al de ondertekende domeinnamen van je mailservers zijn veilig oftewel 'secure', omdat hun DNSSEC-handtekeningen geldig zijn.

source: detail mail dnssec mx-valid verdict unsupported-ds-algo
nl: Tenminste één van de domeinen van je mailservers is ondertekend met een algoritme dat onze validerende resolver momenteel nog niet ondersteunt. Daardoor zijn we niet in staat de geldigheid van zijn DNSSEC-handtekening te controleren.

source: detail mail dnssec valid exp
nl: We testen of je domeinnaam, meer specifiek het SOA-record, is ondertekend met een geldige DNSSEC-handtekening. Als een domein via `CNAME` verwijst naar een ander ondertekend domein, dan checken we (conform de DNSSEC-standaard) ook of de ondertekening van het CNAME-domein geldig is. Als de ondertekening van het CNAME-domein niet geldig is, dan zal deze subtest een negatief resultaat tonen.

source: detail mail dnssec valid label
nl: DNSSEC geldigheid

source: detail mail dnssec valid tech table
nl: E-mailadresdomein|Status

source: detail mail dnssec valid verdict bad
nl: Je e-mailadresdomein is onbetrouwbaar oftewel 'bogus', omdat de DNSSEC-handtekening *niet* geldig is. Óf iemand manipuleerde het antwoord van jouw nameserver, óf je domeinnaam heeft een *serieuze DNSSEC-configuratiefout*. Dit laatste maakt je domeinnaam onbereikbaar voor alle gebruikers die DNSSEC-handtekeningen controleren. Neem zo spoedig mogelijk contact op met je nameserver-beheerder (vaak je registrar of hostingprovider).

source: detail mail dnssec valid verdict good
nl: Je e-mailadresdomein is veilig oftewel 'secure', omdat zijn DNSSEC-handtekening geldig is.

source: detail mail dnssec valid verdict unsupported-ds-algo
nl: Je e-mailadresdomein is ondertekend met een algoritme dat onze validerende resolver momenteel nog niet ondersteunt. Daardoor zijn we niet in staat de geldigheid van zijn DNSSEC-handtekening te controleren.

source: detail mail ipv6 mx-AAAA exp
nl: We testen of er tenminste één AAAA-record met IPv6-adres voor iedere ontvangende mailserver (MX) is. In het geval er geen mailserver is gedefinieerd, geven we een notificatie en we voeren andere subtesten van de mailtest die nog steeds relevant zijn gewoon uit. 'IPv4-mapped IPv6 addresses' ([RFC 4291](https://datatracker.ietf.org/doc/rfc4291/), beginnend met ::ffff:) zullen falen in deze test, aangezien zij *geen* IPv6-connectiviteit bieden.

source: detail mail ipv6 mx-AAAA label
nl: IPv6-adressen voor mailserver(s)

source: detail mail ipv6 mx-AAAA tech table
nl: Mailserver (MX)|IPv6-adres|IPv4-adres

source: detail mail ipv6 mx-AAAA verdict bad
nl: Tenminste één ontvangende mailserver op jouw domeinnaam heeft *geen* IPv6-adres.

source: detail mail ipv6 mx-AAAA verdict good
nl: Alle ontvangende mailservers op jouw domeinnaam hebben een IPv6-adres.

source: detail mail ipv6 mx-AAAA verdict invalid-null-mx
nl: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, óf je domeinnaam heeft geen A/AAAA records, waardoor het "Null MX" record onnodig is. Óf op je domeinnaam is een ontvangende mailserver ingesteld met een ander MX record, waardoor de "Null MX" tegenstrijdig is.

source: detail mail ipv6 mx-AAAA verdict no-null-mx
nl: Er zijn geen ontvangende mailservers (MX) ingesteld op je domeinnaam die A/AAAA records heeft. Wij raden je aan om expliciet aan te geven dat je domeinnaam geen e-mail accepteert door een "Null MX" record te configureren.

source: detail mail ipv6 mx-AAAA verdict null-mx
nl: Je domeinnaam die A/AAAA-records heeft, geeft duidelijk aan dat het geen e-mail accepteert door een "Null MX" record te adverteren. Dat is prima als je geen e-mail wilt ontvangen.

source: detail mail ipv6 mx-AAAA verdict null-mx-with-other-mx
nl: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de "Null MX" tegenstrijdig is.

source: detail mail ipv6 mx-AAAA verdict null-mx-without-a-aaaa
nl: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, je domeinnaam heeft geen A/AAAA records, waardoor het "Null MX" record onnodig is.

source: detail mail ipv6 mx-AAAA verdict other
nl: Er zijn geen ontvangende mailservers (MX) ingesteld op je domeinnaam die geen A/AAAA records heeft. Dat is prima als je geen e-mail wilt ontvangen.

source: detail mail ipv6 mx-reach exp
nl: We testen of we je mailservers (MX) kunnen bereiken via IPv6 op poort 25. We testen alle IPv6-adressen die we ontvangen van de nameservers van je mailserverdomein(en). Een deelscore wordt gegeven als niet alle IPv6-adressen bereikbaar zijn. Als een IPv6-adres (syntactisch) ongeldig is, dan beschouwen we dat als onbereikbaar.

source: detail mail ipv6 mx-reach label
nl: IPv6-bereikbaarheid van mailserver(s)

source: detail mail ipv6 mx-reach tech table
nl: Mailserver (MX)|Onbereikbaar IPv6-adres

source: detail mail ipv6 mx-reach verdict bad
nl: Tenminste één van je ontvangende mailservers met een IPv6-adres is *niet* bereikbaar via IPv6.

source: detail mail ipv6 mx-reach verdict good
nl: Al je ontvangende mailservers met een IPv6-adres zijn bereikbaar via IPv6.

source: detail mail rpki exists exp
nl: We testen of er een RPKI Route Origin Authorisation (ROA) is gepubliceerd voor alle IP-adressen van je mailserver(s) (MX). Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen van je server moeten sturen. Een route-aankondiging is echter te vervalsen. Een andere netwerkprovider kan namelijk in de positie zijn om het IP-adresblok van jouw IP-adres te koppelen aan zijn netwerk en op die manier mogelijk internetverkeer te ontvangen dat eigenlijk voor jouw netwerkprovider bedoeld is. De oorzaak kan per ongeluk of kwaadwillig zijn. In beide gevallen kan het ertoe leiden dat je server onbereikbaar is of dat internetverkeer naar uw server wordt onderschept. Resource Public Key Infrastructure (RPKI) verbetert de bescherming hiertegen aanzienlijk. Met RPKI kan de rechtmatige houder van een blok IP-adressen namelijk een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation; afgekort: ROA) publiceren. Een andere netwerkprovider die internetverkeer wil sturen naar een bepaalde IP-adres, kan de bijbehorende verklaring gebruiken om ongeldige (`Invalid`) routes te filteren. Daarmee voorkomt de netwerkprovider dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd. *Niveau van vereistheid: Aanbevolen*

source: detail mail rpki exists label
nl: Aanwezigheid van Route Origin Authorisation

source: detail mail rpki exists tech table
nl: Mailserver|IP-adres|RPKI Route Origin Authorization

source: detail mail rpki exists verdict bad
nl: Voor tenminste één van de IP-adressen van je ontvangende mailserver(s) is *geen* RPKI Route Origin Authorisation (ROA) gepubliceerd.

source: detail mail rpki exists verdict good
nl: Voor alle IP-adressen van je ontvangende mailserver(s) is een RPKI Route Origin Authorisation (ROA) gepubliceerd.

source: detail mail rpki exists verdict no-addresses
nl: Je domein bevat *geen* ontvangende mailservers. Daarom kon deze subtest niet worden uitgevoerd.

source: detail mail rpki mx-ns-exists exp
nl: We testen of er een RPKI Route Origin Authorisation (ROA) is gepubliceerd voor alle IP-adressen van de nameservers van je mailserver(s) (MX). Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen van je server moeten sturen. Een route-aankondiging is echter te vervalsen. Een andere netwerkprovider kan namelijk in de positie zijn om het IP-adresblok van jouw IP-adres te koppelen aan zijn netwerk en op die manier mogelijk internetverkeer te ontvangen dat eigenlijk voor jouw netwerkprovider bedoeld is. De oorzaak kan per ongeluk of kwaadwillig zijn. In beide gevallen kan het ertoe leiden dat je server onbereikbaar is of dat internetverkeer naar je server wordt onderschept. Resource Public Key Infrastructure (RPKI) verbetert de bescherming hiertegen aanzienlijk. Met RPKI kan de rechtmatige houder van een blok IP-adressen namelijk een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation; afgekort: ROA) publiceren. Een andere netwerkprovider die internetverkeer wil sturen naar een bepaalde IP-adres, kan de bijbehorende verklaring gebruiken om ongeldige (`Invalid`) routes te filteren. Daarmee voorkomt de netwerkprovider dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd. *Niveau van vereistheid: Aanbevolen*

source: detail mail rpki mx-ns-exists label
nl: Aanwezigheid van Route Origin Authorisation

source: detail mail rpki mx-ns-exists tech table
nl: Nameserver van MX|IP-adres|RPKI Route Origin Authorization

source: detail mail rpki mx-ns-exists verdict bad
nl: Voor tenminste één van de IP-adressen van de nameservers van je mailserver(s) is *geen* RPKI Route Origin Authorisation (ROA) gepubliceerd.

source: detail mail rpki mx-ns-exists verdict good
nl: Voor alle IP-adressen van de nameservers van je mailserver(s) is een RPKI Route Origin Authorisation (ROA) gepubliceerd.

source: detail mail rpki mx-ns-exists verdict no-addresses
nl: Je domein bevat *geen* mailservers. Daarom kon deze subtest niet worden uitgevoerd.
