Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: detail web appsecpriv http-x-xss exp
nl: OUTDATED TEXT; TEST NOT USED We testen of je webserver een HTTP header voor `X-XSS-Protection` aanbiedt die een voldoende veilige waarde heeft (dat wil zeggen `1` of `1; mode=block`). Deze HTTP header kan worden gebruikt om het beschermingsfilter van browsers tegen reflectieve cross-site scripting (XSS) aanvallen te activeren. Geldige waardes voor de `X-XSS-Protection` header zijn: * `0` deactiveert het XSS-filter. Deze waarde dient NIET te worden gebruikt. * `1` activeert het XSS-filter. Als een cross-site scripting aanval wordt gedetecteerd, dan zal de browser het script opschonen en de onveilige delen verwijderen. Deze waarde is normaal gesproken de standaard-waarde ('default') in browsers als een website geen `X-XSS-Protection` header aanbiedt. * `1; mode=block` activeert het XSS-filter én de blokkeermodus. Als een cross-site scripting aanval wordt gedetecteerd, dan zal de browser het antwoord blokkeren en de webpagina niet laden. Dit is de aanbevolen waarde. Mits goed geconfigureerd kan `Content-Security-Policy` (CSP) vergelijkbare bescherming en meer bieden aan gebruikers van moderne webbrowsers. `X-XSS-Protection` biedt in dat geval nog altijd bescherming aan bezoekers van oudere browsers die geen CSP ondersteunen. Bovendien kan `X-XSS-Protection` waardevolle bescherming aan alle bezoekers bieden, indien CSP niet (goed) is ingesteld voor de desbetreffende website. *Niveau van vereistheid: Aanbevolen*

source: detail web appsecpriv http-x-xss label
nl: OUTDATED TEXT; TEST NOT USED X-XSS-Protection

source: detail web appsecpriv http-x-xss tech table
nl: OUTDATED TEXT; TEST NOT USED Webserver-IP-adres|X-XSS-Protection waarde

source: detail web appsecpriv http-x-xss verdict bad
nl: OUTDATED TEXT; TEST NOT USED Je webserver biedt *geen* veilig ingestelde X-XSS-Protection aan.

source: detail web appsecpriv http-x-xss verdict good
nl: OUTDATED TEXT; TEST NOT USED Je webserver biedt veilig ingestelde X-XSS-Protection aan.

source: detail web dnssec exists exp
nl: We testen of je domeinnaam, meer specifiek het SOA-record, ondertekend is met DNSSEC. Als een domein via `CNAME` doorverwijst naar een ander domein, dan checken we (conform de DNSSEC-standaard) ook of het CNAME-domein ondertekend is met DNSSEC. Als het CNAME-domein niet ondertekend is, dan zal deze subtest een negatief resultaat tonen. Let op: de geldigheid van de ondertekening wordt niet getest in deze subtest maar wel in de volgende subtest.

source: detail web dnssec exists label
nl: DNSSEC aanwezigheid

source: detail web dnssec exists tech table
nl: Domein|Registrar

source: detail web dnssec exists verdict bad
nl: Je domein is onveilig oftewel 'insecure', omdat het *niet* ondertekend is met DNSSEC.

source: detail web dnssec exists verdict good
nl: Je domein is met DNSSEC ondertekend.

source: detail web dnssec exists verdict resolver-error
nl: Helaas is in de resolver van Internet.nl een fout opgetreden. Neem a.j.b. [contact](/about/) met ons op.

source: detail web dnssec exists verdict servfail
nl: De nameservers van je domeinnaam zijn *kapot*. Ze gaven een foutmelding (`SERVFAIL`) terug op onze bevragingen voor een DNSSEC-handtekening. Vraag de nameserver-beheerder (vaak je registrar en/of hostingprovider) om dit spoedig op te lossen.

source: detail web dnssec valid exp
nl: We testen of je domeinnaam, meer specifiek het SOA-record, is ondertekend met een geldige DNSSEC-handtekening. Als een domein via `CNAME` verwijst naar een ander ondertekend domein, dan checken we (conform de DNSSEC-standaard) ook of de ondertekening van het CNAME-domein geldig is. Als de ondertekening van het CNAME-domein niet geldig is, dan zal deze subtest een negatief resultaat tonen.

source: detail web dnssec valid label
nl: DNSSEC geldigheid

source: detail web dnssec valid tech table
nl: Domein|Status

source: detail web dnssec valid verdict bad
nl: Je domeinnaam is onbetrouwbaar oftewel 'bogus', omdat de DNSSEC-handtekening *niet* geldig is. Óf iemand manipuleerde het antwoord van jouw nameserver, óf je domeinnaam heeft een *serieuze DNSSEC-configuratiefout*. Dit laatste maakt je domeinnaam onbereikbaar voor alle gebruikers die DNSSEC-handtekeningen controleren. Neem zo spoedig mogelijk contact op met je nameserver-beheerder (vaak je registrar of hostingprovider).

source: detail web dnssec valid verdict good
nl: Je domeinnaam is veilig oftewel 'secure', omdat zijn DNSSEC-handtekening geldig is.

source: detail web dnssec valid verdict unsupported-ds-algo
nl: Je domeinnaam is ondertekend met een algoritme dat onze validerende resolver momenteel nog niet ondersteunt. Daardoor zijn we niet in staat de geldigheid van zijn DNSSEC-handtekening te controleren.

source: detail web ipv6 web-AAAA exp
nl: We testen of er tenminste één AAAA-record met IPv6-adres voor je webserver is. 'IPv4-mapped IPv6 addresses' ([RFC 4291](https://datatracker.ietf.org/doc/rfc4291/), beginnend met ::ffff:) zullen falen in deze test, aangezien zij *geen* IPv6-connectiviteit bieden.

source: detail web ipv6 web-AAAA label
nl: IPv6-adressen voor webserver

source: detail web ipv6 web-AAAA tech table
nl: Webserver|IPv6-adres|IPv4-adres

source: detail web ipv6 web-AAAA verdict bad
nl: *Geen* van je webservers heeft een IPv6-adres.

source: detail web ipv6 web-AAAA verdict good
nl: Tenminste één van je webservers heeft een IPv6-adres.

source: detail web ipv6 web-ipv46 exp
nl: Wij vergelijken het antwoord en de inhoud die we van je webserver over IPv6 ontvangen met die over IPv4. We controleren: 1. of HTTP (poort 80) en/of HTTPS (poort 443) via IPv4 ook beschikbaar zijn via IPv6; 2. of HTTP-headers (zoals een redirect-header) via IPv4 ook via IPv6 worden ontvangen; 3. of HTML-inhoud via IPv4 hetzelfde is via IPv6. Na het strippen van eventuele nonces doen we een vergelijking van de ontvangen inhoud. Het verschil in inhoud mag niet groter zijn dan 10% om voor deze subtest te slagen. De drempel zorgt ervoor dat kleine verschillen (bijvoorbeeld als gevolg van veranderende advertenties) niet leiden tot het falen van deze subtest. Als er meerdere IPv6- en IPv4-adressen zijn, kiezen we één IPv6-adres en één IPv4-adres om de subtest uit te voeren. Als er alleen een IPv6-adres en geen IPv4-adres beschikbaar is, dan is de subtest niet van toepassing omdat er geen vergelijking kan worden gemaakt.

source: detail web ipv6 web-ipv46 label
nl: Gelijke website op IPv6 en IPv4

source: detail web ipv6 web-ipv46 verdict bad
nl: Je website op IPv6 lijkt *niet* gelijk aan je website op IPv4.

source: detail web ipv6 web-ipv46 verdict good
nl: Je website op IPv6 lijkt gelijk aan je website op IPv4.

source: detail web ipv6 web-reach exp
nl: We testen of we je webserver(s) kunnen bereiken via IPv6 op alle beschikbare poorten (80 en/of 443). We testen alle IPv6-adressen die we ontvangen van je nameservers. Een deelscore wordt gegeven als niet alle IPv6-adressen bereikbaar zijn. Als een IPv6-adres (syntactisch) ongeldig is, dan beschouwen we dat als onbereikbaar.

source: detail web ipv6 web-reach label
nl: IPv6-bereikbaarheid van webserver

source: detail web ipv6 web-reach tech table
nl: Webserver|Onbereikbaar IPv6-adres

source: detail web ipv6 web-reach verdict bad
nl: Tenminste één van jouw webservers met een IPv6-adres, is *niet* bereikbaar via IPv6.

source: detail web ipv6 web-reach verdict good
nl: Al je webservers met een IPv6-adres zijn bereikbaar via IPv6.

source: detail web rpki exists exp
nl: We testen of er een RPKI Route Origin Authorisation (ROA) is gepubliceerd voor alle IP-adressen van je webserver. Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen van je server moeten sturen. Een route-aankondiging is echter te vervalsen. Een andere netwerkprovider kan namelijk in de positie zijn om het IP-adresblok van jouw IP-adres te koppelen aan zijn netwerk en op die manier mogelijk internetverkeer te ontvangen dat eigenlijk voor jouw netwerkprovider bedoeld is. De oorzaak kan per ongeluk of kwaadwillig zijn. In beide gevallen kan het ertoe leiden dat je server onbereikbaar is of dat internetverkeer naar je server wordt onderschept. Resource Public Key Infrastructure (RPKI) verbetert de bescherming hiertegen aanzienlijk. Met RPKI kan de rechtmatige houder van een blok IP-adressen namelijk een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation; afgekort: ROA) publiceren. Een andere netwerkprovider die internetverkeer wil sturen naar een bepaalde IP-adres, kan de bijbehorende verklaring gebruiken om ongeldige (`Invalid`) routes te filteren. Daarmee voorkomt de netwerkprovider dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd. *Niveau van vereistheid: Aanbevolen*

source: detail web rpki exists label
nl: Aanwezigheid van Route Origin Authorisation

source: detail web rpki exists tech table
nl: Webserver|IP-adres|RPKI Route Origin Authorization

source: detail web rpki exists verdict bad
nl: Voor tenminste één van de IP-adressen van je webserver is *geen* RPKI Route Origin Authorisation (ROA) gepubliceerd.

source: detail web rpki exists verdict good
nl: Voor alle IP-adressen van je webserver is een RPKI Route Origin Authorisation (ROA) gepubliceerd.

source: detail web rpki exists verdict no-addresses
nl: Je domein bevat *geen* IP-adressen van webservers. Daarom kon deze subtest niet worden uitgevoerd.

source: detail web rpki valid exp
nl: We testen of de validatie-status van alle IP-adressen van je webserver `Valid` is. Als er meerdere overlappende route-aankondigingen voor het IP-adres zijn, dan testen we of die allemaal `Valid` zijn. Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Dat doet hij door (delen van) zijn IP-adresblokken (Route Prefix) aan het unieke nummer van zijn providernetwerk (Route Origin ASN) te koppelen, en door deze routeringsinformatie vervolgens te verspreiden. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen moeten sturen. Aanvullend kan je hoster (of zijn netwerkprovider) voor iedere route-aankondiging een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation, afgekort: ROA) publiceren met behulp van Resource Public Key Infrastructure (RPKI). Een andere netwerkprovider die gevraagd wordt om internetverkeer te sturen naar het IP-adres van je server, kan de bijbehorende verklaring cryptografisch controleren. De gecontroleerde inhoud (Validated ROA Payload; afgekort: VRP) omvat welke providernetwerken (VRP ASN) voor ieder opgenomen IP-adresblok (VRP Prefix) geautoriseerd zijn om internetverkeer te ontvangen. De netwerkprovider kan deze inhoud vervolgens gebruiken om BGP-routes te filteren. Hij kan bijvoorbeeld eventuele `Invalid` routes weigeren om te voorkomen dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd. Het vergelijken van route-aankondigingen met route-autorisaties (RPKI Origin Validation; afgekort: ROV) kent de onderstaande drie mogelijk uitkomsten. - `Valid`: De route-aankondiging van het desbetreffende IP-adres wordt gematcht door tenminste één gepubliceerde route-autorisatie. Een route-autorisatie is ook matchend voor meer specifieke route-aankondigingen (d.w.z. voor een deel van het IP-adresblok dat in de route-autorisatie staat), tenzij deze meer specifiek zijn dan de limiet die in de route-autorisatie is bepaald (via het `maxLength` attribuut). - `Invalid`: De route-aankondiging van het desbetreffende IP-adres is wel afgedekt door een route-autorisatie, maar deze matcht *niet*. Er zijn twee mogelijke oorzaken: 1. het IP-adresblok (Route Prefix) wordt aangekondigd vanaf een providernetwerk (Route Origin ASN) dat in de route-autorisatie *niet* is geautoriseerd (resultaat in onderstaande tabel: "invalid (as)"); 2. het IP-adresblok (Route Prefix) dat wordt aangekondigd is *kleiner* dan wordt toegestaan in de route-autorisatie, d.w.z. overschrijding van `maxLength` waarde (resultaat in onderstaande tabel: "invalid (length)"). Let op: De status `Invalid` duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je hoster of zijn netwerkprovider (interne fout) óf door een derde partij (externe fout). In beide gevallen kan het leiden tot de onbereikbaarheid van je server of het onderscheppen van internetverkeer naar je server. Neem zo spoedig mogelijk contact op met je hoster. Bij een interne fout moet je hoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen. - `NotFound`: Er is geen verklaring met route-autorisatie gevonden die de route-aankondiging van het desbetreffende IP-adres afdekt. De routering van internetverkeer naar jouw server is daardoor minder veilig. Neem hierover contact op met je hoster. Deze kan zijn netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren. *Niveau van vereistheid: Aanbevolen*

source: detail web rpki valid label
nl: Geldigheid van route-aankondiging

source: detail web rpki valid tech table
nl: Webserver|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation status

source: detail web rpki valid verdict bad
nl: Ten minste één IP-adres van je webserver heeft een `NotFound` validatie-status. Er is *geen* RPKI Route Origin Authorization (ROA) gepubliceerd voor de route-aankondiging van ieder van de desbetreffende IP-adressen.

source: detail web rpki valid verdict good
nl: Alle IP-adressen van je webserver hebben een `Valid` validatie-status. De route-aankondiging van deze IP-adressen wordt gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA).

source: detail web rpki valid verdict invalid
nl: Tenminste één IP-adres van je webserver heeft een `Invalid` validatie-status. De route-aankondiging van de desbetreffende IP-adressen wordt *niet* gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je webhoster (interne fout) óf door een derde partij (externe fout). In beide gevallen kan het leiden tot de onbereikbaarheid van je server of het onderscheppen van internetverkeer naar je server. Neem zo spoedig mogelijk contact op met je webhoster. Bij een interne fout moet je webhoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.

source: detail web rpki valid verdict not-routed
nl: Deze subtest werd *niet* uitgevoerd, omdat er voor *geen* van de IP-adressen een route-aankondiging beschikbaar was.

source: detail web tls cert-hostmatch exp
nl: We testen of de domeinnaam van je website overeenkomt met de domeinnaam op het certificaat. Het kan handig zijn om meerdere domeinnamen (bijvoorbeeld de domeinnaam met en zonder www) als Subject Alternative Name (SAN) in het certificaat op te nemen. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B3-1.

source: detail web tls cert-hostmatch label
nl: Domeinnaam op certificaat

source: detail web tls cert-hostmatch tech table
nl: Webserver-IP-adres|Niet-overeenkomende domeinen op certificaat

source: detail web tls cert-hostmatch verdict bad
nl: De domeinnaam van je website komt *niet* overeen met de domeinnaam op je websitecertificaat.

source: detail web tls cert-hostmatch verdict good
nl: De domeinnaam van je website komt overeen met de domeinnaam op je websitecertificaat.

source: detail web tls cert-pubkey exp
nl: We testen of de (ECDSA of RSA) digitale handtekening van je websitecertificaat veilige parameters gebruikt. Bij de verificatie van certificaten wordt gebruik gemaakt van digitale handtekeningen. Om de authenticiteit van de verbinding te garanderen, moet een betrouwbaar algoritme voor certificaatverificatie gekozen worden. Het algoritme dat gebruikt wordt om een certificaat te ondertekenen, wordt door de certificaatleverancier geselecteerd. Het certificaat specificeert het algoritme voor digitale handtekeningen dat tijdens de sleuteluitwisseling door zijn eigenaar wordt gebruikt. Het is mogelijk om meerdere certificaten te configureren, zodat er ook meer dan één algoritme ondersteund kan worden. De veiligheid van de ECDSA-digitale-handtekeningen is afhankelijk van de geselecteerde kromme. De veiligheid van RSA voor de versleuteling en digitale handtekeningen houdt verband met de sleutellengte van de publieke sleutel. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B5-1 en tabel 9 voor ECDSA, en richtlijn B3-3 en tabel 8 voor RSA. --- **Elliptische krommen voor ECDSA** * Goed: `secp384r1`, `secp256r1`, `x448`, and `x25519` * Uit te faseren: `secp224r1` * Onvoldoende: Andere krommen **Lengte van RSA-sleutels** * Goed: Minimaal 3072 bit * Voldoende: 2048 – 3071 bit * Onvoldoende: Minder dan 2048 bit

source: detail web tls cert-pubkey label
nl: Publieke sleutel van certificaat

source: detail web tls cert-pubkey tech table
nl: Webserver-IP-adres|Getroffen handtekening-parameters|Status

source: detail web tls cert-pubkey verdict bad
nl: De digitale handtekening van je websitecertificaat gebruikt *onvoldoende* veilige parameters.

source: detail web tls cert-pubkey verdict good
nl: De digitale handtekening van je websitecertificaat gebruikt veilige parameters.

source: detail web tls cert-pubkey verdict phase-out
nl: De digitale handtekening van je websitecertificaat gebruikt parameters die de status *uit te faseren* hebben, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst *onvoldoende* veilig te worden.

source: detail web tls cert-signature exp
nl: We testen of de ondertekende fingerprint van het websitecertificaat is gemaakt met een veilig algoritme voor hashing. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B3-2 en tabel 3. --- **Hashfuncties voor certificaatverificatie** * Goed: SHA-512, SHA-384, SHA-256 * Onvoldoende: SHA-1, MD5

source: detail web tls cert-signature label
nl: Handtekening van certificaat

source: detail web tls cert-signature tech table
nl: Webserver-IP-adres|Getroffen hashing-algoritme|Status

source: detail web tls cert-signature verdict bad
nl: Je websitecertificaat is ondertekend met een algoritme voor hashing dat *onvoldoende* veilig is.

source: detail web tls cert-signature verdict good
nl: Je websitecertificaat is ondertekend met een voldoende algoritme voor hashing.

source: detail web tls cert-trust exp
nl: We testen of we een geldige vertrouwensketen voor je websitecertificaat kunnen opbouwen. Er is sprake van een geldige vertrouwensketen, als je certificaat is uitgegeven door een [publiekelijk vertrouwde certificaatautoriteit](https://www.mozilla.org/en-US/about/governance/policies/security-group/certs/) én je webserver alle noodzakelijke tussenliggende certificaten presenteert. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B3-4.

source: detail web tls cert-trust label
nl: Vertrouwensketen van certificaat

source: detail web tls cert-trust tech table
nl: Webserver-IP-adres|Onvertrouwde certificaatketen

source: detail web tls cert-trust verdict bad
nl: De vertrouwensketen van je websitecertificaat is *niet* compleet en/of *niet* ondertekend door een vertrouwde certificaatautoriteit.

source: detail web tls cert-trust verdict good
nl: De vertrouwensketen van je websitecertificaat is compleet en ondertekend door een vertrouwde certificaatautoriteit.

source: detail web tls cipher-order exp
nl: We testen of je webserver zijn eigen cipher-voorkeur afdwingt ('I'), en ciphers aanbiedt conform de voorgeschreven volgorde ('II'). Als je webserver alleen 'Goede' ciphers ondersteunt, dan is deze subtest niet van toepassing omdat de volgorde dan geen significant beveiligingsvoordeel oplevert. I. *Server afgedwongen cipher-volgorde*: De webserver dwingt zijn cipher-voorkeur af tijdens de onderhandeling met een webbrowser, en accepteert geen voorkeur van de webbrowser; II. *Voorgeschreven volgorde*: Ciphers worden aangeboden door de webserver in overeenstemming met de voorgeschreven volgorde waarbij *Goede* boven *Voldoende* boven *Uit te faseren* ciphers worden geprefereerd. In de bovenstaande tabel met technische details staan **alleen de eerst gevonden algoritmeselecties die niet voldoen aan de voorgeschreven volgorde**. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B2-5.

source: detail web tls cipher-order label
nl: Cipher-volgorde

source: detail web tls cipher-order tech table
nl: Webserver IP-adres|Eerst gevonden getroffen cipher-paren|Overtreden regel # ('II-B')

source: detail web tls cipher-order verdict bad
nl: Je webserver dwingt *niet* zijn eigen cipher-voorkeur af ('I').

source: detail web tls cipher-order verdict good
nl: Je webserver dwingt zijn eigen cipher-voorkeur af ('I'), en biedt ciphers aan conform de voorgeschreven volgorde ('II').

source: detail web tls cipher-order verdict na
nl: Deze subtest is niet van toepassing aangezien je webserver alleen 'Goede' ciphers ondersteunt.

source: detail web tls cipher-order verdict seclevel-bad
nl: Je webserver prefereert *niet* 'Goede' boven 'Voldoende' en dan pas 'Uit te faseren' ciphers ('II').

source: detail web tls cipher-order verdict warning
nl: OUTDATED TEXT; VERDICT NOT USED Je webserver biedt *niet* ciphers aan conform de voorgeschreven volgorde binnen een bepaald veiligheidsniveau ('II-B').
