Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: detail web tls ocsp-stapling exp
nl: We testen of je webserver de [TLS Certificate Status extension](https://tools.ietf.org/html/rfc6961) of te wel OCSP stapling ondersteunt. De webbrowser kan de geldigheid van het certificaat van de webserver via het OCSP-protocol controleren bij de certificaatleverancier. Dat OCSP-protocol verschaft de certificaatleverancier informatie over browsers die met de betreffende webserver communiceren. Dit kan een privacy-risico vormen. Een server kan de OCSP-informatie ook zelf verstrekken (OCSP stapling). Dit lost niet alleen het privacy-risico op, maar vereist ook geen connectiviteit tussen de webbrowser en certificaatleverancier en dit gaat dan ook sneller. Als we verbinden met je webserver dan verzoeken we via de TLS Certificate Status extension om OCSP-data op te nemen in het antwoord van de webserver. Als je webserver OCSP-data heeft opgenomen in het antwoord, dan verifiëren we of de OCSP-data valide is, d.w.z. correct ondertekend door een bekende certificaatleverancier. Let op: we gebruiken de OCSP-data niet om de geldigheid van het certificaat te controleren. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, tabel 15. *Niveau van vereistheid: Optioneel* --- **OCSP stapling** * Goed: Aan * Voldoende: Uit

source: detail web tls ocsp-stapling label
nl: OCSP stapling

source: detail web tls ocsp-stapling tech table
nl: Webserver-IP-adres|OCSP stapling

source: detail web tls ocsp-stapling verdict bad
nl: Je webserver ondersteunt OCSP maar de data in het antwoord is *niet* valide.

source: detail web tls ocsp-stapling verdict good
nl: Je webserver ondersteunt OCSP en de data in het antwoord is valide.

source: detail web tls ocsp-stapling verdict ok
nl: Je webserver ondersteunt OCSP *niet*.

source: detail web tls renegotiation-client exp
nl: We testen of een client (doorgaans een webbrowser) een renegotiation kan initiëren met jouw webserver. In het algemeen is het niet nodig om clients de mogelijkheid te bieden om een renegotiation te initiëren (client-initiated renegotiation). Bovendien komt een webserver hierdoor binnen een TLS-verbinding bloot te staan aan DoS-aanvallen. Een aanvaller kan ook zonder renegotiation op initiatief van een client soortgelijke DoS-aanvallen uitvoeren door veel parallelle TLS-verbindingen te openen. Dergelijke aanvallen zijn echter eenvoudiger te traceren en met de standaardmaatregelen te mitigeren. Merk op dat client-initiated renegotiation impact heeft op de beschikbaarheid en niet op de vertrouwelijkheid. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/onderwerpen/verbindingsbeveiliging/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn 8-1 en tabel 13. *Niveau van vereistheid: Optioneel* --- **Client-initiated renegotiation** * Goed: Uit (of n.v.t. voor TLS 1.3) * Voldoende: Aan

source: detail web tls renegotiation-client label
nl: Client-initiated renegotiation

source: detail web tls renegotiation-client tech table
nl: Webserver-IP-adres|Client-initiated renegotiation

source: detail web tls renegotiation-client verdict bad
nl: Je webserver staat client-initiated renegotiation toe, wat een negatieve invloed kan hebben op de beschikbaarheid van je website.

source: detail web tls renegotiation-client verdict good
nl: Je webserver staat geen client-initiated renegotiation toe.

source: detail web tls renegotiation-secure exp
nl: We testen of je webserver secure renegotiation ondersteunt. In de oudere versies van TLS (vóór TLS 1.3) is het tot stand brengen van een nieuwe handshake toegestaan. Dit zogeheten 'opnieuw onderhandelen' (renegotiation) was in het oorspronkelijke ontwerp onveilig. Inmiddels is de standaard gerepareerd en is er een veiliger renegotiation-mechanisme beschikbaar. De oude versie wordt sindsdien als insecure renegotiation aangeduid en deze moet derhalve uitgeschakeld worden. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B8-1 en tabel 12. --- **Insecure renegotiation** * Goed: Uit (of n.v.t. voor TLS 1.3) * Onvoldoende: Aan

source: detail web tls renegotiation-secure label
nl: Secure renegotiation

source: detail web tls renegotiation-secure tech table
nl: Webserver-IP-adres|Secure renegotiation

source: detail web tls renegotiation-secure verdict bad
nl: Je webserver ondersteunt insecure renegotiation, wat uiteraard *niet* veilig is.

source: detail web tls renegotiation-secure verdict good
nl: Je webserver ondersteunt secure renegotiation.

source: detail web tls version exp
nl: We testen of je webserver alleen veilige TLS-versies ondersteunt. Een webserver kan meer dan één TLS-versie ondersteunen. Merk op dat browsermakers hebben aangekondigd dat ze zullen stoppen met de ondersteuning van TLS 1.1 en 1.0. Daardoor zullen websites die geen TLS 1.2 en/of 1.3 ondersteunen onbereikbaar worden. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B1-1 en tabel 1 --- **Versie** * Goed: TLS 1.3 * Voldoende: TLS 1.2 * Uit te faseren: TLS 1.1 en 1.0 * Onvoldoende: SSL 3.0, 2.0 en 1.0

source: detail web tls version label
nl: TLS-versie

source: detail web tls version tech table
nl: Webserver-IP-adres|TLS-versie|Status

source: detail web tls version verdict bad
nl: Je webserver ondersteunt *onvoldoende* veilige TLS-versies.

source: detail web tls version verdict good
nl: Je webserver ondersteunt alleen veilige TLS-versies.

source: detail web tls version verdict phase-out
nl: Je webserver ondersteunt TLS-versies die je weloverwogen dient *uit te faseren*, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst *onvoldoende* veilig te worden.

source: detail web tls zero-rtt exp
nl: We testen of je webserver Zero Round Trip Time Resumption (0-RTT) ondersteunt. 0-RTT is een optie in TLS 1.3 waarmee applicatiedata wordt getransporteerd tijdens het eerste handshake-bericht. 0-RTT biedt echter geen bescherming tegen replay-aanvallen op de TLS-laag en dient daarom uitgezet te worden. Alhoewel het risico gemitigeerd kan worden door 0-RTT niet toe te staan voor non-idempotent requests, is een dergelijke configuratie vaak niet triviaal, afhankelijk van applicatielogica en daardoor foutgevoelig. Als je webserver geen TLS 1.3 ondersteunt, dan is deze test niet van toepassing. Voor webservers die TLS 1.3 ondersteunen, wordt de indexpagina `/` opgehaald via TLS 1.3 en daarbij wordt de omvang van de ondersteuning voor [early data](https://www.openssl.org/docs/manmaster/man3/SSL_get_max_early_data.html) zoals [aangegeven](https://tools.ietf.org/html/rfc8446#section-4.2.10) door de webserver gecontroleerd. Indien deze groter is dan nul, dan wordt een tweede verbinding gemaakt waarbij de TLS-sessiedetails van de eerste connectie worden hergebruikt maar de HTTP opvraging _vóór_ de TLS handshake plaatsvindt (d.w.z. geen round trips (0-RTT) nodig voordat applicatiedata naar de server gaat). Als de TLS handshake slaagt en de webserver antwoordt met een non-[HTTP 425 Too Early](https://tools.ietf.org/html/rfc8470#section-5.2), dan wordt aangenomen dat de webserver 0-RTT ondersteunt. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B9-1 en tabel 14. --- **0-RTT** * Goed: Uit (of n.v.t. voor oudere versies dan TLS 1.3) * Onvoldoende: Aan

source: detail web tls zero-rtt label
nl: 0-RTT

source: detail web tls zero-rtt tech table
nl: Webserver-IP-adres|0-RTT

source: detail web tls zero-rtt verdict bad
nl: Je webserver ondersteunt 0-RTT, wat *niet* veilig is.

source: detail web tls zero-rtt verdict good
nl: Je webserver ondersteunt geen 0-RTT.

source: detail web tls zero-rtt verdict na
nl: Deze subtest is niet van toepassing aangezien je webserver TLS 1.3 niet ondersteunt.

source: detail web-mail ipv6 ns-AAAA exp
nl: We testen of je domeinnaam tenminste twee nameservers met een IPv6-adres heeft. Dit sluit aan bij de ["Technische eisen voor registratie en gebruik van .nl-domeinnamen"](https://www.sidn.nl/downloads/7li2X9A-Q1-_qkgnZn1TAg/02066e69fc93d5b64b4aa16c469c38f6/Technische_eisen_voor_registratie_en_gebruik_van_nl_domeinamen.pdf) d.d. 13 november 2017 van SIDN (beheerder van het .nl-domein) waarin staat dat iedere .nl-domeinnaam tenminste twee nameservers moeten hebben. 'IPv4-mapped IPv6 addresses' ([RFC 4291](https://datatracker.ietf.org/doc/rfc4291/), beginnend met ::ffff:) zullen falen in deze test, aangezien zij *geen* IPv6-connectiviteit bieden.

source: detail web-mail ipv6 ns-AAAA label
nl: IPv6-adressen voor nameservers

source: detail web-mail ipv6 ns-AAAA tech table
nl: Nameserver|IPv6-adres|IPv4-adres

source: detail web-mail ipv6 ns-AAAA verdict bad
nl: Geen van de nameservers van je domeinnaam heeft een IPv6-adres.

source: detail web-mail ipv6 ns-AAAA verdict good
nl: Twee of meer nameservers van je domeinnaam hebben een IPv6-adres.

source: detail web-mail ipv6 ns-AAAA verdict other
nl: Slechts één nameserver van je domeinnaam heeft een IPv6-adres.

source: detail web-mail ipv6 ns-reach exp
nl: We testen of alle nameservers, die een AAAA-record met IPv6-adres hebben, bereikbaar zijn via IPv6.

source: detail web-mail ipv6 ns-reach label
nl: IPv6-bereikbaarheid van nameservers

source: detail web-mail ipv6 ns-reach tech table
nl: Nameserver|Onbereikbaar IPv6-adres

source: detail web-mail ipv6 ns-reach verdict bad
nl: *Niet* alle nameservers die een IPv6-adres hebben zijn bereikbaar via IPv6.

source: detail web-mail ipv6 ns-reach verdict good
nl: Alle nameservers die een IPv6-adres hebben zijn bereikbaar via IPv6.

source: detail web-mail rpki ns-exists exp
nl: We testen of er een RPKI Route Origin Authorisation (ROA) is gepubliceerd voor alle IP-adressen van de nameservers van je domein. Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen van je server moeten sturen. Een route-aankondiging is echter te vervalsen. Een andere netwerkprovider kan namelijk in de positie zijn om het IP-adresblok van jouw IP-adres te koppelen aan zijn netwerk en op die manier mogelijk internetverkeer te ontvangen dat eigenlijk voor jouw netwerkprovider bedoeld is. De oorzaak kan per ongeluk of kwaadwillig zijn. In beide gevallen kan het ertoe leiden dat je server onbereikbaar is of dat internetverkeer naar je server wordt onderschept. Resource Public Key Infrastructure (RPKI) verbetert de bescherming hiertegen aanzienlijk. Met RPKI kan de rechtmatige houder van een blok IP-adressen namelijk een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation; afgekort: ROA) publiceren. Een andere netwerkprovider die internetverkeer wil sturen naar een bepaalde IP-adres, kan de bijbehorende verklaring gebruiken om ongeldige (`Invalid`) routes te filteren. Daarmee voorkomt de netwerkprovider dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd. *Niveau van vereistheid: Aanbevolen*

source: detail web-mail rpki ns-exists label
nl: Aanwezigheid van Route Origin Authorisation

source: detail web-mail rpki ns-exists tech table
nl: Nameserver|IP-adres|RPKI Route Origin Authorization

source: detail web-mail rpki ns-exists verdict bad
nl: Voor tenminste één van de IP-adressen van je nameservers is *geen* RPKI Route Origin Authorisation (ROA) gepubliceerd.

source: detail web-mail rpki ns-exists verdict good
nl: Voor alle IP-adressen van je nameservers is een RPKI Route Origin Authorisation (ROA) gepubliceerd.

source: detail web-mail rpki ns-exists verdict no-addresses
nl: Je domein bevat *geen* nameservers. Daarom kon deze subtest niet worden uitgevoerd.

source: detail web-mail rpki ns-valid exp
nl: We testen of de validatie-status van alle IP-adressen van de nameservers van je domein `Valid` is. Als er meerdere overlappende route-aankondigingen voor het IP-adres zijn, dan testen we of die allemaal `Valid` zijn. Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Dat doet hij door (delen van) zijn IP-adresblokken (Route Prefix) aan het unieke nummer van zijn providernetwerk (Route Origin ASN) te koppelen, en door deze routeringsinformatie vervolgens te verspreiden. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen moeten sturen. Aanvullend kan je hoster (of zijn netwerkprovider) voor iedere route-aankondiging een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation, afgekort: ROA) publiceren met behulp van Resource Public Key Infrastructure (RPKI). Een andere netwerkprovider die gevraagd wordt om internetverkeer te sturen naar het IP-adres van je server, kan de bijbehorende verklaring cryptografisch controleren. De gecontroleerde inhoud (Validated ROA Payload; afgekort: VRP) omvat welke providernetwerken (VRP ASN) voor ieder opgenomen IP-adresblok (VRP Prefix) geautoriseerd zijn om internetverkeer te ontvangen. De netwerkprovider kan deze inhoud vervolgens gebruiken om BGP-routes te filteren. Hij kan bijvoorbeeld eventuele `Invalid` routes weigeren om te voorkomen dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd. Het vergelijken van route-aankondigingen met route-autorisaties (RPKI Origin Validation; afgekort: ROV) kent de onderstaande drie mogelijk uitkomsten. - `Valid`: De route-aankondiging van het desbetreffende IP-adres wordt gematcht door tenminste één gepubliceerde route-autorisatie. Een route-autorisatie is ook matchend voor meer specifieke route-aankondigingen (d.w.z. voor een deel van het IP-adresblok dat in de route-autorisatie staat), tenzij deze meer specifiek zijn dan de limiet die in de route-autorisatie is bepaald (via het `maxLength` attribuut). - `Invalid`: De route-aankondiging van het desbetreffende IP-adres is wel afgedekt door een route-autorisatie, maar deze matcht *niet*. Er zijn twee mogelijke oorzaken: 1. het IP-adresblok (Route Prefix) wordt aangekondigd vanaf een providernetwerk (Route Origin ASN) dat in de route-autorisatie *niet* is geautoriseerd (resultaat in onderstaande tabel: "invalid (as)"); 2. het IP-adresblok (Route Prefix) dat wordt aangekondigd is *kleiner* dan wordt toegestaan in de route-autorisatie, d.w.z. overschrijding van `maxLength` waarde (resultaat in onderstaande tabel: "invalid (length)"). Let op: De status `Invalid` duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je hoster of zijn netwerkprovider (interne fout) óf door een derde partij (externe fout). In beide gevallen kan het leiden tot de onbereikbaarheid van je server of het onderscheppen van internetverkeer naar je server. Neem zo spoedig mogelijk contact op met je hoster. Bij een interne fout moet je hoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen. - `NotFound`: Er is geen verklaring met route-autorisatie gevonden die de route-aankondiging van het desbetreffende IP-adres afdekt. De routering van internetverkeer naar jouw server is daardoor minder veilig. Neem hierover contact op met je hoster. Deze kan zijn netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren. *Niveau van vereistheid: Aanbevolen*

source: detail web-mail rpki ns-valid label
nl: Geldigheid van route-aankondiging

source: detail web-mail rpki ns-valid tech table
nl: Nameserver|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation status

source: detail web-mail rpki ns-valid verdict bad
nl: Ten minste één IP-adres van je nameservers heeft een `NotFound` validatie-status. Er is *geen* RPKI Route Origin Authorisation (ROA) gepubliceerd voor zijn route-aankondiging.

source: detail web-mail rpki ns-valid verdict good
nl: Alle IP-adressen van je nameservers hebben een `Valid` validatie-status. De route-aankondiging van deze IP-adressen wordt gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA).

source: detail web-mail rpki ns-valid verdict invalid
nl: Tenminste één IP-adres van je nameservers heeft een `Invalid` validatie-status. De route-aankondiging van de desbetreffende IP-adressen wordt *niet* gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je nameserver-hoster (interne fout) óf door een derde partij (externe fout). In beide gevallen kan het leiden tot de onbereikbaarheid van je server of het onderscheppen van internetverkeer naar je server. Neem zo spoedig mogelijk contact op met je nameserver-hoster. Bij een interne fout moet je nameserver-hoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.

source: detail web-mail rpki ns-valid verdict not-routed
nl: Deze subtest werd *niet* uitgevoerd, omdat er voor *geen* van de IP-adressen een route-aankondiging beschikbaar was.

source: disclosure content
nl: # Meld kwetsbaarheid *Herzien op 28 maart 2023* Het Platform Internetstandaarden vindt de veiligheid van de Internet.nl-website heel belangrijk. Ondanks onze zorg voor de beveiliging kan het voorkomen dat er toch een kwetsbaarheid wordt gevonden. Heb je een zwakke plek gevonden in de Internet.nl-website? Je kunt er bijvoorbeeld per ongeluk tegenaan zijn gelopen bij het normale gebruik van deze site. Misschien heb je zelfs je best gedaan om een zwakke plek te vinden. Laat het ons in elk geval weten, zodat we zo snel mogelijk maatregelen kunnen nemen. Dit is overigens **geen** uitnodiging om onze site uitgebreid te scannen en te testen om zwakke plekken te vinden. Dat doen we zelf wel. We werken graag met je samen om de veiligheid van onze website nog beter te kunnen beschermen. Wij nemen je melding altijd serieus wanneer deze voldoet aan de voorwaarden van ons Coordinated Vulnerability Disclosure beleid, en onderzoeken elk vermoeden van een kwetsbaarheid. In ons onderstaande beleid over **Coordinated Vulnerability Disclosure** maken we duidelijk wat we je vragen en wat wij beloven als je bij ons een kwetsbaarheid meldt. ## Wij vragen je om: - je bevindingen zo snel mogelijk naar ons te sturen per [e-mail](mailto:vraag@internet.nl) of via een [GitHub security advisory](https://github.com/internetstandards/Internet.nl/security/advisories/new); - als je ons een e-mail stuurt, de e-mail bij voorkeur te versleutelen met onze PGP-sleutel; - voldoende informatie te geven om het probleem te reproduceren, zodat we het zo snel mogelijk kunnen oplossen; meestal is het IP-adres of de URL, met een omschrijving van de kwetsbaarheid voldoende, maar bij complexere kwetsbaarheden kan meer informatie nodig zijn; - geen tests uit te voeren die gebruikmaken van aanvallen op fysieke beveiliging, social engineering of applicaties van derden; - geen brute force of denial of service uit te voeren; - de kwetsbaarheid niet te misbruiken door bijvoorbeeld het veranderen of verwijderen van gegevens of het plaatsen van malware; - het probleem ook niet met anderen te delen totdat we het hebben opgelost; - geen gegevens van onze systemen te kopiëren, anders dan absoluut noodzakelijk om het lek aan te tonen; - contactgegevens (e-mailadres en telefoonnummer) achter te laten zodat we contact met je kunnen opnemen om samen te werken aan een veilig resultaat. ## Wij beloven: - binnen drie werkdagen te reageren op je melding met de beoordeling van de melding en een verwachte datum voor een oplossing; - je melding vertrouwelijk te behandelen: we delen je persoonlijke gegevens niet zonder je toestemming; uitzondering hierop zijn politie en justitie, in geval van aangifte of als gegevens worden opgeëist; - je op de hoogte te houden van de voortgang bij het oplossen van het probleem; - in berichtgeving omtrent het gemelde probleem je naam te vermelden als ontdekker, als je dat wenst; - dat een toevallige ontdekking van een kwetsbaarheid niet tot aangifte tegen je zal leiden, zolang je je aan de spelregels houdt en je in de geest van Coordinated Vulnerability Disclosure gedraagt; - als dank voor je hulp geven we je een mooi t-shirt voor elke waardevolle melding van een ons nog onbekend beveiligingsprobleem; dat is misschien geen grote beloning, maar we willen het actief scannen naar kwetsbaarheden niet aanmoedigen. ## Uitsluitingen: Omdat onze tijd schaars is en we geen gratis t-shirtwinkel zijn, vragen we je: * om **geen** triviale bevindingen te melden waarvoor geen exploits bekend zijn en/of die niet of nauwelijks risico tot gevolg hebben; * om bevindingen van geautomatiseerde vulnerability scanning tools **niet** blind te melden. Kopieer en plak geen bevindingen in een e-mail, maar probeer eerst de aard van onze website te begrijpen voordat je iets meldt; * om je te realiseren dat onze tools als open source software beschikbaar zijn en door anderen kunnen worden hergebruikt. We kunnen **geen** verantwoordelijkheid dragen voor de implementatie door deze andere partijen. Hieronder staan enkele voorbeelden van bevindingen die je **niet** bij ons hoeft te melden. Meld je ze toch, dan zullen we daarvoor **geen** beloning toekennen en mogelijk **niet** reageren op je e-mail. - Kwetsbaarheden op andere domeinen dan internet.nl; - Header information disclosures; - SSRF-kwetsbaarheid (het gaat hier niet om een kwetsbaarheid maar om bewuste functionaliteit die nodig is voor de goede werking van Internet.nl.); - Publiek toegankelijke bestanden of mappen met niet-gevoelige informatie (zoals robots.txt of afbeeldingen); - Ontbrekende standaarden die Internet.nl zelf niet promoot (zoals MTA-STS); - Vermeende afwijkingen die wél voldoen aan de testnorm die Internet.nl zelf hanteert (zoals voor security headers).

source: domain pagetitle
nl: Websitetest:

source: domain title
nl: Websitetest: {{prettyaddr}}

source: domain tweetmessage
nl: De%20website%20{{report.domain}}%20scoort%20{{score}}%25%20in%20de%20websitetest%20van%20%40Internet_nl%3A
