Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: widget mail intro
nl: # E-mailtest widget Wil je dat bezoekers van jouw website direct een e-mailtest kunnen starten? Neem dan de HTML- en CSS-code uit onderstaande tekstvakken op in de broncode van je website.

source: widget site html-block
nl: **Test je website**

source: widget site intro
nl: # Websitetest widget Wil je dat bezoekers van jouw website direct een websitetest kunnen starten? Neem dan de HTML- en CSS-code uit onderstaande tekstvakken op in de broncode van je website.
