Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: detail mail tls ciphers verdict good
nl: Al je mailservers ondersteunen alleen veilige ciphers.

source: detail mail tls ciphers verdict phase-out
nl: Tenminste één van je mailservers ondersteunt een of meer ciphers die de status *uit te faseren* hebben, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst *onvoldoende* veilig te worden.

source: detail mail tls compression exp
nl: We testen of je ontvangende mailservers (MX) TLS-compressie ondersteunen. Het gebruik van compressie kan een aanvaller informatie bieden over geheime delen van versleutelde communicatie. Een aanvaller die in staat is om een deel van de verzonden data te achterhalen of te beïnvloeden, kan door middel van een groot aantal verzoeken stukje bij beetje de oorspronkelijke data reconstrueren. TLS-compressie wordt zo weinig gebruikt dat het geen kwaad kan om deze optie uit te schakelen. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B7-1 en tabel 11. --- **Compressie-optie** * Goed: Geen compressie * Voldoende: Compressie op applicatieniveau * Onvoldoende: TLS-compressie

source: detail mail tls compression label
nl: TLS-compressie

source: detail mail tls compression tech table
nl: Mailserver (MX)|TLS-compressie

source: detail mail tls compression verdict bad
nl: Tenminste één van je mailservers ondersteunt TLS-compressie, wat *niet* veilig is.

source: detail mail tls compression verdict good
nl: Al je mailservers ondersteunen geen TLS-compressie.

source: detail mail tls dane-exists exp
nl: We testen of de nameservers van ieder van je ontvangende mailservers (MX) een of meer TLSA-records voor DANE bevatten. Aangezien DNSSEC een noodzakelijke randvoorwaarde is voor DANE, zal een domeinnaam niet slagen voor de test als DNSSEC ontbreekt op het mailserver-domein. Merk op dat de test TLSA-records van de types PKIX-TA(0) or PKIX-EE(1) negeert, omdat deze niet gebruikt dienen te worden voor ontvangende mailservers. De test slaagt daarnaast niet als er geen DNSSEC-bewijs van 'Denial of Existence' voor TLSA-records is. Als een ondertekend TLSA-record bestaat maar tegelijkertijd is er een 'insecure' `NXDOMAIN` voor hetzelfde domein (door verkeerd werkende DNSSEC-ondertekeningssoftware), dan zal de test ook niet slagen. De laatste twee foutscenario's kunnen leiden tot afleveringsproblemen van aan jou gerichte e-mails door DANE-validerende mailverzenders. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, Appendix A, onder 'Certificate pinning en DANE'.

source: detail mail tls dane-exists label
nl: DANE aanwezigheid

source: detail mail tls dane-exists tech table
nl: Mailserver (MX)|DANE TLSA-record aanwezig

source: detail mail tls dane-exists verdict bad
nl: Tenminste één van je mailserverdomeinen bevat *geen* TLSA-record voor DANE.

source: detail mail tls dane-exists verdict bogus
nl: Tenminste één van je mailserverdomeinen bevat *geen* DNSSEC-bewijs dat DANE TLSA-records niet bestaan. Dit kan leiden tot afleveringsproblemen van mail die aan aan jou gericht is door DANE-validerende mailverstuurders. Vraag je nameserver-beheerder om deze fout op te lossen.

source: detail mail tls dane-exists verdict good
nl: Al je mailserverdomeinen bevatten een TLSA-record voor DANE.

source: detail mail tls dane-rollover exp
nl: We testen of er een actief schema met tenminste twee DANE TLSA records is om de vervanging van certificaten op je ontvangende mailservers (MX) betrouwbaar te kunnen uitvoeren. Een dergelijk schema is vooral handig bij het vervangen van je mailserver-certificaten. Het kan voorkomen dat DANE tijdens de vervangingsperiode ongeldig raakt waardoor aan jouw domein gerichte mail niet afgeleverd wordt. Een vervangingsschema voor DANE kan maar hoeft niet continu 'actief' te zijn. We adviseren je om één van de twee volgende schema's met dubbele DANE TLSA records toe te passen: 1. Huidige + Volgende ("3 1 1" + "3 1 1"): Publiceer twee "DANE-EE(3) SPKI(1) SHA2-256(1)" records, één voor het huidige en één voor het volgende TLS-certificaat van je mailserver. 2. Huidige + Uitgever CA ("3 1 1" + "2 1 1"): Publiceer een "DANE-EE(3) SPKI(1) SHA2-256(1)" record voor het huidige TLS-certificaat van je mailserver, en daarnaast een "DANE-TA(2) SPKI(1) SHA2-256(1)" record voor het huidige bovenliggende certificaat van de (niet noodzakelijkerwijs publieke) certificaatautoriteit. Deze subtest accepteert ook andere combinaties van DANE TLSA records, d.w.z. "3 x x" + "3 x x" of "3 x x" + "2 x x". Andere typen dan de bovengenoemde zijn in de regel gevoeliger voor fouten en minder interoperabel. *Niveau van vereistheid: Optioneel*

source: detail mail tls dane-rollover label
nl: DANE-vervangingsschema

source: detail mail tls dane-rollover tech table
nl: Mailserver (MX)|DANE-vervangingsschema

source: detail mail tls dane-rollover verdict bad
nl: Tenminste een van je mailserver-domeinen heeft *geen* actief DANE-schema voor het betrouwbaar vervangen van certificaat-sleutels.

source: detail mail tls dane-rollover verdict good
nl: Al je mailserver-domeinen hebben een actief DANE-schema voor het betrouwbaar vervangen van certificaat-sleutels.

source: detail mail tls dane-valid exp
nl: We testen of de DANE-fingerprints die je mailserverdomeinen presenteren geldig zijn voor je mailservercertificaten. Met DANE kan je informatie over jouw mailservercertificaten publiceren in een speciaal DNS-record, een TLSA-record. Verzendende mailservers kunnen de certificaten nu niet alleen via de certificaatautoriteit, maar ook via de TLSA-records controleren op authenticiteit. Een verzendende mail server kan het TLSA-record ook als signaal gebruiken om alleen via STARTTLS (en niet onversleuteld) te verbinden. Als de DANE-fingerprint van een ontvangende mailserver wordt gecontroleerd door de verzendende mailserver, dan kan een actieve aanvaller die in staat is het berichtenverkeer te manipuleren de STARTTLS-encryptie niet verwijderen.

source: detail mail tls dane-valid label
nl: DANE geldigheid

source: detail mail tls dane-valid tech table
nl: Mailserver (MX)|DANE TLSA-record geldig

source: detail mail tls dane-valid verdict bad
nl: Tenminste één van je mailservers heeft *geen* geldige DANE-fingerprints. Óf iemand manipuleerde het antwoord van je mailserver, óf je mailserver heeft een ernstige DANE-configuratiefout. Dit laatste maakt je domeinnaam onbereikbaar voor verzendende mailservers die DANE-fingerprints controleren. Neem zo spoedig mogelijk contact op met je mailprovider.

source: detail mail tls dane-valid verdict good
nl: Ieder van je mailservers heeft tenminste één geldige DANE-fingerprint. Daardoor kunnen verzendende mailservers die DANE-verificatie ondersteunen, een geauthenticeerde versleutelde transportverbinding met je ontvangende mailserver(s) opzetten.

source: detail mail tls fs-params exp
nl: We testen of de publieke parameters, die in de Diffie-Hellman sleuteluitwisseling worden gebruikt door je mailservers (MX), veilig zijn. **ECDHE**: De veiligheid van de ECDHE-sleuteluitwisseling is afhankelijk van de geselecteerde elliptische kromme. We testen of de bitlengte van de gebruikte kromme tenminste 224 bits is. Op dit moment kunnen we niet de naam van de elliptische kromme testen. **DHE**: De veiligheid van de Diffie-Hellman Ephemeral (DHE) sleuteluitwisseling is afhankelijk van de lengte van de publieke en geheime sleutels die in de geselecteerde finite field-groep wordt gebruikt. We testen of je publieke DHE-sleutelmateriaal gebruikmaakt van een van de gepredefinieerde finite field-groepen die zijn gespecificeerd in [RFC 7919](https://tools.ietf.org/html/rfc7919). Zelf-gegenereerde groepen zijn 'Onvoldoende'. De grotere sleutellengtes die noodzakelijk zijn voor het gebruik van DHE gaan ten koste van de prestaties. Maak een zorgvuldige afweging en gebruik waar mogelijk ECDHE in plaats van DHE. **RSA als alternatief**: Naast ECDHE en DHE, kan RSA gebruikt worden voor sleuteluitwisseling. RSA loopt het risico om onvoldoende veilig te worden (huidige status 'Uit te faseren'). De publieke RSA-parameters worden getest in de subtest 'Handtekening-parameters van certificaat'. Overigens heeft RSA voor certificaatverificatie wel de status 'Goed'. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B5-1 en tabel 9 voor ECDHE, en richtlijn B6-1 en tabel 10 voor DHE. --- **Elliptische krommen voor ECDHE** * Goed: `secp384r1`, `secp256r1`, `x448`, en `x25519` * Uit te faseren: `secp224r1` * Onvoldoende: Andere krommen **Finite field-groepen voor DHE** * Voldoende: * [ffdhe4096](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe4096.pem) (RFC 7919) sha256 checksum: `64852d6890ff9e62eecd1ee89c72af9af244dfef5b853bcedea3dfd7aade22b3` * [ffdhe3072](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe3072.pem) (RFC 7919) sha256 checksum: `c410cc9c4fd85d2c109f7ebe5930ca5304a52927c0ebcb1a11c5cf6b2386bbab` * Merk op dat we ook testen op ffdhe8192 and ffdhe6144 die beide voldoende zijn. Echter, hun beperkte beveiligingswinst weegt zelden op tegen het prestatie-verlies. * Uit te faseren: * [ffdhe2048](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe2048.pem) (RFC 7919) sha256 checksum: `9ba6429597aeed2d8617a7705b56e96d044f64b07971659382e426675105654b` * Onvoldoende: Andere groepen --- Let op: de bovenstaande namen zijn gebaseerd op de [IANA naamgevingsconventies](https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml). Soms worden alternatieve namen gebruikt om te verwijzen naar dezelfde krommen, zoals `prime256v1` (ANSI) en `NIST P-256` voor `secp256r1`.

source: detail mail tls fs-params label
nl: Sleuteluitwisselingsparameters

source: detail mail tls fs-params tech table
nl: Mailserver (MX)|Getroffen parameters|Veiligheidsniveau

source: detail mail tls fs-params verdict bad
nl: Tenminste één van je mailservers ondersteunt *onvoldoende* veilige parameters voor Diffie-Hellman-sleuteluitwisseling.

source: detail mail tls fs-params verdict good
nl: Je mailserver ondersteunt voldoende veilige parameters voor Diffie-Hellman-sleuteluitwisseling.

source: detail mail tls fs-params verdict na
nl: Deze subtest is niet van toepassing, omdat je mailservers *niet* Diffie-Hellman-sleuteluitwisseling ondersteunen. Let op: RSA is een alternatief voor sleuteluitwisseling, maar heeft de status *uit te faseren*.

source: detail mail tls fs-params verdict phase-out
nl: Tenminste één van je mailservers ondersteunt parameters voor Diffie-Hellman-sleuteluitwisseling die de status *uit te faseren* hebben, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst *onvoldoende* veilig te worden.

source: detail mail tls kex-hash-func exp
nl: We testen of je mailservers (MX) ondersteuning bieden voor veilige hashfuncties om tijdens sleuteluitwisseling de digitale handtekening te maken. Een ontvangende mailserver maakt tijdens de sleuteluitwisseling gebruik van een digitale handtekening om het eigenaarschap te bewijzen van de geheime sleutel die bij het certificaat hoort. De mailserver creëert deze digitale handtekening door het ondertekenen van de output van een hashfunctie. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, tabel 5. *Niveau van vereistheid: Aanbevolen* --- **SHA2-ondersteuning voor handtekeningen** * Goed: Ja (ondersteuning van SHA-256, SHA-384 of SHA-512) * Uit te faseren: Nee (*geen* ondersteuning van SHA-256, SHA-384 of SHA-512)

source: detail mail tls kex-hash-func label
nl: Hashfunctie voor sleuteluitwisseling

source: detail mail tls kex-hash-func tech table
nl: Mailserver (MX)|SHA-2-ondersteuning voor handtekeningen

source: detail mail tls kex-hash-func verdict good
nl: Al je mailservers ondersteunen veilige hashfuncties voor sleuteluitwisseling.

source: detail mail tls kex-hash-func verdict other
nl: Het was niet mogelijk om vast te stellen welke hashfunctie tenminste één van je mailservers gebruikt. Dit kan veroorzaakt worden doordat de gebruikte cipher-combinatie geen handtekening voor certificaatverificatie heeft (bijv. deze gebruikt RSA-sleuteluitwisseling of is anoniem d.w.z. `anon`).

source: detail mail tls kex-hash-func verdict phase-out
nl: Ten minste één van je mailservers ondersteunt *geen* veilige hashfunctie voor sleuteluitwisseling. Deze instelling dien je weloverwogen *uit te faseren*, omdat deze het risico loopt in de toekomst *onvoldoende* veilig te worden.

source: detail mail tls ocsp-stapling exp
nl: OUTDATED TEXT; TEST NOT USED TODO

source: detail mail tls ocsp-stapling label
nl: OUTDATED TEXT; TEST NOT USED TODO

source: detail mail tls ocsp-stapling tech table
nl: OUTDATED TEXT; TEST NOT USED Mailserver (MX)|TODO

source: detail mail tls ocsp-stapling verdict bad
nl: OUTDATED TEXT; TEST NOT USED TODO

source: detail mail tls ocsp-stapling verdict good
nl: OUTDATED TEXT; TEST NOT USED TODO

source: detail mail tls ocsp-stapling verdict ok
nl: OUTDATED TEXT; TEST NOT USED TODO

source: detail mail tls renegotiation-client exp
nl: We testen of een verzendende mailserver een renegotiation kan initiëren met jouw ontvangende mailservers (MX). In het algemeen is het niet nodig om clients de mogelijkheid te bieden om een renegotiation te initiëren (client-initiated renegotiation). Bovendien komt een ontvangende mailserver hierdoor binnen een TLS-verbinding bloot te staan aan DoS-aanvallen. Een aanvaller kan ook zonder renegotiation op initiatief van een client soortgelijke DoS-aanvallen uitvoeren door veel parallelle TLS-verbindingen te openen. Dergelijke aanvallen zijn echter eenvoudiger te traceren en met de standaardmaatregelen te mitigeren. Merk op dat client-initiated renegotiation impact heeft op de beschikbaarheid en niet op de vertrouwelijkheid. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/onderwerpen/verbindingsbeveiliging/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn 8-1 en tabel 13. *Niveau van vereistheid: Optioneel* --- **Client-initiated renegotiation** * Goed: Uit (of n.v.t. voor TLS 1.3) * Voldoende: Aan

source: detail mail tls renegotiation-client label
nl: Client-initiated renegotiation

source: detail mail tls renegotiation-client tech table
nl: Mailserver (MX)|Client-initiated renegotiation

source: detail mail tls renegotiation-client verdict bad
nl: Tenminste één van je mailservers staat client-initiated renegotiation toe, wat een negatieve invloed kan hebben op de beschikbaarheid van je mailserver.

source: detail mail tls renegotiation-client verdict good
nl: Al je mailservers staan geen client-initiated renegotiation toe.

source: detail mail tls renegotiation-secure exp
nl: We testen of je mailservers (MX) secure renegotiation ondersteunen. In de oudere versies van TLS (vóór TLS 1.3) is het tot stand brengen van een nieuwe handshake toegestaan. Dit zogeheten 'opnieuw onderhandelen' (renegotiation) was in het oorspronkelijke ontwerp onveilig. Inmiddels is de standaard gerepareerd en is er een veiliger renegotiation-mechanisme beschikbaar. De oude versie wordt sindsdien als insecure renegotiation aangeduid en deze moet derhalve uitgeschakeld worden. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B8-1 en tabel 12. --- **Insecure renegotiation** * Goed: Uit (of n.v.t. voor TLS 1.3) * Onvoldoende: Aan

source: detail mail tls renegotiation-secure label
nl: Secure renegotiation

source: detail mail tls renegotiation-secure tech table
nl: Mailserver (MX)|Secure renegotiation

source: detail mail tls renegotiation-secure verdict bad
nl: Tenminste één van je mailservers ondersteunt insecure renegotiation, wat uiteraard *niet* veilig is.

source: detail mail tls renegotiation-secure verdict good
nl: Al je mailservers ondersteunen secure renegotiation.

source: detail mail tls starttls-exists exp
nl: We testen of je ontvangende mailservers (MX) ondersteuning bieden voor STARTTLS. Als dat het geval is, dan testen we in de subtesten van deze testcategorie of STARTTLS ook voldoende veilig is geconfigureerd. Merk op dat vanwege performance-redenen maximaal tien mailservers via of IPv6 of IPv4 worden getest voor STARTTLS en DANE. *Niet ontvangende domeinnaam*: 1. Null MX: Indien je geen mail wenst te ontvangen op je domeinnaam die A/AAAA-records heeft, dan adviseren we om "Null MX" (RFC 7505) te gebruiken. Merk op dat een "Null MX record" niet gecombineerd dient te worden met een gewoon MX-record dat naar een mail-host wijst. 2. Geen MX: In het geval dat je domein geen A/AAAA-records heeft en je er geen mail op wenst te ontvangen, adviseren we je om helemaal geen MX-record te configureren (dus ook geen "Null MX" record). Merk op dat de e-mailtest niet terugvalt op A/AAAA-records voor mailservers in geval van afwezigheid van een MX-record. * Als we een van de twee bovenstaande gevallen ontdekken, zijn de subtesten in de STARTTLS- en DANE-categorie niet van toepassing. Dit geldt ook voor de mailserver-specifieke subtests in de categorieën voor IPv6 en DNSSEC. Andere subtesten van de e-mailtest (bijv. voor DMARC) zijn nog steeds van toepassing. * Merk op dat het hebben van een "Null MX"-record of geen MX-record ook van invloed kan zijn op het verzenden van e-mail, omdat veel ontvangende servers e-mail weigeren die een ongeldig retouradres heeft. Voor een "good practice voor domeinnamen zonder mail" zie de [uitleg van de "DMARC-policy" subtest](#control-panel-9).

source: detail mail tls starttls-exists label
nl: STARTTLS beschikbaar

source: detail mail tls starttls-exists tech table
nl: Mailserver (MX)|STARTTLS

source: detail mail tls starttls-exists verdict bad
nl: Tenminste één van je mailservers biedt *geen* STARTTLS aan.

source: detail mail tls starttls-exists verdict good
nl: Al je mailservers bieden STARTTLS aan.

source: detail mail tls starttls-exists verdict invalid-null-mx
nl: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, óf je domeinnaam heeft geen A/AAAA records, waardoor het "Null MX" record onnodig is. Óf op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de "Null MX" tegenstrijdig is.

source: detail mail tls starttls-exists verdict no-null-mx
nl: Er zijn geen ontvangende mailservers (MX) ingesteld op je domeinnaam die wel A/AAAA records heeft. We adviseren je om duidelijk te laten zien dat je domeinnaam geen e-mail accepteert door een "Null MX" record te publiceren.

source: detail mail tls starttls-exists verdict null-mx
nl: Jouw domeinnaam laat duidelijk zien dat het geen e-mail accepteert door een "Null MX" record te publiceren.

source: detail mail tls starttls-exists verdict null-mx-with-other-mx
nl: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de "Null MX" tegenstrijdig is.

source: detail mail tls starttls-exists verdict null-mx-without-a-aaaa
nl: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, je domeinnaam heeft geen A/AAAA records, waardoor het "Null MX" record onnodig is.

source: detail mail tls starttls-exists verdict other
nl: Tenminste één van je mailservers is onbereikbaar.

source: detail mail tls starttls-exists verdict other-2
nl: Er zijn geen ontvangende mailservers (MX) ingesteld op je domeinnaam die geen A/AAAA records heeft. Dat is prima als je geen e-mail wilt ontvangen.

source: detail mail tls version exp
nl: We testen of je ontvangende mailservers (MX) alleen veilige TLS-versies ondersteunen. Een mailserver kan meer dan één TLS-versie ondersteunen. Merk op dat behoorlijk wat mailservers alleen oudere TLS-versies ondersteunen. Als de verzendende en ontvangende mailserver niet allebei dezelfde TLS-versie ondersteunen, dan zullen ze doorgaans terugvallen op onversleuteld transport. Om die reden kan het raadzaam zijn om de TLS-versies met status 'uit te faseren' voorlopig te blijven ondersteunen. Maak op basis van loggegevens een weloverwogen keuze voor het uitzetten van deze 'uit te faseren' TLS-versies. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B1-1 en tabel 1 --- **Versie** * Goed: TLS 1.3 * Voldoende: TLS 1.2 * Uit te faseren: TLS 1.1 en 1.0 * Onvoldoende: SSL 3.0, 2.0 en 1.0

source: detail mail tls version label
nl: TLS-versie

source: detail mail tls version tech table
nl: Mailserver (MX)|TLS-versies|Status

source: detail mail tls version verdict bad
nl: Tenminste één van je mailservers ondersteunt een of meer *onvoldoende* veilige TLS-versies.

source: detail mail tls version verdict good
nl: Al je mailservers ondersteunen alleen veilige TLS-versies.

source: detail mail tls version verdict phase-out
nl: Tenminste één van je mailservers ondersteunt een of meer TLS-versies die je weloverwogen dient *uit te faseren*, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst *onvoldoende* veilig te worden.

source: detail mail tls zero-rtt exp
nl: We testen of je mailservers (MX) Zero Round Trip Time Resumption (0-RTT) ondersteunen. 0-RTT is een optie in TLS 1.3 waarmee applicatiedata wordt getransporteerd tijdens het eerste handshake-bericht. 0-RTT biedt echter geen bescherming tegen replay-aanvallen op de TLS-laag en dient daarom uitgezet te worden. Alhoewel het risico gemitigeerd kan worden door 0-RTT niet toe te staan voor non-idempotent requests, is een dergelijke configuratie vaak niet triviaal, afhankelijk van applicatielogica en daardoor foutgevoelig. Als je mailservers geen TLS 1.3 ondersteunen, dan is deze test niet van toepassing. Voor mailservers die TLS 1.3 ondersteunen, wordt het STARTTLS-commando gegeven en wordt een TLS-sessie geïnitieerd. De omvang van de ondersteuning voor [early data](https://www.openssl.org/docs/manmaster/man3/SSL_get_max_early_data.html) zoals [aangegeven](https://tools.ietf.org/html/rfc8446#section-4.2.10) door de mailserver wordt gecontroleerd. Indien deze groter is dan nul, dan wordt een tweede verbinding gemaakt waarbij de TLS-sessiedetails van de eerste connectie worden hergebruikt, maar waarbij het EHLO-commando vóór de TLS handshake maar na het STARTTLS-commando plaatsvindt (d.w.z. geen round trips (0-RTT) nodig voordat applicatiedata naar de server gaat). Als de TLS handshake slaagt en de mailserver antwoordt, dan wordt aangenomen dat de mailserver 0-RTT ondersteunt. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B9-1 en tabel 14. --- **0-RTT** * Goed: Uit (of n.v.t. voor oudere versies dan TLS 1.3) * Onvoldoende: Aan

source: detail mail tls zero-rtt label
nl: 0-RTT

source: detail mail tls zero-rtt tech table
nl: Mailserver (MX)|0-RTT
