Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: faqs appsecpriv content
nl: ## HTTP security headers ### X-Frame-Options - ["7.6 The X-Frame-Options header" in HTML Living Standard](https://html.spec.whatwg.org/multipage/document-lifecycle.html#x-frame-options) - [RFC 7034: HTTP Header Field X-Frame-Options](https://tools.ietf.org/html/rfc7034) - [X-Frame-Options, MDN webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) ### X-Content-Type-Options - [Blog 'IE8 Security Part VI: Beta 2 Update'](https://blogs.msdn.microsoft.com/ie/2008/09/02/ie8-security-part-vi-beta-2-update/) - [X-Content-Type-Options, MDN webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) ### X-XSS-Protection (vervallen) - [X-XSS-Protection test verwijderd van Internet.nl](/article/x-xss-protection-removed-and-improvement-for-no-mx-domains/) ### Content-Security-Policy (CSP) - [Content Security Policy Level 3, W3C Working Draft](https://www.w3.org/TR/CSP3/) (In overeenstemming met CSP3 beschouwen we `frame-src` *niet* als 'deprecated'.) - [Content Security Policy Level 2, W3C Recommendation](https://www.w3.org/TR/CSP2/) - [Content-Security-Policy, MDN webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Content-Security-Policy) - [Mozilla's Laboratory (Content Security Policy / CSP Toolkit)](https://addons.mozilla.org/nl/firefox/addon/laboratory-by-mozilla/) ### Referrer-Policy - [Referrer Policy, W3C Candidate Recommendation, 26 January 2017](https://www.w3.org/TR/referrer-policy/) - [Referrer Policy, Editor’s Draft](https://w3c.github.io/webappsec-referrer-policy/) - [Referrer-Policy, MDN webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Referrer-Policy) ## Andere beveiligingsopties ### Security.txt - [RFC 9116: A File Format to Aid in Security Vulnerability Disclosure](https://tools.ietf.org/html/rfc9116) - [IANA registry for security.txt fields](https://www.iana.org/assignments/security-txt-fields/security-txt-fields.xhtml) - [Securitytxt.org](https://securitytxt.org/) - ["Wat is security.txt?"](https://www.digitaltrustcenter.nl/securitytxt) door Digital Trust Center - ["Handreiking security.txt"](https://www.ncsc.nl/documenten/publicaties/2023/maart/2/handreiking-security.txt) door NCSC-NL

source: faqs appsecpriv title
nl: Beveiligingsopties

source: faqs badges post-badge content
nl: ### Opmerkingen 1. Indien je de badges op je website wil gebruiken, dan dient de domeinnaam van die website overeen te komen met de domeinnaam die 100% scoort. Het is *niet* toegestaan om de badges op een website die een andere domeinnaam heeft te gebruiken. 2. We raden aan om de badges op je eigen webserver op te slaan en te gebruiken. Op die manier is er geen contact met onze webserver als je website wordt bezocht. We verzoeken je om iedere gebruikte badge te hyperlinken naar [https://internet.nl/](https://internet.nl/). ## Badge voor hosters De spelregels om de *Internet.nl compliant badge* voor hosters te mogen gebruiken kan je vinden in de [Hall of Fame voor Hosters](/halloffame/hosters/).

source: faqs badges pre-badge content
nl: ## Badges voor domeinnaamhouders Als jouw website of e-mail 100% scoort op Internet.nl, dan wordt je domeinnaam opgenomen in de relevante [Hall of Fame](/halloffame/). Je mag dan de desbetreffende 100%-badges gebruiken in je eigen communicatie-uitingen, zolang je je 100%-score behoudt.

source: faqs badges title
nl: Gebruik van 100%-badges

source: faqs content
nl: ## Testen * [Over de websitetest](/test-site/) * [Over de e-mailtest](/test-mail/) * [Over de verbindingstest](/test-connection/) ## Standaarden * [Modern adres (IPv6)](/faqs/ipv6/) * [Domeinnaamhandtekening (DNSSEC)](/faqs/dnssec/) * [Beveiligde websiteverbinding (HTTPS)](/faqs/https/) * [Beveiligingsopties (HTTP security headers en security.txt)](/faqs/appsecpriv/) * [Protectie tegen e-mailphishing (DMARC, DKIM en SPF)](/faqs/mailauth/) * [Beveiligde e-mailtransport (STARTTLS en DANE)](/faqs/starttls/) * [Autorisatie voor routering (RPKI)](/faqs/rpki/) ## Testrapport * [Toelichting op testrapport](/faqs/report/) * [Gebruik van de 100%-badges](/faqs/badges/)

source: faqs dnssec content
nl: ## Waarom Hieronder vindt je enkele links naar beschrijvingen van enkele bekende incidenten die DNSSEC waarschijnlijk had kunnen voorkomen. * ["Cache-poisoning attack snares top Brazilian bank"](https://www.theregister.co.uk/2009/04/22/bandesco_cache_poisoning_attack/) * ["Eircom reveals ‘cache poisoning’ attack by hacker led to outages"](https://www.siliconrepublic.com/enterprise/eircom-reveals-cache-poisoning-attack-by-hacker-led-to-outages) * ["DNS cache poisonings foist malware attacks on Brazilians"](https://www.theregister.co.uk/2011/11/07/brazilian_dns_cache_poisoing_attacks/) * ["Probable Cache Poisoning of Mail Handling Domains"](http://www.cert.org/blogs/certcc/post.cfm?EntryID=206) * ["Neither Snow Nor Rain Nor MITM... An Empirical Analysis of Email Delivery Security"](http://dl.acm.org/citation.cfm?id=2815695) Hieronder volgt een citaat uit de laatstgenoemde onderzoekspublicatie: > Mail security, like that of many other protocols, is intrinsically tangled with the security of DNS resolution. Rather than target the SMTP protocol, an active network attacker can spoof the DNS records of a destination mail server to redirect SMTP connections to a server under the attacker’s control. [...] We find evidence that 178,439 out of 8,860,639(2.01%) publicly accessible DNS servers provided invalid IPs or MX records for one or more of these domains. ## Gebruiksstatistieken * [.nl-statistieken over DNSSEC](https://stats.sidnlabs.nl/nl/) door SIDN Labs * [DNSSEC Validation Measurement](https://stats.labs.apnic.net/dnssec) door APNIC * [DNSSEC Deployment Report](http://dnssec-deployment.icann.org/dctld/) ## Achtergrondinformatie * [FAQ over DNSSEC](https://www.sidn.nl/moderne-internetstandaarden/dnssec) door SIDN * [ISOC's Deploy360 over DNSSEC](http://www.internetsociety.org/deploy360/dnssec/) * [DNSSEC.net](http://www.dnssec.net/) * [Wikipedia on DNSSEC](https://en.wikipedia.org/wiki/Domain_Name_System_Security_Extensions) ## Specificaties * [RFC 4033: DNS Security Introduction and Requirements](https://datatracker.ietf.org/doc/rfc4033) * [RFC 4034: Resource Records for the DNS Security Extensions](https://datatracker.ietf.org/doc/rfc4034) * [RFC 4035: Protocol Modifications for the DNS Security Extensions](https://datatracker.ietf.org/doc/rfc4035) * [RFC 8624: Algorithm Implementation Requirements and Usage Guidance for DNSSEC](https://datatracker.ietf.org/doc/rfc8624/) * [RFC 9276: Guidance for NSEC3 Parameter Settings](https://datatracker.ietf.org/doc/rfc9276/)

source: faqs dnssec title
nl: Domeinnaamhandtekening (DNSSEC)

source: faqs https content
nl: ## Waarom * [Does my site need HTTPS?](https://doesmysiteneedhttps.com/) * ["Why HTTPS for Everything?"](https://https.cio.gov/everything/) door CIO.gov * ["Still think you don't need HTTPS?"](https://scotthelme.co.uk/still-think-you-dont-need-https/) door Scott Helme ## Gebruiksstatistieken * [.nl-statistieken over HTTPS](https://stats.sidnlabs.nl/nl/) door SIDN Labs * ["Percentage of Web Pages Loaded by Firefox Using HTTPS"](https://letsencrypt.org/de/stats/#percent-pageloads) * ["HTTPS Usage" by Google](https://www.google.com/transparencyreport/https/metrics/?hl=en) ## Achtergrondinformatie * ["ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS), versie 2.1"](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) door NCSC-NL * ["ICT-beveiligingsrichtlijnen voor webapplicaties"](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) door NCSC-NL * [Mozilla SSL Configuration Generator](https://mozilla.github.io/server-side-tls/ssl-config-generator/) * [Bettercrypto.org](https://bettercrypto.org) * [How HTTPS works](https://howhttps.works/) ## Specificaties * [RFC 2818: HTTP Over TLS](https://datatracker.ietf.org/doc/rfc2818) * [RFC 8446: The Transport Layer Security (TLS) Protocol Version 1.3](https://datatracker.ietf.org/doc/rfc8446/) * [RFC 5246: The Transport Layer Security (TLS) Protocol, Version 1.2](https://datatracker.ietf.org/doc/rfc5246) * [RFC 6797: HTTP Strict Transport Security (HSTS)](https://datatracker.ietf.org/doc/rfc6797) * [RFC 6698: The DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS) Protocol: TLSA](https://tools.ietf.org/html/rfc6698)

source: faqs https title
nl: Beveiligde websiteverbinding (HTTPS)

source: faqs ipv6 content
nl: ## Waarom * ["Three reasons why ISPs should deploy IPv6 now"](https://internetnz.nz/blog/three-reasons-why-isps-should-deploy-ipv6-now) door George Michaelson (APNIC) * ["Making a Strong Case for IPv6"](http://www.baselinemag.com/networking/making-a-strong-case-for-ipv6.html) door John Curran (ARIN) * ["IPv6: It's time to get on board"](https://code.facebook.com/posts/1192894270727351/ipv6-it-s-time-to-get-on-board/) door Paul Saab (Facebook) ## Gebruiksstatistieken * [.nl-statistieken over IPv6](https://stats.sidnlabs.nl/nl/) door SIDN Labs * [APNIC IPv6-metingen](https://stats.labs.apnic.net/ipv6/) * [World IPv6 Launch](http://www.worldipv6launch.org/measurements/) * [Akamai IPv6-adoptie](https://www.akamai.com/us/en/about/our-thinking/state-of-the-internet-report/state-of-the-internet-ipv6-adoption-visualization.jsp) * [Google IPv6-statistieken](https://www.google.com/intl/en/ipv6/statistics.html) * [Cisco IPv6-statistieken](http://6lab.cisco.com/stats/) * [IPv6 RIPEness informatie](https://ipv6ripeness.ripe.net/) ## Achtergrondinformatie * [FAQ over IPv6](https://www.sidn.nl/moderne-internetstandaarden/ipv6) door SIDN * [ISOC's Deploy360 over IPv6](http://www.internetsociety.org/deploy360/ipv6/) * [IPv6 Info Centre van RIPE](https://www.ripe.net/publications/ipv6-info-centre/) * [Wikipedia over IPv6](https://en.wikipedia.org/wiki/IPv6) * ["Policy Issues for Receiving Email in a World with IPv6 Hosts"](https://www.m3aawg.org/sites/default/files/document/M3AAWG_Inbound_IPv6_Policy_Issues-2014-09.pdf) door M³AAWG ## Specificaties * [RFC 8200: Internet Protocol, Version 6 (IPv6) Specification](https://datatracker.ietf.org/doc/rfc8200/)

source: faqs ipv6 title
nl: Modern adres (IPv6)

source: faqs mailauth content
nl: ## Waarom * ["Why you should be doing DMARC"](https://governmenttechnology.blog.gov.uk/2016/10/04/why-you-should-be-doing-dmarc/) door GOV.uk * ["Why is DMARC important?"](https://dmarc.org/wiki/FAQ#Why_is_DMARC_important.3F) door DMARC.org ## Gebruiksstatistieken * [.nl-statistieken over DMARC](https://stats.sidnlabs.nl/nl/mail.html) door SIDN Labs * [DMARC adoption stats worldwide](https://dmarc.org/stats/farsight/dmarc/) door DMARC.org ## Achtergrondinformatie * [How-to on DMARC, DKIM and SPF](https://github.com/internetstandards/toolbox-wiki) door Platform Internetstandaarden * [FAQ over standaarden voor e-mailbeveiliging](https://www.sidn.nl/moderne-internetstandaarden/e-mailbeveiliging) door SIDN * [Factsheet 'Bescherm domeinnamen tegen phishing'](https://www.ncsc.nl/documenten/factsheets/2019/juni/01/factsheet-bescherm-domeinnamen-tegen-phishing) door NCSC-NL * [FAQ on DMARC.org](https://dmarc.org/FAQ/) * DMARC rapportage-tooling: [DMARC Analyzer](https://www.dmarcanalyzer.com/), [dmarcian](https://dmarcian.com/), [MailReport](http://www.mailreport.eu/), [URIports.com](https://www.uriports.com/), [tools on DMARC.org](https://dmarc.org/resources/products-and-services/), [tools on Github](https://github.com/search?p=2&q=dmarc+report) * [DMARC.org](https://dmarc.org/), [OpenSPF.org](http://www.openspf.org/) and [DKIM Core](http://dkimcore.org/) ## Specificaties * [RFC 7489: Domain-based Message Authentication, Reporting, and Conformance (DMARC)](https://datatracker.ietf.org/doc/rfc7489/) * [RFC 6376: DomainKeys Identified Mail (DKIM) Signatures](https://datatracker.ietf.org/doc/rfc6376) * [RFC 7208: Sender Policy Framework (SPF) for Authorizing Use of Domains in Email, Version 1](https://datatracker.ietf.org/doc/rfc7208/)

source: faqs mailauth title
nl: Protectie tegen e-mailphishing (DMARC, DKIM en SPF)

source: faqs report score content
nl: ### Welke norm hanteert Internet.nl? Internet.nl controleert de correcte toepassing van moderne Internetstandaarden die de betrouwbaarheid van online diensten vergroten. Een score van 100% betekent dat een website, e-mailvoorziening of internetverbinding volledig voldoet aan de norm waartegen wij testen. Deze norm is gebaseerd op de internetstandaarden op de 'pas toe of leg uit'-lijst van Forum Standaardisatie, op veiligheidsadviezen van NCSC, en op relevante RFC's van IETF. ### Wordt de norm ook aangepast? De norm van Internet.nl wordt met enige regelmaat aangepast omdat de stand der techniek verandert. Aanpassingen kondigen we van te voren aan via nieuwsberichten op deze website. Nieuwe subtesten zullen na introductie (meestal) niet direct meetellen in de eindscore, en hebben de status van 'AANBEVOLEN' of 'OPTIONEEL'. In de toekomst kunnen deze onderdelen de status krijgen van 'VEREIST' en wel meetellen voor de eindscore. ### Wat zegt de score over veiligheid? Hoewel de meeste van de geteste Internetstandaarden bijdragen aan een hogere veiligheid van de website, e-mailvoorziening of internetverbinding, wil een score van 100% niet zeggen dat een online dienst daarmee per definitie veilig is. Er zijn namelijk nog meer aspecten die bepalend zijn voor de veiligheid van een online dienst. Deze vallen echter buiten de scope van Internet.nl. Hou in gedachte dat Internet.nl bedoeld is als compliance-test voor standaarden en niet als beveiligingstest. ### Hoe is het testrapport gestructureerd? Internet.nl bevat **drie hoofdtesten**, namelijk voor websites, e-mailvoorzieningen en verbindingen. Deze hoofdtesten bestaan uit **testcategorieën** die **subtesten** bevatten. De websitetest heeft bijvoorbeeld een testcategorie over HTTPS die een subtest over HSTS bevat. Een subtest kan een van de volgende niveaus van vereistheid hebben (in overeenstemming met [RFC 2119](https://tools.ietf.org/html/rfc2119)): - VEREIST ('must') - AANBEVOLEN ('should') - OPTIONEEL ('may') Als een subtest 'AANBEVOLEN' of 'OPTIONEEL' is, dan wordt dat vermeld in de testuitleg. ### Hoe is de procentuele score opgebouwd? - Iedere hoofdtest resulteert in een procentuele totaalscore. - Iedere testcategorie van een hoofdtest weegt min of meer gelijk mee in de procentuele totaalscore. Dus als een hoofdtest bestaat uit vier testcategorieën, dan is de maximale score per testcategorie 25%. - Alleen de subtesten met de status 'VEREIST' wegen mee in de score per testcategorie en in de procentuele eindscore. - Websites met een score van 100% worden opgenomen in de [Hall of Fame](/halloffame/).

source: faqs report score title
nl: Norm en score

source: faqs report subtest bad
nl: Slecht: gezakt voor VEREISTE subtest ⇒ nulscore

source: faqs report subtest error
nl: Testfout: uitvoeringsfout tijdens testen ⇒ nulscore

source: faqs report subtest good
nl: Goed: geslaagd voor VEREISTE, AANBEVOLEN of OPTIONELE subtest ⇒ eerste: volledige score / laatste twee: geen impact op score

source: faqs report subtest info
nl: Ter informatie: gezakt voor OPTIONELE subtest ⇒ geen impact op score

source: faqs report subtest not-tested
nl: Niet getest, want al gezakt voor gerelateerde bovenliggende subtest ⇒ nulscore

source: faqs report subtest title
nl: Iconen per subtest

source: faqs report subtest warning
nl: Waarschuwing: gezakt voor AANBEVOLEN subtest ⇒ geen impact op score

source: faqs report test bad
nl: Slecht: gezakt voor tenminste één VEREISTE subtest ⇒ geen volledige score voor testcategorie

source: faqs report test error
nl: Testfout: uitvoeringsfout voor tenminste één subtest ⇒ geen resultaat voor testcategorie

source: faqs report test good
nl: Goed: geslaagd voor alle subtesten ⇒ volledige score voor testcategorie

source: faqs report test info
nl: Ter informatie: gezakt voor tenminste één OPTIONELE subtest ⇒ volledige score voor testcategorie

source: faqs report test title
nl: Iconen per testcategorie

source: faqs report test warning
nl: Waarschuwing: gezakt voor tenminste één AANBEVOLEN subtest ⇒ volledige score voor testcategorie

source: faqs report title
nl: Toelichting op testrapport

source: faqs rpki content
nl: ## Waarom * [Voorbeelden van BGP Hijacks](https://rpki.readthedocs.io/en/latest/ops/resources.html#examples-of-bgp-hijacks) in RPKI Documentation * [Voorbeelden van Routeringsincidenten](https://www.icann.org/en/system/files/files/sac-121-en.pdf) in SAC121 / SSAC Briefing on Routing Security (hoofdstuk 2) * [RFC 7908: Problem Definition and Classification of BGP Route Leaks](https://datatracker.ietf.org/doc/html/rfc7908.html) ## Gebruiksstatistieken * [Route Origin Authorisation (ROA) statistieken](https://roa-stats.manrs.org/) door MANRS * [Route Origin Authorisation (ROA) statistieken](https://rpki-maps.nlnetlabs.nl) door NLnet Labs * [.nl-statistieken voor Route Origin Authorisation (ROA)](https://stats.sidnlabs.nl/nl/security.html#domeinnamen%20beveiligd%20met%20rpki) door SIDN Labs * [Route Origin Validation (ROV) statistieken](https://stats.labs.apnic.net/rpki) door APNIC ## Achtergrondinformatie * [RPKI Documentation](https://rpki.readthedocs.io) door het RPKI-team bij NLnet Labs en de RPKI-community * [Mutually Agreed Norms for Routing Security (MANRS)](https://www.manrs.org/) ## Specificaties * [RFC 3779: X.509 Extensions for IP Addresses and AS Identifiers](https://datatracker.ietf.org/doc/html/rfc3779) * [RFC 6482: A Profile for Route Origin Authorizations (ROAs)](https://datatracker.ietf.org/doc/html/rfc6482) * [RFC 6811: BGP Prefix Origin Validation](https://datatracker.ietf.org/doc/html/rfc6811.html) * [RPKI RFCs Graph](https://rpki-rfc.routingsecurity.net/)

source: faqs rpki title
nl: Autorisatie voor routering (RPKI)

source: faqs starttls content
nl: ## Waarom * ["Opportunistic Security: Some Protection Most of the Time"](https://tools.ietf.org/html/rfc7435) door V. Dukhovni * ["New e-mail security protocols mandatory within government"](https://www.sidnlabs.nl/a/weblog/new-e-mail-security-protocols-mandatory-within-government?language_id=2) door Marco Davids (SIDN) * ["The sad state of SMTP encryption"](https://blog.filippo.io/the-sad-state-of-smtp-encryption/) door Filippo Valsorda ## Gebruiksstatistieken * [DANE trend graphs](http://stats.dnssec-tools.org/#graphs) * [DANE statistics](https://github.com/baknu/DANE-for-SMTP/wiki/4.-Adoption-statistics) * [.nl-statistieken over DANE](https://stats.sidnlabs.nl/nl/mail.html) door SIDN Labs * [Google's statistics on STARTTLS](https://www.google.com/transparencyreport/saferemail/?hl=en) ## Achtergrondinformatie * [How-to on 'DANE for SMTP'](https://github.com/internetstandards/toolbox-wiki) door Platform Internetstandaarden * [Wiki on 'DANE for SMTP'](https://github.com/baknu/DANE-for-SMTP/wiki) * [FAQ over standaarden voor e-mailbeveiliging](https://www.sidn.nl/moderne-internetstandaarden/e-mailbeveiliging) door SIDN * [Factsheet "Beveilig verbindingen van mailservers"](https://english.ncsc.nl/publications/factsheets/2019/juni/01/factsheet-secure-the-connections-of-mail-servers) door NCSC-NL * ["ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS), versie 2.1"](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) door NCSC-NL ## Specificaties * [RFC 3207: SMTP Service Extension for Secure SMTP over Transport Layer Security](https://datatracker.ietf.org/doc/rfc3207) * [RFC 7672: SMTP Security via Opportunistic DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS)](https://datatracker.ietf.org/doc/rfc7672) * [RFC 7671: The DNS-Based Authentication of Named Entities (DANE) Protocol: Updates and Operational Guidance](https://datatracker.ietf.org/doc/rfc7671)

source: faqs starttls title
nl: Beveiligd e-mailtransport (STARTTLS en DANE)

source: faqs title
nl: Kennisbank

source: halloffame champions menu
nl: Kampioenen!

source: halloffame champions subtitle
nl: 100% in website- *én* e-mailtest

source: halloffame champions text
nl: De {{count}} onderstaande domeinnamen scoren 100% in zowel de websitetest als de e-mailtest. Leden van deze Hall of Fame mogen [beide 100%-badges gebruiken](/faqs/badges/).

source: halloffame champions title
nl: Hall of Fame - Kampioenen!

source: halloffame mail badge
nl: Badge met tekst: 100%-score in e-mailtest

source: halloffame mail menu
nl: E-mail

source: halloffame mail subtitle
nl: 100% in e-mailtest

source: halloffame mail text
nl: De {{count}} onderstaande domeinnamen scoren 100% in de e-mailtest. Leden van deze Hall of Fame mogen de [100%-badge voor mail gebruiken](/faqs/badges/).

source: halloffame mail title
nl: Hall of Fame - E-mail

source: halloffame web badge
nl: Badge met tekst: 100%-score in websitetest

source: halloffame web menu
nl: Websites

source: halloffame web subtitle
nl: 100% in websitetest

source: halloffame web text
nl: De {{count}} onderstaande domeinnamen scoren 100% in de websitetest. Leden van deze Hall of Fame mogen de [100%-badge voor websites gebruiken](/faqs/badges/).

source: halloffame web title
nl: Hall of Fame - Websites

source: home pagetitle
nl: Test voor moderne Internetstandaarden zoals IPv6, DNSSEC, HTTPS, DMARC, STARTTLS en DANE.

source: home stats connection
nl: unieke verbindingen

source: home stats header
nl: Tests in cijfers

source: home stats mail
nl: unieke mail-domeinen

source: home stats website
nl: unieke web-domeinen

source: home teaser
nl: Moderne Internetstandaarden zorgen voor meer betrouwbaarheid en verdere groei van het Internet. Gebruik jij ze al?

source: mail pagetitle
nl: E-mailtest:

source: mail title
nl: E-mailtest: {{prettyaddr}}

source: mail tweetmessage
nl: De%20mailserver%20op%20{{report.domain}}%20scoort%20{{score}}%25%20in%20de %20e-mailtest%20van%20%40Internet_nl%3A

source: page gotocontents
nl: Ga naar tekst-inhoud

source: page gotofooter
nl: Ga naar de footer

source: page gotomainmenu
nl: Ga naar het hoofd-menu

source: page metadescription
nl: Test voor moderne Internetstandaarden IPv6, DNSSEC, HTTPS, TLS, HSTS, DMARC, DKIM, SPF, STARTTLS and DANE.

source: page metakeywords
nl: IPv6, DNSSEC, HTTPS, HSTS, TLS, DMARC, DKIM, SPF, STARTTLS, DANE, test, testtool, testen, check, controle, internet, internetstandaarden, open standaarden, moderne standaarden, beveiliging, security, internetbeveiliging, mail, e-mailbeveiliging, website, websitebeveiliging, internetverbinding, beveiligde verbinding, e-mailauthenticatie, encryptie, versleuteling, ciphers, cipher suites, PKI, SSL certificaat, TLS certificaat, websitecertificaat, Platform Internetstandaarden

source: page sitedescription
nl: Is jouw internet up-to-date?

source: page sitetitle
nl: Internet.nl

source: page404 content
nl: De pagina die u zocht staat niet op deze server. [Ga naar de homepage](/)

source: page404 title
nl: Pagina niet gevonden!
