Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: about contact
nl: ## Contact Platform Internetstandaarden p/a ECP Maanweg 174 (8e verdieping) 2516 AB Den Haag KvK-nummer: 27169301 ### E-mail [vraag@internet.nl](mailto:vraag@internet.nl) [PGP publieke sleutel](/static/question@internet.nl_0x45028563.asc) Vingerafdruk: ACB7 8829 4C7E 12BA E922 8C60 D894 E15F 4502 8563 Vervaldatum: 19 maart 2025

source: about content
nl: # Over Internet.nl ## Wat is Internet.nl? Op Internet.nl kun je eenvoudig testen of je internet up-to-date is. Gebruiken jouw [website](/test-site/), [e-mail](/test-mail/) en [internetverbinding](/test-connection/) wel **moderne, betrouwbare Internetstandaarden**? En, als dat niet zo is, wat kun je daar aan doen? ## Wie zit er achter Internet.nl? De testtool Internet.nl is een initiatief van het **Platform Internetstandaarden**. Het doel van het platform is om gezamenlijk het gebruik van moderne internetstandaarden verder te vergroten om daarmee **het internet voor iedereen toegankelijker, veiliger en betrouwbaarder** te maken. Het platform is een samenwerkingsverband van partijen uit de Internetgemeenschap en de Nederlandse overheid. Momenteel nemen de volgende partijen deel in het platform: - [Dutch Cloud Community](https://dutchcloudcommunity.nl/) - [ECP](https://ecp.nl/) - [Forum Standaardisatie](https://forumstandaardisatie.nl/) - [Internet Society internationaal](https://internetsociety.org/) - [Internet Society Nederland](https://isoc.nl/) - [Ministerie van Economische Zaken en Klimaat](https://www.rijksoverheid.nl/ministeries/ministerie-van-economische-zaken-en-klimaat) - [NCSC](https://ncsc.nl/) - [NLnet](https://nlnet.nl/) - [NLnet Labs](https://nlnetlabs.nl/) - [Rijksinspectie Digitale Infrastructuur](https://www.rdi.nl/) - [RIPE NCC](https://ripe.net/) - [SIDN](https://sidn.nl/) - [SURF](https://surf.nl/) - [Vereniging van Registrars](https://www.verenigingvanregistrars.nl/) ECP biedt de administratieve basis voor het platform. De domeinnaam Internet.nl is beschikbaar gesteld aan het platform door Internet Society Nederland. [Open Netlabs](https://opennetlabs.nl/) / NLnet Labs heeft de basis gelegd voor Internet.nl en de onderliggende tooling. Vanaf 1 april 2021 vinden onderhoud en doorontwikkeling plaats door het projectteam van het Platform Internetstandaarden. ## Wat zijn Internetstandaarden? Om wereldwijd gegevens tussen verschillende computers te kunnen uitwisselen, zijn internationale afspraken nodig over de manier waarop de computers met elkaar praten. Zeg maar de digitale "stekkers en stopcontacten" die alles met elkaar verbinden. Deze afspraken noemen we Internetstandaarden of -protocollen. Een voorbeeld is SMTP, een bekend protocol voor het versturen van e-mail. Deze technische kern van internet is voor de meeste gebruikers onzichtbaar en onbekend, maar cruciaal voor de werking van internet vandaag en in de toekomst. ## Waarom is het belangrijk om up-to-date te zijn? De oorspronkelijke internetstandaarden stammen uit de jaren '70 en '80, toen er nog maar weinig internetgebruikers waren. Inmiddels zijn er wereldwijd ruim drie miljard internetgebruikers! En deze mensen gebruiken het internet steeds meer voor privacygevoelige en kostbare transacties. De oude standaarden kunnen deze schaalvergroting niet aan en voldoen niet aan de huidige veiligheidseisen. Zo misbruiken criminelen de SMTP-standaard om het afzenderadres van een e-mail te vervalsen. We moeten dus nieuwe, slimmere standaarden gaan gebruiken die ervoor zorgen dat ons internet voldoende betrouwbaar blijft. Het goede nieuws is dat deze moderne Internetstandaarden beschikbaar zijn. ## Loopt Nederland voorop met moderne Internetstandaarden? Helaas is dat niet zo. Ook in een modern land als Nederland (dat als eerste Europese land in 1988 internettoegang kreeg) gebruiken we nog te veel verouderde standaarden die tekortschieten in betrouwbaarheid. Het niet gebruiken van moderne standaarden is een risico voor de individuele internetgebruiker, maar ook voor de "BV Nederland" en voor de gehele wereld. Help daarom mee het internet te verbeteren en zorg dat je up-to-date bent door gebruik te maken van moderne Internetstandaarden. ## Wie moet er nu aan de slag met moderne Internetstandaarden? Onze access-, hosting- en mailproviders moeten ervoor zorgen dat de moderne Internetstandaarden op de juiste manier ingesteld staan. Laten de testresultaten tekortkomingen zien? Geef dat dan door aan je provider(s). Maak je gebruik van een eigen internetverbinding, webserver of mailserver dan moet je zelf aan de slag. ## Waarom gaan jullie niet direct in gesprek met de providers? Dat doen we ook. Tegelijkertijd helpt het enorm als internetgebruikers zelf ook meer bewust worden en signalen afgeven bij hun provider(s). Je zou het niet verwachten van een modern land als Nederland, maar we gebruiken nog veel verouderde standaarden waarvan de betrouwbaarheid te wensen overlaat. Help daarom mee het internet gezamenlijk te verbeteren en vraag om moderne Internetstandaarden.

source: accessibility content
nl: # Toegankelijkheid Platform Internetstandaarden besteedt veel aandacht aan de toegankelijkheid van Internet.nl. We willen alle informatie zo aanbieden dat iedereen deze kan bekijken en gebruiken. ## Rapport toegankelijkheidsonderzoek De website Internet.nl is eind 2018 onderzocht op toegankelijkheid door stichting Accessibility. De bevindingen zijn vastgelegd in het [rapport "WCAG 2 onderzoek www.internet.nl - niveau AA"](/static/accessibility/check_6967_auto_rapport.pdf) d.d. 14 november 2018. Platform Internetstandaarden heeft op basis van deze bevindingen een aantal verbeteringen doorgevoerd voor de toegankelijkheid van Internet.nl.

source: base about
nl: Over Internet.nl

source: base accessibility
nl: Toegankelijkheid

source: base blogs
nl: Blogs

source: base contact
nl: Contact

source: base copyright
nl: Auteursrecht

source: base disclosure
nl: Kwetsbaarheid melden

source: base faqs
nl: Kennisbank

source: base halloffame
nl: Hall of Fame

source: base halloffame champions
nl: Hall of Fame - Kampioenen!

source: base halloffame lead
nl: {{count}} domeinen met 2 x 100% Laatste toevoeging: {{latest|date:'d-m-Y'}}

source: base halloffame link
nl: Naar Hall of Fame - Kampioenen!

source: base halloffame mail
nl: Hall of Fame - E-mail

source: base halloffame web
nl: Hall of Fame - Websites

source: base home
nl: Home

source: base info
nl: Internet.nl is een initiatief van de internetgemeenschap en de Nederlandse overheid.

source: base news
nl: Nieuws

source: base newslink
nl: Naar nieuwsoverzicht

source: base privacy
nl: Privacyverklaring

source: base test connection explain
nl: ## Wat wordt getest? Nadat je de verbindingstest hebt gestart, testen we of de momenteel door jou gebruikte internetverbinding ondersteuning biedt voor de onderstaande moderne Internetstandaarden. * [IPv6](/faqs/ipv6/): zijn websites met moderne internetadressen voor jou bereikbaar? * [DNSSEC](/faqs/dnssec/): worden domeinnaam-handtekeningen voor jou gecontroleerd? ## Testrapport? Nadat de test is afgerond, wordt een testrapport getoond. Dit rapport bevat een procentuele totaalscore en resultaten per testonderdeel en subtest. Voor meer informatie zie ["Toelichting op testrapport"](/faqs/report/). ## Hoe verbeteren? Het testrapport kan je gebruiken om je internetverbinding te verbeteren. Meestal kan je hiervoor het beste contact opnemen met je internetprovider. In de communicatie met je internetprovider kan je de permalink (oftewel de URL) van het testrapport gebruiken. ## Test je verbinding

source: base test connection label
nl: Test je verbinding

source: base test connection text
nl: Moderne adressen bereikbaar? Domein-handtekeningen gecontroleerd?

source: base test connection title
nl: Over de verbindingstest

source: base test explain
nl: Over de test

source: base test mail explain
nl: ## Wat wordt getest? Nadat je een e-mailadres hebt opgegeven, testen we of de achterliggende e-mailvoorziening ondersteuning biedt voor de onderstaande moderne Internetstandaarden. * [IPv6](/faqs/ipv6/): bereikbaar via modern internetadres? * [DNSSEC](/faqs/dnssec/): domeinnamen ondertekend? * [DMARC, DKIM en SPF](/faqs/mailauth/): echtheidswaarmerken tegen e-mailphishing? * [STARTTLS en DANE](/faqs/starttls/): beveiligde mailserver-verbinding? * [RPKI](/faqs/rpki/): route-autorisatie? Let op: sommige standaarden zijn zelfs relevant als je je domeinnaam niet gebruikt voor het ontvangen en verzenden van e-mail. ## Testrapport? Nadat de test is afgerond, wordt een testrapport getoond. Dit rapport bevat een procentuele totaalscore en resultaten per testonderdeel en subtest. Voor meer informatie zie ["Toelichting op testrapport"](/faqs/report/). ## Hoe verbeteren? Het testrapport kan je gebruiken om je e-mailvoorziening te verbeteren. Meestal kan je hiervoor het beste contact opnemen met je e-mailprovider. In de communicatie met je e-mailprovider kan je de permalink (oftewel de URL) van het testrapport gebruiken. ## Widget Je kan de e-mailtest integreren in je eigen website door gebruik te maken van onze [widget code](/widget-mail/). ## Test je e-mail

source: base test mail input
nl: Jouw e-mailadres:

source: base test mail label
nl: Test je e-mail

source: base test mail text
nl: Modern adres? Anti-phishing? Beveiligd transport? Route-autorisatie?

source: base test mail title
nl: Over de e-mailtest

source: base test prechecks invalid domain
nl: **De opgegeven domeinnaam is niet geldig!** Toelichting: Een A- en/of AAAA-record is noodzakelijk voor de websitetest, en een SOA-record voor de e-mailtest.

source: base test start
nl: Start test

source: base test website explain
nl: ## Wat wordt getest? Nadat je een domeinnaam van een website heb opgegeven, testen we of de website ondersteuning biedt voor de onderstaande moderne Internetstandaarden. * [IPv6](/faqs/ipv6/): bereikbaar via modern internetadres? * [DNSSEC](/faqs/dnssec/): domeinnaam ondertekend? * [HTTPS](/faqs/https/): beveiligde verbinding? * [Beveiligingsopties](/faqs/appsecpriv/): beveiligingsopties ingesteld? * [RPKI](/faqs/rpki/): route-autorisatie? ## Testrapport? Nadat de test is afgerond, wordt een testrapport getoond. Dit rapport bevat een procentuele totaalscore en resultaten per testonderdeel en subtest. Voor meer informatie zie ["Toelichting op testrapport"](/faqs/report/). Als je website een score van 100% heeft, dan wordt deze opgenomen in de [Hall of Fame](/halloffame/). ## Hoe verbeteren? Het testrapport kan je gebruiken om je website te verbeteren. Meestal kan je hiervoor het beste contact opnemen met je webhoster. In de communicatie met je webhoster kan je de permalink (oftewel de URL) van het testrapport gebruiken. ## Widget Je kan de websitetest integreren in je eigen website door gebruik te maken van onze [widget code](/widget-site/). ## Test je website

source: base test website input
nl: Jouw website-domeinnaam:

source: base test website label
nl: Test je website

source: base test website text
nl: Modern adres? Beveiligde verbinding? Beveiligingsopties? Route-autorisatie?

source: base test website title
nl: Over de websitetest

source: base widget mail
nl: E-mailtest widget

source: base widget site
nl: Websitetest widget

source: connection pagetitle
nl: Verbindingstest

source: connection title
nl: Verbindingstest

source: copyright content
nl: # Auteursrecht ## Content Tenzij anders vermeld, is de inhoud van de website Internet.nl beschikbaar onder de ["Creative Commons Naamsvermelding 4.0 Internationaal" licentie](https://creativecommons.org/licenses/by/4.0/deed.nl). ## Broncode De software-broncode van Internet.nl is gepubliceerd onder de [Apache Licentie, versie 2.0](https://opensource.org/licenses/Apache-2.0) op [Github](https://github.com/internetstandards/Internet.nl). ## Bouwstenen Internet.nl is mede mogelijk gemaakt door andere open source software te gebruiken en te combineren. De belangrijkste open source bouwstenen van Internet.nl zijn: - [Python 3](https://www.python.org/) (belangrijkste programmeertaal) - [Django](https://www.djangoproject.com/) (web framework) - [PostgreSQL](https://www.postgresql.org/) (database) - [Celery](http://www.celeryproject.org/) (backend voor asynchrone taken) - [Redis](https://redis.io/) (cache backend voor Django en Celery) - [RabbitMQ](https://www.rabbitmq.com/) (message broker voor Celery) - [unbound/libunbound](https://www.nlnetlabs.nl/projects/unbound/about/) (voor DNS-gerelateerde testen en functionaliteit) - [nassl](https://github.com/nabla-c0d3/nassl) (Python bindings voor OpenSSL; voor TLS-gerelateerde testen) - [Routinator](https://www.nlnetlabs.nl/projects/rpki/routinator/) (voor RPKI-gerelateerde testen) - [SecTXT](https://github.com/DigitalTrustCenter/sectxt) (voor security.txt-test) - [Postfix](https://www.postfix.org/) (mailserver voor interactieve e-mailtest, _beta_) ## Namen en logo's - De naam Internet.nl en het Internet.nl-logo zijn expliciet uitgesloten van bovengenoemde licentiëring. We geven geen toestemming voor het gebruik van beide als onze content of softwarecode wordt hergebruikt, tenzij er door ons een expliciete uitzondering wordt gemaakt en aan de bijbehorende criteria is voldaan (bijv. bij de [100%-badges](/faqs/badges/)). - De namen en logo's in de iconen die verwijzen naar onze plekken op social media zijn expliciet uitgesloten van bovengenoemde licentiëring. ## Andere testwebsites gebaseerd op Internet.nl Voor zover bekend hebben de volgende test-websites de Internet.nl broncode hergebruikt. Laat het ons weten als jouw website gebaseerd is op onze broncode. - [aucheck.com.au](https://aucheck.com.au/) (Australië) - [top.nic.br](https://top.nic.br/) (Brazilië) - [sikkerpånettet.dk](https://sikkerpånettet.dk/) (Denemarken)

source: detail conn dnssec validation exp
nl: We testen of de door jou gebruikte resolvers de DNSSEC-handtekeningen van onze domeinnaam valideren. Resolvers worden normaal gesproken geleverd door je internetprovider. Als alternatief kun je resolvers van een andere DNS provider instellen. Je kan zelfs je eigen lokaal geïnstalleerde resolver gebruiken. Hoewel validatie plaatsvindt op de resolver, kan nog steeds door een aanvaller gerommeld worden met de communicatie tussen de resolver en jouw apparaat (ook wel 'last mile' genoemd). Het is daarom het meest veilig om zo dicht mogelijk op je apparaat te valideren (bijv. door een lokaal geïnstalleerde resolver te gebruiken), of zorg ervoor dat het kanaal tussen je resolver en je apparaat beveiligd c.q. vertrouwd is.

source: detail conn dnssec validation label
nl: DNSSEC-validatie

source: detail conn dnssec validation tech table
nl: DNS-provider

source: detail conn dnssec validation verdict bad
nl: Je bent *niet* beschermd door validatie van DNSSEC-handtekeningen.

source: detail conn dnssec validation verdict good
nl: Je bent beschermd door validatie van DNSSEC-handtekeningen.

source: detail conn ipv6 connection exp
nl: We testen of jouw apparaat via zijn huidige internetverbinding in staat is om *direct* (d.w.z. zonder DNS-vertaling) verbinding te maken met onze webserver via ons bijbehorende IPv6-adres. Sommige browser add-ons en routers bieden functionaliteit aan voor het filteren van domeinnamen om de privacy te verbeteren of internetgebruik te beperken. Om omzeiling te voorkomen blokkeert deze functionaliteit vaak ook het direct verbinden met IP-adressen waardoor deze subtest faalt.

source: detail conn ipv6 connection label
nl: IPv6-connectiviteit (direct)

source: detail conn ipv6 connection tech table
nl: Geanonimiseerd IPv6-adres|Reverse name|Internetprovider

source: detail conn ipv6 connection verdict bad
nl: Je bent *niet* in staat om computers direct op hun IPv6-adres te bereiken.

source: detail conn ipv6 connection verdict good
nl: Je bent in staat om computers direct op hun IPv6-adres te bereiken.

source: detail conn ipv6 dns-conn exp
nl: We testen of jouw apparaat middels zijn huidige internetverbinding in staat is om verbinding te maken met onze webserver via IPv6. Voor deze test bieden we een domeinnaam aan en we verwachten dat je resolver voor deze domeinnaam het bijbehorende IPv6-adres ophaalt.

source: detail conn ipv6 dns-conn label
nl: IPv6-connectiviteit (via DNS)

source: detail conn ipv6 dns-conn verdict bad
nl: Je bent *niet* in staat om computers via DNS op hun IPv6-adres te bereiken.

source: detail conn ipv6 dns-conn verdict good
nl: Je bent in staat om computers via DNS op hun IPv6-adres te bereiken.

source: detail conn ipv6 ipv4-conn exp
nl: We testen of jouw apparaat middels zijn huidige internetverbinding in staat is om verbinding te maken met onze webserver via IPv4. Voor deze test bieden we een domeinnaam aan en we verwachten dat je resolver voor deze domeinnaam het bijbehorende IPv4-adres ophaalt. *Niveau van vereistheid: Optioneel*

source: detail conn ipv6 ipv4-conn label
nl: IPv4-connectiviteit (via DNS)

source: detail conn ipv6 ipv4-conn tech table
nl: Geanonimiseerd IPv4-adres|Reverse name|Internetprovider

source: detail conn ipv6 ipv4-conn verdict bad
nl: Je bent *niet* in staat om computers via DNS op hun IPv4-adres te bereiken.

source: detail conn ipv6 ipv4-conn verdict good
nl: Je bent in staat om computers via DNS op hun IPv4-adres te bereiken.

source: detail conn ipv6 privacy exp
nl: We testen of je apparaat 'IPv6 Privacy Extensions for SLAAC' (of een ander IPv6-configuratieproces dan SLAAC) gebruikt om het lekken van zijn mogelijk privacygevoelige MAC-adres naar computers waarmee het via IPv6 verbinding maakt te voorkomen.

source: detail conn ipv6 privacy label
nl: Privacy Extensions voor IPv6

source: detail conn ipv6 privacy verdict bad
nl: Je gebruikt SLAAC *zonder* 'IPv6 Privacy Extensions'.

source: detail conn ipv6 privacy verdict good
nl: Je hebt 'IPv6 Privacy Extensions' geactiveerd (of je gebruikt geen SLAAC).

source: detail conn ipv6 resolver-conn exp
nl: We testen of ten minste één van de door jou gebruikte DNS-resolvers in staat is om onze autoritatieve nameserver te bereiken via IPv6. Vaak levert je internetprovider de DNS-resolver(s).

source: detail conn ipv6 resolver-conn label
nl: IPv6-connectiviteit van DNS-resolver

source: detail conn ipv6 resolver-conn verdict bad
nl: Je DNS-resolver kan *niet* nameservers via IPv6 bereiken.

source: detail conn ipv6 resolver-conn verdict good
nl: Je DNS-resolver kan nameservers via IPv6 bereiken.

source: detail mail auth dkim exp
nl: We testen of je domeinnaam DKIM ondersteunt. Een ontvangende mailserver kan de publieke sleutel in je DKIM-record gebruiken om de handtekening in een e-mail met een gebruiker van jouw domein als afzender te controleren en de authenticiteit van de e-mail te bepalen. * Om te slagen voor deze test verwachten we dat je nameserver `NOERROR` antwoordt op onze bevraging voor `_domainkey.example.nl`. Als `_domainkey.example.nl` een 'empty non- terminal' is, dan zullen sommige nameservers die zich niet houden aan de standaard RFC2308, foutief antwoorden met `NXDOMAIN` in plaats van `NOERROR`. Dit maakt het detecteren van het DKIM-record voor ons onmogelijk. * Op dit moment zijn we niet in staat om de publieke sleutel in je DKIM-record op te vragen en te beoordelen, omdat we daarvoor een e-mail van jouw domein zouden moeten ontvangen. * Bij deze test gaan we uit van 'strict alignment' hetgeen conform DMARC is. Het geteste domein wordt beschouwd als het verzenddomein in het mailbericht (`From:`) en moet gelijk zijn aan zowel het DKIM-domein (`d=`) als het SPF-domein (envelope sender, d.w.z. return-path dat terugkomt in `MAIL FROM`). Voor een "good practice voor domeinnamen zonder mail" zie de [uitleg van de "DMARC-policy" subtest](#control-panel-9).

source: detail mail auth dkim label
nl: DKIM aanwezigheid

source: detail mail auth dkim verdict bad
nl: Je domeinnaam ondersteunt *geen* DKIM-records.

source: detail mail auth dkim verdict good
nl: Je domeinnaam ondersteunt DKIM-records.

source: detail mail auth dkim verdict no-email
nl: Je domeinnaam ondersteunt *geen* DKIM-records. Echter omdat je DMARC- en SPF-records aangeven dat er geen mail vanaf je domein wordt verstuurd, is DKIM niet nodig en wordt deze subtest overgeslagen.

source: detail mail auth dmarc exp
nl: We testen of DMARC beschikbaar is voor jouw domein. Een ontvangende mailserver kan de DMARC-policy gebruiken om te bepalen hoe om te gaan met een e-mail met jouw domein als verzender waarvan de authenticatie met zowel DKIM als SPF faalt, en de ontvangende mailserver kan je e-mailadres uit het DMARC-record gebruiken om je feedbackrapporten over het authenticatieresultaat te sturen. Het hebben van meer dan één DMARC-record op hetzelfde domein is niet geldig en zorgt ervoor dat het domein voor de test faalt. Let op: DMARC vereist dat het SPF-domein (envelope sender, d.w.z. return-path dat terugkomt in `MAIL FROM`) en het DKIM-domein (`d=`) gelijk zijn aan het verzenddomein in het mailbericht (`From:`).

source: detail mail auth dmarc label
nl: DMARC aanwezigheid

source: detail mail auth dmarc tech table
nl: DMARC-record|Gevonden op

source: detail mail auth dmarc verdict bad
nl: Je domeinnaam heeft *geen* DMARC-record.

source: detail mail auth dmarc verdict good
nl: Je domeinnaam heeft een DMARC-record.

source: detail mail auth dmarc-policy exp
nl: We controleren of de syntax van je DMARC-record correct is en of deze een voldoende strikte policy bevat (`p=quarantine` of `p=reject`) om misbruik van je domein door phishers en spammers tegen te gaan. Zelfs zonder een strikte policy kan DMARC nuttig zijn om met behulp van DMARC-rapporten meer inzicht te verkrijgen in legale en illegale uitgaande e-mailstromen. Maar om DMARC effectief te laten zijn tegen misbruik van je domein, is een liberale policy (`p=none`) niet voldoende. We controleren ook of de mailadressen onder `rua=` en `ruf=` geldig zijn. Als deze een extern e-mailadres bevatten dan controleren we of het externe domein geautoriseerd is om DMARC-rapportages te ontvangen. Zorg ervoor dat het DMARC-autorisatierecord op het externe domein ten minste `"v=DMARC1;"` bevat. *Good practice voor domeinnaam zonder mail:* * Niet-verzendend: Gebruik de meest strikte DMARC policy (`p=reject`) en SPF policy (`-all`) voor (sub-)domeinnamen die je niet gebruikt om mail vanaf te versturen, om misbruik ('spoofing') tegen te gaan. Merk op dat DKIM in dit geval niet noodzakelijk is. * Niet-ontvangend: Voor meer informatie over "Null MX" en "No MX" zie de uitleg van de ["STARTTLS beschikbaar" subtest](#control-panel-13). Hieronder volgen twee basisvoorbeelden van de DNS-configuratie voor een domeinnaam die niet gebruikt wordt voor het verzenden en ontvangen van mail. *A. Enkele domeinnaam zonder A- of AAAA-record* example.nl. TXT "v=spf1 -all" *.example.nl. TXT "v=spf1 -all" _dmarc.example.nl. TXT "v=DMARC1; p=reject;" &nbsp; *B. Enkele domeinnaam met A- of AAAA-record* example.nl. AAAA 2a00:d78:0:712:94:198:159:35 example.nl. A 94.198.159.35 example.nl. MX 0 . example.nl. TXT "v=spf1 -all" *.example.nl. TXT "v=spf1 -all" www.example.nl. CNAME example.nl _dmarc.example.nl. TXT "v=DMARC1; p=reject;"

source: detail mail auth dmarc-policy label
nl: DMARC policy

source: detail mail auth dmarc-policy verdict bad
nl: Je DMARC-policy is syntactisch *niet* correct.

source: detail mail auth dmarc-policy verdict external
nl: De domeinnaam van het mailadres na `rua=` en/of `ruf=` bevat *geen* (geldig) autorisatie-record om DMARC-rapporten te ontvangen voor de geteste domeinnaam.

source: detail mail auth dmarc-policy verdict good
nl: Je DMARC-policy is voldoende strikt.

source: detail mail auth dmarc-policy verdict policy
nl: Je DMARC-policy is *niet* voldoende strikt.
