Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: privacy content
nl: # Privacyverklaring *Herzien op 28 maart 2023* Platform Internetstandaarden respecteert jouw privacy en streeft ernaar het verzamelen en het verwerken van jouw persoonsgegevens tot een minimum te beperken. Met deze privacyverklaring, willen we je graag informeren over welke persoonsgegevens we verzamelen als je onze website en andere diensten op Internet.nl gebruikt en hoe we deze gegevens verwerken. Je rechten zijn vastgelegd in de van toepassing zijnde wetten, met name de [Europese Algemene verordening gegevensbescherming (AVG)](https://eur-lex.europa.eu/legal-content/NL/TXT/HTML/?uri=CELEX:32016R0679) en de [Nederlandse Telecommunicatiewet](http://wetten.overheid.nl/BWBR0009950/). ## Welke gegevens worden verzameld? ### Website (Internet.nl) #### Applicatie Als je Internet.nl gebruikt dan verzamelen we gegevens die noodzakelijk zijn voor het functioneren van de website. - IP-adres van je client ('remote host') die het connectieverzoek aan onze webserver deed; - Als een connectietest wordt uitgevoerd, dan worden alleen het *geanonimiseerde* IP-adres en de *geanonimiseerde* reverse name opgeslagen in de applicatiedatabase en getoond in het connectietestrapport dat beschikbaar is voor de gebruiker via een permalink. - In alle andere gevallen wordt je (volledige of je geanonimiseerde) IP-adres *niet* opgeslagen in de applicatiedatabase. - Domeinnamen die je invult om een e-mailtest of websitetest uit te voeren: - Domeinnamen worden opgeslagen in de applicatiedatabase. Ze worden getoond in de testrapporten die beschikbaar zijn voor de gebruiker via een permalink en kunnen worden getoond in de Hall of Fame. - Alleen de domeinnaam wordt opgeslagen, maar *niet* het 'lokale deel' (d.w.z. het deel voor @example.nl) van een ingevuld e-mailadres. #### Serverlogs Om connectieproblemen te verhelpen en om (beveiligings-)incidenten op te lossen bewaren we de volgende gegevens in onze webserverlogs. - IP-adres van je client ('remote host') die het connectieverzoek aan onze webserver deed; - Tijdstip dat het verzoek werd ontvangen; - ‘User-Agent HTTP request header’ die je client browser rapporteerde; - Statuscode die de server terugstuurde naar je client; - Grootte van het object dat teruggestuurd werd naar je client; - Foutbericht met betrekking tot de verwerking van het verzoek. #### Gebruikersanalyse We plaatsen analytische cookies op je apparaat om het gebruik van Internet.nl te analyseren. We maken daarvoor gebruik van Matomo (formerly Piwik) op onze eigen webserver. Matomo is een van de meest privacy-vriendelijke gebruikersanalyse-tools die momenteel beschikbaar zijn. De met behulp van de cookies gegenereerde statistieken worden alleen gebruikt om de website verder te verbeteren. We verzamelen de volgende gegevens: - IP-adres (geanonimiseerd); - Zeer ruwe locaties van de gebruiker gebaseerd op het geanonimiseerde IP-adres; - Datum en tijd; - Titel van de bezochte pagina; - URL van de bezochte pagina; - URL van de pagina die bezocht werd voorafgaand aan de huidige pagina; - Schermresolutie; - Tijd in locale tijdzone; - Bestanden die aangeklikt en gedownload zijn; - Aangeklikte links naar externe domeinen; - Tijdsduur voor paginageneratie; - Hoofdtaal van de browser; - ‘User Agent’ van je browser. Omdat de impact van de analytische cookies op je privacy erg beperkt is in het kader van de AVG en artikel 11.7a van de Telecommunicatiewet, hoef je geen toestemming te geven. Als je niet wil dat we je apparaat volgen, dan bevelen we aan dat je de functie voor *Do Not Track* in je browser activeert. Matomo volgt geen gebruikers die de Do Not Track functie gebruiken (zie [deze link](https://matomo.org/docs/privacy/#step-4-respect-donottrack-preference) op Matomo.org). Voor meer informatie over Do Not Track en hoe het te activeren in je browser, zie de website [All About Do Not Track](https://allaboutdnt.com/). ### Email (@internet.nl) Als je email stuurt naar [vraag@internet.nl](mailto:vraag@internet.nl) dan verzamelen we de volgende gegevens: - Het gebruikte e-mailadres en andere ‘mail header data’ (zoals tijdstip); - Andere persoonsgegevens die door de verzender zijn opgenomen in het mailbericht. ## Welke diensten van derde partijen worden gebruikt? ### WHOIS In de website- en e-mailtest wordt via WHOIS de registrar van het geteste domein opgevraagd. Daarvoor wordt met het WHOIS-protocol (plain text op TCP port 43) een bevraging gedaan van de [IANA WHOIS Service](https://www.iana.org/whois) en van de WHOIS Service van de desbetreffende TLD registry (bijv. de [WHOIS Service van SIDN](https://www.sidn.nl/whois)). ### Team Cymru * In het RPKI-testonderdeel van de website- en e-mailtest wordt voor ieder gevonden IP-adres het bijbehorende BGP Origin ASN opgevraagd met behulp van de ["IP to ASN Mapping Service"](https://team-cymru.com/community-services/ip-asn-mapping/) van Team Cymru. * In de verbindingstest wordt voor de IP-adressen van je client en van je DNS-provider de ASN Description (t.b.v. de naam van de internetprovider en de DNS-provider) opgevraagd met behulp van de ["IP to ASN Mapping Service"](https://team-cymru.com/community-services/ip-asn-mapping/) van Team Cymru. IP-adressen worden voorafgaand aan de bevraging zoveel mogelijk geanonimiseerd (voor IPv4 op een /24, voor IPv6 op een /48). De bevraging vindt plaats via DNS op UDP port 53. ### Reverse DNS In de verbindingstest wordt voor het niet-geanonimiseerde IP-adres van je client (via ["in-addr.arpa" en "ip6.arpa"](https://www.iana.org/domains/arpa)) de reverse name opgevraagd met behulp van onze lokale DNS resolver. ### Sentry We gebruiken [Sentry](https://sentry.io/) om crashes en soortgelijke bugs in tests of pagina's te loggen. Hiervoor sturen we Sentry het domein dat wordt getest, alle informatie die in de test wordt verzameld, en de HTTP-headers van het verzoek. Wij nemen het IP-adres van je client niet op in de informatie die wij naar Sentry sturen. Informatie wordt alleen verzonden in het geval van crashende tests of pagina's. Over uitgevoerde tests of opgevraagde pagina's die niet leiden tot crashes wordt geen informatie gedeeld. ## Welke maatregelen zijn genomen om de verzamelde data te beveiligen? ### Toegang en derde partijen Onze diensten draaien op servers, die worden beheerd door Prolocation. ECP voert het inhoudelijk beheer over de mailbox. Verzamelde data en ontvangen informatie kan gedeeld worden met andere [leden van het Platform Internetstandaarden](/about/) maar alleen om vragen te beantwoorden, problemen op te lossen of om de diensten te verbeteren. Behalve de diensten genoemd onder "Welke diensten van derde partijen worden gebruikt?", worden er geen diensten van andere partijen (zoals externe gebruikersanalyse-tooling of web fonts) gebruikt. We geven op geen enkele manier persoonsgegevens die door ons zijn verzameld door aan derde partijen (d.w.z. buiten het Platform Internetstandaarden), tenzij we juridisch daartoe verplicht zijn (bijvoorbeeld als autoriteiten met een juridische grondslag ons verzoeken om data). ### Technische maatregelen We hebben onder andere de volgende maatregelen geïmplementeerd om je persoonsgegevens te beveiligen. - Moderne, veilige standaarden zijn in gebruik. We voldoen aan onze eigen testen. Onze webserver biedt bijvoorbeeld een beveiligde verbinding aan (HTTPS) en ons domein is ondertekend (DNSSEC); - Software op onze servers wordt geregeld geüpdatet; - Onze beheerders gebruiken sterke authenticatie voor toegang tot onze servers. Mocht je ondanks onze inspanningen een kwetsbaarheid vinden, dan vragen we je om in overeenstemming met ons beleid voor ['responsible disclosure'](/disclosure/) policy te handelen. ### Anonimisering - Applicatie: Het anonimiseren van het IP-adres van de client betekent dat tenminste de laatste 16 bits van ieder IPv4-adres en de laatste 96 bits van ieder IPv6-adres worden weggegooid en vervangen door nullen, voordat het IP-adres wordt opgeslagen in de applicatiedatabase (zichtbaar is bijvoorbeeld alleen 198.51.0.0 of 2001:db8::). Daarnaast anonimiseren we de gevonden ‘reverse name’ door de eerste één of meer labels te maskeren. Door het IP-adres en de ‘reverse name’ te anonimiseren, zorgen we ervoor dat het normaal gesproken vrijwel onmogelijk is om deze te relateren aan een persoon, zelfs niet met de aanverwante gegevens die zijn verzameld. IP-adressen die horen bij webservers, mailservers of nameservers worden niet geanonimiseerd, omdat we deze beschouwen als publieke gegevens die zijn gepubliceerd in DNS. Hetzelfde geldt voor domeinnamen; deze beschouwen we ook als publieke gegevens. - Gebruikersanalyse: Tenminste 16 bits voor IPv4 en 80 bits voor IPv6 worden weggegooid en vervangen door nullen voordat het IP-adres in onze gebruikersanalyse-tooling (zichtbaar is bijvoorbeeld alleen 198.51.0.0 or 2001:db81:85a3::) opslaan. ### Bewaartermijn voor gegevens - Applicatie: Omdat we de geanonimiseerde IP-adressen en aanverwante gegevens niet direct kunnen worden gerelateerd aan een persoon, houden we geen specifieke bewaartermijn aan voor gegevens in onze applicatiedatabase. - Serverlogs: Gegevens die zijn verzameld in onze serverlogs worden verwijderd na drie kalendermaanden. - Gebruikersanalyse: Individuele gebruikersgegevens (inclusief het geanonimiseerde IP-adres) in onze gebruikersanalyse-tooling worden na 90 dagen verwijderd. - Email: Het verwerken van emails is een kern activiteit van Platform Internetstandaarden. Op basis van de [eisen](https://www.belastingdienst.nl/wps/wcm/connect/bldcontentnl/belastingdienst/zakelijk/ondernemen/administratie/administratie_opzetten/wat_hoort_er_allemaal_bij_uw_administratie) gesteld door De Belastingdienst, wordt email correspondentie na zeven jaar verwijderd. ## Inspectie, correctie en verwijdering van gegevens Op basis van de Europese Algemene verordening gegevensbescherming heb je het recht om op verzoek toegang te krijgen tot je persoonsgegevens, en indien noodzakelijk, om deze aan te passen of te verwijderen. Neem [contact](/about/) met ons op als je dat graag wenst. Omdat we je volledige IP-adres slechts tijdelijk bewaren in onze serverlogs, kan het nodig zijn dat je ons additionele informatie dient te verschaffen, zoals over je apparaat en browser en het bezoektijdstip, zodat we aan je verzoek kunnen voldoen. ## Herziening privacyverklaring We kunnen de privacyverklaring herzien. Veranderingen zullen we aankondigen op onze website. Oude versies van onze privacyverklaring worden gearchiveerd. Stuur ons een e-mail als je deze wil inzien.

source: probes auto-redirect
nl: Als de test gereed is, word je automatisch doorgestuurd naar de resultaatpagina.

source: probes no-javascript
nl: Controleer of de testresultaten beschikbaar zijn. Zo niet, dan word je automatisch teruggeleid naar deze pagina.

source: probes no-javascript-connection
nl: JavaScript inactief. Activeer JavaScript om de test toch uit te kunnen voeren.

source: probes no-redirection
nl: Testfout. Probeer het later opnieuw, of test een andere domeinnaam.

source: probes test-finished
nl: Test klaar! Resultaten beschikbaar...

source: probes test-running
nl: Bezig...

source: probes tests-description
nl: De onderstaande onderdelen worden getest.

source: probes tests-duration
nl: Het testen duurt tussen de 5 en {{cache_ttl}} seconden.

source: results dated-presentation
nl: Oude resultaatpresentatie. Doe de test opnieuw.

source: results domain appsecpriv http-headers label
nl: HTTP security headers

source: results domain appsecpriv other-options label
nl: Andere beveiligingsopties

source: results domain ipv6 web-server label
nl: Webserver

source: results domain rpki web-server label
nl: Webserver

source: results domain tls http-headers label
nl: HTTP headers

source: results domain tls https label
nl: HTTP

source: results domain tls tls label
nl: TLS

source: results domain-mail ipv6 name-servers label
nl: Nameservers van domein

source: results domain-mail rpki name-servers label
nl: Nameservers van domein

source: results domain-mail tls certificate label
nl: Certificaat

source: results domain-mail tls dane label
nl: DANE

source: results empty-argument-alt-text
nl: Geen

source: results explanation label
nl: Testuitleg:

source: results further-testing connection content
nl: - ### IPv6: - [IPv6 test](http://ipv6-test.com/) - ### DNSSEC-validatie: - [DNSSEC resolver algorithm test](https://rootcanary.org/test.html) - ### HTTPS: - [SSL Client Test](https://www.ssllabs.com/ssltest/viewMyClient.html) - ### RPKI-validatie - [RPKI Webtest](https://rpkitest.nlnetlabs.net/) - [Is BGP safe yet?](https://isbgpsafeyet.com/)

source: results further-testing connection label
nl: Aanvullende verbindingstesten

source: results further-testing mail content
nl: - ### IPv6: - [IP6.nl](https://ip6.nl/) - [IP address visibility](https://stat.ripe.net/widget/visibility) - ### DNSSEC: - [DNSViz](http://dnsviz.net/) - [Zonemaster](https://zonemaster.net) - ### DMARC, DKIM en SPF : - [MECSA - EU Commissie](https://mecsa.jrc.ec.europa.eu/) (ook STARTTLS+DANE) - [Learn DMARC](https://www.learndmarc.com/) - [Mail-tester.com](https://www.mail-tester.com/) - ### STARTTLS en DANE: - [DANE SMTP Validator](https://dane.sys4.de/) - [DANE survey results](https://stats.dnssec-tools.org/) - [HaveDane.net](https://havedane.net/) - ### RPKI: - [Routinator](https://routinator.nlnetlabs.nl/) - [IRR explorer](https://irrexplorer.nlnog.net/)

source: results further-testing mail label
nl: Aanvullende e-mailtesten

source: results further-testing web content
nl: - ### IPv6: - [IP6.nl](https://ip6.nl/) - [Screenshots.page](https://screenshots.page/) - [IP address visibility](https://stat.ripe.net/widget/visibility) - ### DNSSEC: - [DNSViz](http://dnsviz.net/) - [Zonemaster](https://zonemaster.net/) - ### HTTPS: - [Observatory by Mozilla](https://observatory.mozilla.org/) - [SSLlabs](https://www.ssllabs.com/ssltest/) - ### Security options: - [CSP Evaluator](https://csp-evaluator.withgoogle.com/) - [Analyze your CSP](https://report-uri.com/home/analyse/) - ### RPKI: - [Routinator](https://routinator.nlnetlabs.nl/) - [IRR explorer](https://irrexplorer.nlnog.net/)

source: results further-testing web label
nl: Aanvullende websitetesten

source: results mail auth dkim label
nl: DKIM

source: results mail auth dmarc label
nl: DMARC

source: results mail auth spf label
nl: SPF

source: results mail dnssec domain label
nl: E-mailadresdomein

source: results mail dnssec mail-servers label
nl: Mailserverdomein(en)

source: results mail ipv6 mail-servers label
nl: Mailserver(s)

source: results mail rpki mail-servers label
nl: Mailserver(s)

source: results mail rpki mx-name-servers label
nl: Nameservers van mailserver(s)

source: results mail tls starttls label
nl: TLS

source: results no-icon-detail close
nl: sluit

source: results no-icon-detail open
nl: open

source: results no-icon-status error
nl: Error

source: results no-icon-status failed
nl: Gezakt

source: results no-icon-status info
nl: Informatie

source: results no-icon-status not-tested
nl: Niet-testbaar

source: results no-icon-status passed
nl: Geslaagd

source: results no-icon-status warning
nl: Suggestie

source: results panel-button hide
nl: Verberg details

source: results panel-button show
nl: Toon details

source: results perfect-score
nl: Gefeliciteerd, je domeinnaam wordt spoedig in de **Hall of Fame** opgenomen!

source: results permalink
nl: Permalink testresultaat {{permadate|date:'(Y-m-d H:i T)'}}

source: results rerun-test
nl: Herhaal de test

source: results retest-time
nl: Seconden tot hertest-mogelijkheid:

source: results score-description
nl: Het domein {{prettyaddr}} heeft een testscore van {{score}}%.

source: results tech-details label
nl: Technische details:

source: results test direct
nl: Test direct:

source: results test email label
nl: Test andere e-mail

source: results test website label
nl: Test andere website

source: results test-info
nl: Toelichting op testrapport

source: results verdict label
nl: Uitslag:

source: test connipv6 failed description
nl: Helaas! Je internetprovider heeft je *geen* modern internetadres ([IPv6](/faqs/ipv6/)) gegeven, of *niet* alles correct ingesteld. Je kan daardoor andere computers met moderne adressen *niet* bereiken. Vraag je internetprovider om volledige IPv6-connectiviteit.

source: test connipv6 failed summary
nl: Moderne adressen *niet* bereikbaar (IPv6)

source: test connipv6 info description
nl: Helaas! Je internetprovider heeft je *geen* modern internetadres ([IPv6](/faqs/ipv6/)) gegeven, of *niet* alles correct ingesteld. Je kan daardoor andere computers met moderne adressen *niet* bereiken. Vraag je internetprovider om volledige IPv6-connectiviteit.

source: test connipv6 info summary
nl: Moderne adressen *niet* bereikbaar (IPv6)

source: test connipv6 label
nl: Moderne adressen bereikbaar (IPv6)

source: test connipv6 passed description
nl: Goed gedaan! Je internetprovider heeft je een modern internetadres ([IPv6](/faqs/ipv6/)) gegeven. Daardoor kan je andere computers met moderne adressen bereiken.

source: test connipv6 passed summary
nl: Moderne adressen bereikbaar (IPv6)

source: test connipv6 title
nl: Moderne adressen bereikbaar?

source: test connipv6 warning description
nl: Helaas! Je internetprovider heeft je *geen* modern internetadres ([IPv6](/faqs/ipv6/)) gegeven, of *niet* alles correct ingesteld. Je kan daardoor andere computers met moderne adressen *niet* bereiken. Vraag je internetprovider om volledige IPv6-connectiviteit.

source: test connipv6 warning summary
nl: Moderne adressen *niet* bereikbaar (IPv6)

source: test connresolver failed description
nl: Helaas! Domein-handtekeningen ([DNSSEC](/faqs/dnssec/)) worden voor jou nu *niet* gecontroleerd. Daardoor ben je *niet* beschermd tegen gemanipuleerde vertaling van ondertekende domeinnamen naar kwaadaardige IP-adressen. Vraag je internetprovider om DNSSEC-validatie en/of activeer het op je eigen systemen.

source: test connresolver failed summary
nl: Domein-handtekeningen *niet* gecontroleerd (DNSSEC)

source: test connresolver info description
nl: Helaas! Domein-handtekeningen ([DNSSEC](/faqs/dnssec/)) worden voor jou nu *niet* gecontroleerd. Daardoor ben je *niet* beschermd tegen gemanipuleerde vertaling van ondertekende domeinnamen naar kwaadaardige IP-adressen. Vraag je internetprovider om DNSSEC-validatie en/of activeer het op je eigen systemen.

source: test connresolver info summary
nl: Domein-handtekeningen *niet* gecontroleerd (DNSSEC)

source: test connresolver label
nl: Controle van domein-handtekeningen (DNSSEC)

source: test connresolver passed description
nl: Goed gedaan! Domein-handtekeningen ([DNSSEC](/faqs/dnssec/)) worden voor jou gecontroleerd. Daardoor ben je beschermd tegen vervalste vertaling van ondertekende domeinnamen naar kwaadaardige IP-adressen.

source: test connresolver passed summary
nl: Domein-handtekeningen gecontroleerd (DNSSEC)

source: test connresolver title
nl: Domein-handtekeningen gecontroleerd?

source: test connresolver warning description
nl: Helaas! Domein-handtekeningen ([DNSSEC](/faqs/dnssec/)) worden voor jou nu *niet* gecontroleerd. Daardoor ben je *niet* beschermd tegen gemanipuleerde vertaling van ondertekende domeinnamen naar kwaadaardige IP-adressen. Vraag je internetprovider om DNSSEC-validatie en/of activeer het op je eigen systemen.

source: test connresolver warning summary
nl: Domein-handtekeningen *niet* gecontroleerd (DNSSEC)

source: test error summary
nl: *Fout* tijdens uitvoering van test!

source: test mailauth failed description
nl: Helaas! Je domein bevat *niet* alle echtheidswaarmerken tegen e-mailvervalsing ([DMARC, DKIM en SPF](/faqs/mailauth/)). Ontvangers kunnen daardoor *niet* betrouwbaar phishing- of spammails die jouw domeinnaam in hun afzenderadres misbruiken, scheiden van jouw echte e-mails. Vraag je mailprovider om DMARC, DKIM en SPF te activeren.

source: test mailauth failed summary
nl: *Niet* alle echtheidswaarmerken tegen e-mailphishing (DMARC, DKIM en SPF)

source: test mailauth info description
nl: Helaas! Je domein bevat *niet* alle echtheidswaarmerken tegen e-mailvervalsing ([DMARC, DKIM en SPF](/faqs/mailauth/)). Ontvangers kunnen daardoor *niet* betrouwbaar phishing- of spammails die jouw domeinnaam in hun afzenderadres misbruiken, scheiden van jouw echte e-mails. Vraag je mailprovider om DMARC, DKIM en SPF te activeren.

source: test mailauth info summary
nl: *Niet* alle echtheidswaarmerken tegen e-mailphishing (DMARC, DKIM en SPF)

source: test mailauth label
nl: Echtheidswaarmerken tegen phishing (DMARC, DKIM en SPF)

source: test mailauth passed description
nl: Goed gedaan! Je domein bevat alle echtheidswaarmerken tegen e-mailvervalsing ([DMARC, DKIM en SPF](/faqs/mailauth/)). Ontvangers kunnen daardoor betrouwbaar phishing- of spammails die jouw domeinnaam in hun afzenderadres misbruiken, scheiden van jouw echte e-mails.

source: test mailauth passed summary
nl: Echtheidswaarmerken tegen e-mailphishing (DMARC, DKIM en SPF)

source: test mailauth title
nl: Echtheidswaarmerken tegen e-mailphishing?

source: test mailauth warning description
nl: Helaas! Je domein bevat *niet* alle echtheidswaarmerken tegen e-mailvervalsing ([DMARC, DKIM en SPF](/faqs/mailauth/)). Ontvangers kunnen daardoor *niet* betrouwbaar phishing- of spammails die jouw domeinnaam in hun afzenderadres misbruiken, scheiden van jouw echte e-mails. Vraag je mailprovider om DMARC, DKIM en SPF te activeren.

source: test mailauth warning summary
nl: *Niet* alle echtheidswaarmerken tegen e-mailphishing (DMARC, DKIM en SPF)

source: test maildnssec failed description
nl: Helaas! De domeinen van je e-mailadres en mailserver(s) zijn *niet* (allemaal) ondertekend met een geldige handtekening ([DNSSEC](/faqs/dnssec/)). Verzenders die domeinhandtekeningen controleren, kunnen nu niet betrouwbaar het IP-adres van je ontvangende e-mailserver(s) opvragen. Een aanvaller kan het IP-adres daardoor ongemerkt manipuleren en aan jou gestuurde e-mails omleiden naar een eigen mailserver. Vraag je nameserver-beheerder en/of je mailprovider om DNSSEC te activeren.

source: test maildnssec failed summary
nl: *Niet* alle domeinnamen ondertekend (DNSSEC)

source: test maildnssec info description
nl: Helaas! De domeinen van je e-mailadres en mailserver(s) zijn *niet* (allemaal) ondertekend met een geldige handtekening ([DNSSEC](/faqs/dnssec/)). Verzenders die domeinhandtekeningen controleren, kunnen nu niet betrouwbaar het IP-adres van je ontvangende e-mailserver(s) opvragen. Een aanvaller kan het IP-adres daardoor ongemerkt manipuleren en aan jou gestuurde e-mails omleiden naar een eigen mailserver. Vraag je nameserver-beheerder en/of je mailprovider om DNSSEC te activeren.

source: test maildnssec info summary
nl: *Niet* alle domeinnamen ondertekend (DNSSEC)

source: test maildnssec label
nl: Ondertekende domeinnamen (DNSSEC)

source: test maildnssec passed description
nl: Goed gedaan! Je e-mailadresdomein en je mailserverdomein(en) zijn ondertekend met een geldige handtekening ([DNSSEC](/faqs/dnssec/)). Verzenders die domeinhandtekeningen controleren, kunnen daardoor betrouwbaar het IP-adres van je ontvangende mailserver(s) opvragen.

source: test maildnssec passed summary
nl: Alle domeinnamen ondertekend (DNSSEC)

source: test maildnssec title
nl: Domeinnamen ondertekend?

source: test maildnssec warning description
nl: Helaas! De domeinen van je e-mailadres en mailserver(s) zijn *niet* (allemaal) ondertekend met een geldige handtekening ([DNSSEC](/faqs/dnssec/)). Verzenders die domeinhandtekeningen controleren, kunnen nu niet betrouwbaar het IP-adres van je ontvangende e-mailserver(s) opvragen. Een aanvaller kan het IP-adres daardoor ongemerkt manipuleren en aan jou gestuurde e-mails omleiden naar een eigen mailserver. Vraag je nameserver-beheerder en/of je mailprovider om DNSSEC te activeren.
