Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: detail web tls ciphers exp
nl: We testen of je webserver alleen veilige, d.w.z. 'Goede' en/of 'Voldoende', ciphers (ook algoritmeselecties genoemd) ondersteunt. Een algoritmeselectie bestaat uit ciphers voor vier cryptografische functies: 1) sleuteluitwisseling, 2) certificaatverificatie, 3) bulkversleuteling, en 4) hashing. Een webserver kan meer dan één algoritmeselectie ondersteunen. * Vanaf TLS 1.3 omvat de term 'cipher suite' alleen ciphers voor bulkversleuteling en hashing. Als TLS 1.3 gebruikt wordt dan zijn de ciphers voor sleuteluitwisseling en certificaatverificatie onderhandelbaar en niet langer onderdeel van de naam van de cipher suite. Omdat dit de term 'cipher suite' ambigu maakt, gebruikt NCSC de term 'algoritmeselectie' om alle vier de functies aan te duiden. * NCSC gebruikt de [IANA-naamgeving](https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml#tls-parameters-4) voor algoritmeselecties. Internet.nl hanteert de [OpenSSL-naamgeving](https://www.openssl.org/docs/manmaster/man1/openssl-ciphers.html#CIPHER-SUITE-NAMES). Vanaf TLS 1.3 volgt OpenSSL de IANA-naamgeving. Een vertaling tussen beide is onderdeel van de OpenSSL-documentation. * Merk op dat ciphers die PSK of SRP gebruiken voor sleuteluitwisseling (die onvoldoende veilig zijn) in deze test niet worden gedetecteerd vanwege een beperking die samenhangt met onze testwijze. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B2-1 t/m B2-4 en tabel 2, 4, 6 en 7. --- Hieronder staan 'Goede', 'Voldoende' en 'Uit te faseren' algoritmeselecties in de door NCSC voorgeschreven volgorde, gebaseerd op bijlage C van de 'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.0'. Achter iedere algoritmeselectie noemen we de minimale TLS-versie (bijv. [1.2]) die deze algoritmeselectie ondersteunt en die tenminste 'Uit te faseren' is. Goed: * `ECDHE-ECDSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-ECDSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-ECDSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-RSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] Voldoende: * `ECDHE-ECDSA-AES256-SHA384` [1.2] * `ECDHE-ECDSA-AES256-SHA` [1.0] * `ECDHE-ECDSA-AES128-SHA256` [1.2] * `ECDHE-ECDSA-AES128-SHA` [1.0] * `ECDHE-RSA-AES256-SHA384` [1.2] * `ECDHE-RSA-AES256-SHA` [1.0] * `ECDHE-RSA-AES128-SHA256` [1.2] * `ECDHE-RSA-AES128-SHA` [1.0] * `DHE-RSA-AES256-GCM-SHA384` [1.2] * `DHE-RSA-CHACHA20-POLY1305` [1.2] * `DHE-RSA-AES128-GCM-SHA256` [1.2] * `DHE-RSA-AES256-SHA256` [1.2] * `DHE-RSA-AES256-SHA` [1.0] * `DHE-RSA-AES128-SHA256` [1.2] * `DHE-RSA-AES128-SHA` [1.0] Uit te faseren: * `ECDHE-ECDSA-DES-CBC3-SHA` [1.0] * `ECDHE-RSA-DES-CBC3-SHA` [1.0] * `DHE-RSA-DES-CBC3-SHA` [1.0] * `AES256-GCM-SHA384` [1.2] * `AES128-GCM-SHA256` [1.2] * `AES256-SHA256` [1.2] * `AES256-SHA` [1.0] * `AES128-SHA256` [1.2] * `AES128-SHA` [1.0] * `DES-CBC3-SHA` [1.0]

source: detail web tls ciphers label
nl: Ciphers (Algoritmeselecties)

source: detail web tls ciphers tech table
nl: Webserver-IP-adres|Getroffen ciphers|Status

source: detail web tls ciphers verdict bad
nl: Je webserver ondersteunt een of meer *onvoldoende* veilige ciphers.

source: detail web tls ciphers verdict good
nl: Je webserver ondersteunt alleen veilige ciphers.

source: detail web tls ciphers verdict phase-out
nl: Je webserver ondersteunt een of meer ciphers die de status *uit te faseren* hebben omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst *onvoldoende* veilig te worden.

source: detail web tls compression exp
nl: We testen of je webserver TLS-compressie ondersteunt. Het gebruik van compressie kan een aanvaller informatie bieden over geheime delen van versleutelde communicatie. Een aanvaller die in staat is om een deel van de verzonden data te achterhalen of te beïnvloeden, kan door middel van een groot aantal verzoeken stukje bij beetje de oorspronkelijke data reconstrueren. TLS-compressie wordt zo weinig gebruikt dat het geen kwaad kan om deze optie uit te schakelen. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B7-1 en tabel 11. --- **Compressie-optie** * Goed: Geen compressie * Voldoende: Compressie op applicatieniveau (in dit geval HTTP-compressie) * Onvoldoende: TLS-compressie

source: detail web tls compression label
nl: TLS-compressie

source: detail web tls compression tech table
nl: Webserver-IP-adres|TLS-compressie

source: detail web tls compression verdict bad
nl: Je webserver ondersteunt TLS-compressie, wat *niet* veilig is.

source: detail web tls compression verdict good
nl: Je webserver ondersteunt geen TLS-compressie.

source: detail web tls dane-exists exp
nl: We testen of de nameserver van je websitedomein een correct ondertekend TLSA-record voor DANE bevat. Aangezien DNSSEC een noodzakelijke randvoorwaarde is voor DANE, zal een domeinnaam niet slagen voor de test als DNSSEC ontbreekt op het websitedomein, of als er DANE-gerelateerde DNSSEC-issues zijn (bijv. geen bewijs voor 'Denial of Existence'). Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, Appendix A, onder 'Certificate pinning en DANE'. *Niveau van vereistheid: Optioneel*

source: detail web tls dane-exists label
nl: DANE aanwezigheid

source: detail web tls dane-exists tech table
nl: Webserver-IP-adres|DANE TLSA-record aanwezig

source: detail web tls dane-exists verdict bad
nl: Je websitedomein bevat *geen* TLSA-record voor DANE.

source: detail web tls dane-exists verdict bogus
nl: Je websitedomein bevat *geen* DNSSEC-bewijs dat DANE TLSA-records niet bestaan. Vraag je nameserver-beheerder om deze fout op te lossen.

source: detail web tls dane-exists verdict good
nl: Je websitedomein bevat een TLSA-record voor DANE.

source: detail web tls dane-rollover exp
nl: OUTDATED TEXT; TEST NOT USED We check if your website domain has a proper DANE rollover scheme to handle DANE certificate rollovers. Having a DANE rollover scheme in place is not required. It will be proven useful when there is a need to update your DANE certificate and you want to ensure that DANE validation will continue to work during the transition period. The way to achieve this is by publishing two different TLSA records. The configurations of the TLSA record types are the following: - record type 3 1 1 (current key) + record type 3 1 1 (future key), or - record type 3 1 1 (current key) + record type 2 1 1 (trusted CA).

source: detail web tls dane-rollover label
nl: OUTDATED TEXT; TEST NOT USED DANE rollover scheme

source: detail web tls dane-rollover tech table
nl: OUTDATED TEXT; TEST NOT USED Web server IP address|DANE rollover scheme

source: detail web tls dane-rollover verdict bad
nl: OUTDATED TEXT; TEST NOT USED Your website domain does *not* have a proper scheme for rolling DANE certificates.

source: detail web tls dane-rollover verdict good
nl: OUTDATED TEXT; TEST NOT USED Your website domain has a proper scheme for rolling DANE certificates.

source: detail web tls dane-valid exp
nl: We testen of de DANE-fingerprint die je domein presenteert geldig is voor je websitecertificaat. Met DANE kan je informatie over jouw websitecertificaat publiceren in een speciaal DNS-record, een TLSA-record. Clients, zoals webbrowsers, kunnen het certificaat nu niet alleen via de certificaatautoriteit, maar ook via het TLSA-record controleren op authenticiteit. Een client kan het TLSA-record ook als signaal gebruiken om alleen via HTTPS (en niet via HTTP) te verbinden. DNSSEC is een noodzakelijke randvoorwaarde voor DANE. Helaas ondersteunen nog niet veel webbrowsers DANE-validatie. *Niveau van vereistheid: Aanbevolen (alleen als subtest voor 'DANE aanwezigheid' is geslaagd)*

source: detail web tls dane-valid label
nl: DANE geldigheid

source: detail web tls dane-valid tech table
nl: Webserver-IP-adres|DANE TLSA-record geldig

source: detail web tls dane-valid verdict bad
nl: De DANE-fingerprint op je domeinnaam is *niet* geldig voor je websitecertificaat. Óf iemand manipuleerde het antwoord van jouw nameserver, óf je domeinnaam heeft een serieuze DANE-configuratiefout. Dit laatste maakt je domeinnaam onbereikbaar voor alle gebruikers die DANE-fingerprints controleren. Neem zo spoedig mogelijk contact op met je nameserver-beheerder en/of hostingprovider.

source: detail web tls dane-valid verdict good
nl: De DANE-fingerprint op je domeinnaam is geldig voor je websitecertificaat.

source: detail web tls fs-params exp
nl: We testen of de publieke parameters, die in de Diffie-Hellman sleuteluitwisseling worden gebruikt door je webserver, veilig zijn. **ECDHE**: De veiligheid van de ECDHE-sleuteluitwisseling is afhankelijk van de geselecteerde elliptische kromme. We testen of de bitlengte van de gebruikte kromme tenminste 224 bits is. Op dit moment kunnen we niet de naam van de elliptische kromme testen. **DHE**: De veiligheid van de Diffie-Hellman Ephemeral (DHE) sleuteluitwisseling is afhankelijk van de lengte van de publieke en geheime sleutels die in de geselecteerde finite field-groep wordt gebruikt. We testen of je publieke DHE-sleutelmateriaal gebruikmaakt van een van de gepredefinieerde finite field-groepen die zijn gespecificeerd in [RFC 7919](https://tools.ietf.org/html/rfc7919). Zelf-gegenereerde groepen zijn 'Onvoldoende'. De grotere sleutellengtes die noodzakelijk zijn voor het gebruik van DHE gaan ten koste van de prestaties. Maak een zorgvuldige afweging en gebruik waar mogelijk ECDHE in plaats van DHE. **RSA als alternatief**: Naast ECDHE en DHE, kan RSA gebruikt worden voor sleuteluitwisseling. RSA loopt het risico om onvoldoende veilig te worden (huidige status 'Uit te faseren'). De publieke RSA-parameters worden getest in de subtest 'Handtekening-parameters van certificaat'. Overigens heeft RSA voor certificaatverificatie wel de status 'Goed'. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, richtlijn B5-1 en tabel 9 voor ECDHE, en richtlijn B6-1 en tabel 10 voor DHE. --- **Elliptische krommen voor ECDHE** * Goed: `secp384r1`, `secp256r1`, `x448`, en `x25519` * Uit te faseren: `secp224r1` * Onvoldoende: Andere krommen **Finite field-groepen voor DHE** * Voldoende: * [ffdhe4096](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe4096.pem) (RFC 7919) sha256 checksum: `64852d6890ff9e62eecd1ee89c72af9af244dfef5b853bcedea3dfd7aade22b3` * [ffdhe3072](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe3072.pem) (RFC 7919) sha256 checksum: `c410cc9c4fd85d2c109f7ebe5930ca5304a52927c0ebcb1a11c5cf6b2386bbab` * Merk op dat we ook testen op ffdhe8192 and ffdhe6144 die beide voldoende zijn. Echter, hun beperkte beveiligingswinst weegt zelden op tegen het prestatie-verlies. * Uit te faseren: * [ffdhe2048](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe2048.pem) (RFC 7919) sha256 checksum: `9ba6429597aeed2d8617a7705b56e96d044f64b07971659382e426675105654b` * Onvoldoende: Andere groepen --- Let op: de bovenstaande namen zijn gebaseerd op de [IANA naamgevingsconventies](https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml). Soms worden alternatieve namen gebruikt om te verwijzen naar dezelfde krommen, zoals `prime256v1` (ANSI) en `NIST P-256` voor `secp256r1`.

source: detail web tls fs-params label
nl: Sleuteluitwisselingsparameters

source: detail web tls fs-params tech table
nl: Webserver-IP-adres|Getroffen parameters|Status

source: detail web tls fs-params verdict bad
nl: Je webserver ondersteunt *onvoldoende* veilige parameters voor Diffie-Hellman-sleuteluitwisseling.

source: detail web tls fs-params verdict good
nl: Je webserver ondersteunt veilige parameters voor Diffie-Hellman-sleuteluitwisseling.

source: detail web tls fs-params verdict na
nl: Deze subtest is niet van toepassing, omdat je webserver *niet* Diffie-Hellman-sleuteluitwisseling ondersteunt. Let op: RSA is een alternatief voor sleuteluitwisseling, maar heeft de status *uit te faseren*.

source: detail web tls fs-params verdict phase-out
nl: Je webserver ondersteunt parameters voor Diffie-Hellman-sleuteluitwisseling die de status *uit te faseren* hebben, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst *onvoldoende* veilig te worden.

source: detail web tls http-compression exp
nl: We testen of je webserver HTTP-compressie ondersteunt. Bij het HTTP-protocol wordt compressie vaak gebruikt om de beschikbare bandbreedte efficiënter te gebruiken. HTTP-compressie maakt de beveiligde verbinding met je webserver echter kwetsbaar voor de BREACH-aanval. Weeg de voors en tegens van HTTP-compressie zorgvuldig tegen elkaar af. Wanneer u kiest voor het gebruik van HTTP-compressie, ga dan na of het mogelijk is om hieruit voortvloeiende potentiële applicatie-aanvallen te beperken. Een voorbeeld van een dergelijke maatregel is het beperken van de mate waarin een aanvaller de respons van de server kan beïnvloeden. Dit testonderdeel controleert of de webserver op rootdirectory-niveau HTTP-compressie ondersteunt, maar controleert geen andere websitebronnen zoals plaatje en scripts. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) van NCSC, richtlijn B7-1 en tabel 11. *Niveau van vereistheid: Optioneel* --- **Compressie-optie** * Goed: Geen compressie * Voldoende: Compressie op applicatieniveau (in dit geval HTTP-compressie) * Onvoldoende: TLS-compressie

source: detail web tls http-compression label
nl: HTTP-compressie

source: detail web tls http-compression tech table
nl: Webserver-IP-adres|HTTP-compressie

source: detail web tls http-compression verdict bad
nl: Je webserver ondersteunt HTTP-compressie, wat een beveiligingsrisico kan vormen.

source: detail web tls http-compression verdict good
nl: Je webserver ondersteunt geen HTTP-compressie.

source: detail web tls https-exists exp
nl: We testen of je website bereikbaar is via HTTPS. Als dat het geval is, dan testen we in de navolgende subtesten of HTTPS ook veilig is geconfigureerd conform de ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/onderwerpen/verbindingsbeveiliging/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1). HTTPS garandeert de vertrouwelijkheid en integriteit van uitgewisselde informatie. Omdat het van de situatie afhangt hoe (privacy-)gevoelig en waardevol informatie is, een bezoeker van je website bepaalt hoe (privacy-) gevoelig en waardevol informatie is, is een veilige HTTPS-configuratie voor iedere website van belang. Ook triviale, publieke informatie kan door omstandigheden voor de gebruiker zeer gevoelig en waardevol zijn. Let op: vanwege performance-redenen wordt de HTTPS-deeltest alleen uitgevoerd voor het eerst beschikbare IPv6- en IPv4-adres.

source: detail web tls https-exists label
nl: HTTPS beschikbaar

source: detail web tls https-exists tech table
nl: Webserver-IP-adres|HTTPS aanwezig

source: detail web tls https-exists verdict bad
nl: Je website biedt *geen* HTTPS aan.

source: detail web tls https-exists verdict good
nl: Je website biedt HTTPS aan.

source: detail web tls https-exists verdict other
nl: Je webserver is niet bereikbaar.

source: detail web tls https-forced exp
nl: We testen of je webserver bezoekers automatisch doorverwijst van HTTP naar HTTPS op dezelfde domeinnaam (via een 3xx redirect status code zoals 301 en 302), óf dat deze ondersteuning biedt voor alleen HTTPS en niet voor HTTP. In geval van doorverwijzing moet de domeinnaam eerst zelf 'upgraden' door een redirect naar zijn HTTPS-versie, voordat deze eventueel doorverwijst naar een andere domeinnaam. Dit zorgt er ook voor dat een webbrowser de HSTS-policy kan accepteren. Voorbeelden van correcte redirect-volgorde: * `http://example.nl` ⇒ `https://example.nl` ⇒ `https://www.example.nl` * `http://www.example.nl` ⇒ `https://www.example.nl` Merk op dat deze subtest alleen test of de opgegeven domeinnaam goed doorverwijst van HTTP naar HTTPS. Een eventuele verdere doorverwijzing naar een andere domeinnaam (inclusief een subdomeinnaam van het geteste domeinnaam) wordt niet getest. Je kan een afzonderlijke test starten om een dergelijke domeinnaam waarnaar wordt doorverwezen zelf te testen. Zie ['Webapplicatie-richtlijnen, Verdieping'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) van NCSC, richtlijn U/WA.05.

source: detail web tls https-forced label
nl: HTTPS-doorverwijzing

source: detail web tls https-forced tech table
nl: Webserver-IP-adres|HTTPS-doorverwijzing

source: detail web tls https-forced verdict bad
nl: Je webserver ondersteunt zowel HTTP als HTTPS, maar verwijst bezoekers *niet* automatisch door van HTTP naar HTTPS op dezelfde domeinnaam.

source: detail web tls https-forced verdict good
nl: Je webserver verwijst bezoekers automatisch door van HTTP naar HTTPS op dezelfde domeinnaam.

source: detail web tls https-forced verdict other
nl: Je webserver biedt alleen ondersteuning voor HTTPS en niet voor HTTP.

source: detail web tls https-hsts exp
nl: We testen of je webserver HSTS ondersteunt. Browsers onthouden HSTS per (sub-)domein. Het niet toevoegen van HSTS voor ieder (sub-)domein (in een redirect-keten) kan gebruikers kwetsbaar maken voor MITM-aanvallen. Om die reden testen we HSTS bij het eerste contact, d.w.z. voordat een eventuele doorverwijzing plaatsvindt. HSTS dwingt af dat een webbrowser direct via HTTPS verbindt bij terugkerend bezoek. Dit helpt man-in-the-middle-aanvallen te voorkomen. Een cache-geldigheidsduur voor HSTS van *tenminste* 1 jaar (`max-age=31536000`) achten we voldoende veilig. Een lange geldigheidsduur heeft als voordeel dat ook infrequente bezoekers beschermd zijn. Het nadeel is dat wanneer je wil stoppen met HTTPS (wat over het algemeen een slecht idee is), je langer moet wachten totdat de geldigheid van de HSTS-policy in alle browsers die je website bezochten, is verlopen. --- **Aanbevelingen voor implementatie** HSTS vereist dat je website volledig over HTTPS werkt. Dit houdt ook in dat je website een geldig certificaat moet hebben van een publiekelijk vertrouwde certificaatautoriteit. Dus wanneer je website geen goede ondersteuning voor HTTPS biedt, dan zal deze *niet bereikbaar* zijn voor browsers die je website eerder hebben benaderd. Een wijziging van je HSTS-policy om de effecten terug te draaien, zal voor deze browsers niet onmiddellijk effect hebben, aangezien zij je vorige HSTS-policy in de cache hebben opgeslagen. Daarom adviseren wij u om de onderstaande implementatiestappen te volgen: 1. Zorg ervoor dat de website op je domein nu en in de toekomst volledig over HTTPS werkt (o.a. door een gedegen certificaat rollover procedure te hebben); 2. Verhoog de geldigheidsduur van de HSTS-cache in de onderstaande fasen. Controleer tijdens elke fase zorgvuldig op bereikbaarheidsproblemen en niet goed werkende pagina's. Los eventuele problemen op en wacht dan de volledige cacheduur van de fase af voordat je naar de volgende fase gaat. - Begin met 5 minuten (`max-age=300`); - Verhoog dit naar 1 week (`max-age=604800`); - Verhoog dit naar 1 maand (`max-age=2592000`); - Verhoog het naar 1 jaar (`max-age=31536000`) of meer. 3. Herhaal stap 1 en 2 voor elk subdomein dat je met HSTS wilt beveiligen. Gebruik `includeSubDomains` alleen als je er volledig zeker van bent dat **alle** (geneste) subdomeinen van je domein HTTPS goed ondersteunen, nu en in de toekomst. 4. Gebruik `preload` **niet** tenzij je heel, heel zeker weet dat je je domein wil laten opnemen in de [HSTS Preload Lijst](https://hstspreload.org/). We adviseren om dit alleen te overwegen als je een high-profile website runt en als je precies weet wat je doet. --- Zie ['Webapplicatie-richtlijnen, Verdieping'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) van NCSC, richtlijn U/WA.05.

source: detail web tls https-hsts label
nl: HSTS

source: detail web tls https-hsts tech table
nl: Webserver-IP-adres|HSTS-policy

source: detail web tls https-hsts verdict bad
nl: Je webserver biedt *geen* HSTS-policy aan.

source: detail web tls https-hsts verdict good
nl: Je webserver biedt een HSTS-policy aan.

source: detail web tls https-hsts verdict other
nl: Je webserver biedt een HSTS-policy aan met een geldigheidsduur voor caching (`max-age`) die *niet* voldoende lang (d.w.z. korter dan 1 jaar) is.

source: detail web tls kex-hash-func exp
nl: We testen of je webserver ondersteuning biedt voor veilige hashfuncties om tijdens sleuteluitwisseling de digitale handtekening te maken. De webserver maakt tijdens de sleuteluitwisseling gebruik van een digitale handtekening om het eigenaarschap te bewijzen van de geheime sleutel die bij het certificaat hoort. De webserver creëert deze digitale handtekening door het ondertekenen van de output van een hashfunctie. Zie ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC, tabel 5. *Niveau van vereistheid: Aanbevolen* --- **SHA2-ondersteuning voor handtekeningen** * Goed: Ja (ondersteuning van SHA-256, SHA-384 of SHA-512) * Uit te faseren: Nee (*geen* ondersteuning van SHA-256, SHA-384 of SHA-512)

source: detail web tls kex-hash-func label
nl: Hashfunctie voor sleuteluitwisseling

source: detail web tls kex-hash-func tech table
nl: Webserver-IP-adress|SHA-2-ondersteuning voor handtekeningen

source: detail web tls kex-hash-func verdict good
nl: Je webserver ondersteunt een veilige hashfunctie voor sleuteluitwisseling.

source: detail web tls kex-hash-func verdict other
nl: Het was niet mogelijk om vast te stellen welke hashfunctie je webserver gebruikt. Dit kan veroorzaakt worden doordat de gebruikte cipher-combinatie geen handtekening voor certificaatverificatie heeft (bijv. deze gebruikt RSA-sleuteluitwisseling of is anoniem d.w.z. `anon`).

source: detail web tls kex-hash-func verdict phase-out
nl: Je webserver ondersteunt *geen* veilige hashfunctie voor sleuteluitwisseling. Deze instelling dien je weloverwogen *uit te faseren*, omdat deze het risico loopt in de toekomst *onvoldoende* veilig te worden.
