Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: test maildnssec warning summary
nl: *Niet* alle domeinnamen ondertekend (DNSSEC)

source: test mailipv6 failed description
nl: Helaas! Je mailserver is *niet* bereikbaar voor verzenders met moderne adressen ([IPv6](/faqs/ipv6/)), of er is verbetering mogelijk. Daardoor maakt je mailserver nog geen onderdeel uit van het moderne internet. Vraag je e-mailprovider om IPv6 volledig aan te zetten.

source: test mailipv6 failed summary
nl: *Niet* bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)

source: test mailipv6 info description
nl: Helaas! Je mailserver is *niet* bereikbaar voor verzenders met moderne adressen ([IPv6](/faqs/ipv6/)), of er is verbetering mogelijk. Daardoor maakt je mailserver nog geen onderdeel uit van het moderne internet. Vraag je e-mailprovider om IPv6 volledig aan te zetten.

source: test mailipv6 info summary
nl: *Niet* bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)

source: test mailipv6 label
nl: Modern adres (IPv6)

source: test mailipv6 passed description
nl: Goed gedaan! Je mailserver is bereikbaar voor verzenders met moderne adressen ([IPv6](/faqs/ipv6/)). Daardoor is je mailserver volledig onderdeel van het moderne Internet.

source: test mailipv6 passed summary
nl: Bereikbaar via modern internetadres (IPv6)

source: test mailipv6 title
nl: Bereikbaar via modern internetadres?

source: test mailipv6 warning description
nl: Helaas! Je mailserver is *niet* bereikbaar voor verzenders met moderne adressen ([IPv6](/faqs/ipv6/)), of er is verbetering mogelijk. Daardoor maakt je mailserver nog geen onderdeel uit van het moderne internet. Vraag je e-mailprovider om IPv6 volledig aan te zetten.

source: test mailipv6 warning summary
nl: *Niet* bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)

source: test mailrpki failed description
nl: Helaas! Ten minste één van de IP-adressen van je ontvangende mailserver(s) en bijbehorende nameservers heeft een route-aankondiging die *niet* wordt gematcht door de gepubliceerde route-autorisatie ([RPKI](/faqs/rpki/)). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je mailhoster of je nameserver-hoster (interne fout) óf door een derde partij (externe fout). In beide gevallen kan het leiden tot de onbereikbaarheid van je server of het onderscheppen van internetverkeer naar je server. Neem zo spoedig mogelijk contact op met je mailhoster of nameserver-hoster. Bij een interne fout moeten zij hun netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.

source: test mailrpki failed summary
nl: *Ongeautoriseerde* route-aankondiging (RPKI)

source: test mailrpki info description
nl: Ter informatie: Je domein bevat *geen* nameservers en dus ook geen ontvangende mailserver(s). Er zijn geen routeerbare IP-adressen die kunnen worden getest ([RPKI](/faqs/rpki/)).

source: test mailrpki info summary
nl: *Geen* routeerbare IP-adressen gevonden (RPKI)

source: test mailrpki label
nl: Route-autorisatie (RPKI)

source: test mailrpki passed description
nl: Goed gedaan! Alle IP-adressen van je ontvangende mailserver(s) en bijbehorende nameservers hebben een route-aankondiging die wordt gematcht door de gepubliceerde route-autorisatie ([RPKI](/faqs/rpki/)). Daardoor is het e-mailtransport tussen verzendende mailservers met ingeschakelde route-validatie en jouw ontvangende mailserver(s) beter beschermd tegen diverse onbedoelde of kwaadwillige route-configuratiefouten, die kunnen leiden tot de onbereikbaarheid van je servers of de onderschepping van internetverkeer naar je servers.

source: test mailrpki passed summary
nl: Geautoriseerde route-aankondiging (RPKI)

source: test mailrpki title
nl: Route-autorisatie?

source: test mailrpki warning description
nl: Waarschuwing! Ten minste één van de IP-adressen van je mailserver en bijbehorende nameservers heeft een route-aankondiging waarvoor *geen* route-autorisatie is gepubliceerd ([RPKI](/faqs/rpki/)). Daardoor is het e-mailtransport tussen verzendende mailservers met ingeschakelde route-validatie en jouw ontvangende mailserver(s) *niet* (volledig) beschermd tegen diverse onbedoelde of kwaadwillige route-configuratiefouten, die kunnen leiden tot de onbereikbaarheid van je servers of de onderschepping van internetverkeer naar je servers. Neem hierover contact op met je mailhoster of nameserver-hoster. Zij kunnen hun netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren.

source: test mailrpki warning summary
nl: Route-autorisatie *niet* gepubliceerd (RPKI)

source: test mailtls failed description
nl: Helaas! Verzendende mailservers die beveiligd e-mailtransport ([STARTTLS en DANE](/faqs/starttls/)) ondersteunen, kunnen met jouw ontvangende mailserver(s) *geen* of een *onvoldoende* beveiligde verbinding opzetten. Passieve en/of actieve aanvallers kunnen daardoor e-mails onderweg naar jou lezen. Vraag je mailprovider om STARTTLS en DANE te activeren, en veilig in te stellen.

source: test mailtls failed summary
nl: Mailserver-verbinding *niet* of onvoldoende beveiligd (STARTTLS en DANE)

source: test mailtls info description
nl: Helaas! Verzendende mailservers die beveiligd e-mailtransport ([STARTTLS en DANE](/faqs/starttls/)) ondersteunen, kunnen met jouw ontvangende mailserver(s) *geen* of een *onvoldoende* beveiligde verbinding opzetten. Passieve en/of actieve aanvallers kunnen daardoor e-mails onderweg naar jou lezen. Vraag je mailprovider om STARTTLS en DANE te activeren, en veilig in te stellen.

source: test mailtls info summary
nl: Mailserver-verbinding *niet* of onvoldoende beveiligd (STARTTLS en DANE)

source: test mailtls invalid-null-mx description
nl: Waarschuwing: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, óf je domeinnaam heeft geen A/AAAA records, waardoor het "Null MX" record onnodig is. Óf op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de "Null MX" tegenstrijdig is.

source: test mailtls invalid-null-mx summary
nl: Tegenstrijdig geconfigureerd niet-ontvangend maildomein (STARTTLS en DANE)

source: test mailtls label
nl: Beveiligde mailserver-verbinding (STARTTLS en DANE)

source: test mailtls no-mx description
nl: Ter informatie: Er zijn geen ontvangende mailservers (MX) ingesteld op je domeinnaam die geen A/AAAA records heeft. Dat is prima als je geen e-mail wilt ontvangen. Merk op dat je in dit geval *geen* 'Null MX' record nodig hebt. Door je configuratie zijn de subtesten in de categorieën voor STARTTLS en DANE niet van toepassing. Dit geldt ook voor de mailserver-specifieke subtesten in de categorieën voor IPv6 en DNSSEC.

source: test mailtls no-mx summary
nl: Goed geconfigureerd niet-ontvangend mail domein (STARTTLS en DANE)

source: test mailtls no-null-mx description
nl: Ter informatie: Er zijn geen ontvangende mailservers (MX) ingesteld op je domeinnaam die A/AAAA records heeft. Wij raden je aan om expliciet aan te geven dat je domeinnaam geen e-mail accepteert door een "Null MX" record te configureren. Door je huidige configuratie zijn de subtesten in de categorieën voor STARTTLS en DANE niet van toepassing. Dit geldt ook voor de mailserver-specifieke subtesten in de categorieën voor IPv6 en DNSSEC.

source: test mailtls no-null-mx summary
nl: Niet expliciet geconfigureerd niet-ontvangend mail domein (STARTTLS en DANE)

source: test mailtls null-mx description
nl: Ter informatie: Je domeinnaam die A/AAAA-records heeft, geeft duidelijk aan dat het geen e-mail accepteert door een "Null MX" record te adverteren. Dat is prima als je geen e-mail wilt ontvangen. Je configuratie maakt de subtesten in de categorieën voor STARTTLS en DANE niet van toepassing. Dit geldt ook voor de mailserver-specifieke subtesten in de categorieën voor IPv6 en DNSSEC.

source: test mailtls null-mx summary
nl: Goed geconfigureerd niet-ontvangend mail domein (STARTTLS en DANE)

source: test mailtls null-mx-with-other-mx description
nl: Waarschuwing: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de "Null MX" tegenstrijdig is.

source: test mailtls null-mx-with-other-mx summary
nl: Tegenstrijdig geconfigureerd niet-ontvangend maildomein (STARTTLS en DANE)

source: test mailtls null-mx-without-a-aaaa description
nl: Waarschuwing: Je domeinnaam adverteert een "Null MX" record dat aangeeft dat deze geen e-mail accepteert. Echter, je domeinnaam heeft geen A/AAAA records, waardoor het "Null MX" record onnodig is.

source: test mailtls null-mx-without-a-aaaa summary
nl: Goed geconfigureerd niet-ontvangend mail domein, maar met overbodig record (STARTTLS en DANE)

source: test mailtls passed description
nl: Goed gedaan! Verzendende mailservers die beveiligd e-mailtransport ([STARTTLS en DANE](/faqs/starttls/)) ondersteunen, kunnen met jouw ontvangende mailserver(s) een beveiligde verbinding opzetten. STARTTLS voorkomt dat passieve aanvallers e-mails onderweg naar jou kunnen lezen. DANE beschermt tegen actieve aanvallers, die door manipulatie van het mailverkeer de STARTTLS-encryptie kunnen verwijderen.

source: test mailtls passed summary
nl: Mailserver-verbinding voldoende beveiligd (STARTTLS en DANE)

source: test mailtls title
nl: Beveiligde mailserver-verbinding?

source: test mailtls unreachable description
nl: Testfout: tenminste één van jouw ontvangende mailservers was niet bereikbaar voor ons. Daardoor was het onmogelijk om de test voor STARTTLS en DANE (volledig) uit te voeren. Dit kan worden veroorzaakt door netwerkconnectiviteitsproblemen of door het niet accepteren van connecties door jouw mailserver(s).

source: test mailtls unreachable summary
nl: Onbereikbare ontvangende mailserver (STARTTLS en DANE)

source: test mailtls untestable description
nl: Testfout: tenminste één van jouw ontvangende mailservers was niet testbaar voor ons. Daardoor was het niet mogelijk om de test voor STARTTLS en DANE (volledig) uit te voeren. Dit kan worden veroorzaakt door onder meer SMTP errors en geactiveerde ratelimiting-maatregelen die verbindingen tegenhouden.

source: test mailtls untestable summary
nl: Niet-testbare mailserver (STARTTLS en DANE)

source: test mailtls warning description
nl: Helaas! Verzendende mailservers die beveiligd e-mailtransport ([STARTTLS en DANE](/faqs/starttls/)) ondersteunen, kunnen met jouw ontvangende mailserver(s) *geen* of een *onvoldoende* beveiligde verbinding opzetten. Passieve en/of actieve aanvallers kunnen daardoor e-mails onderweg naar jou lezen. Vraag je mailprovider om STARTTLS en DANE te activeren, en veilig in te stellen.

source: test mailtls warning summary
nl: Mailserver-verbinding *niet* of onvoldoende beveiligd (STARTTLS en DANE)

source: test siteappsecpriv failed description
nl: Helaas! *Niet* alle vereiste beveiligingsopties, dat wil zeggen security headers en security.txt, zijn ingesteld voor je website ([Beveiligingsopties](/faqs/appsecpriv/)). Met security headers kan je browsermechanismen activeren om bezoekers te beschermen tegen aanvallen met bijvoorbeeld cross-site scripting (XSS) of framing. Via een security.txt-bestand kan je onderzoekers die een kwetsbaarheid op je systemen hebben gevonden, voorzien van je contactgegevens en je Coordinated Vulnerability Disclosure policy. Merk op dat HTTPS een voorwaarde is voor alle geteste beveiligingsopties. Verder is het zo dat security headers (behalve Referrer-Policy) niet relevant zijn voor domeinen die redirecten (via een 301/302 HTTP Status Code).

source: test siteappsecpriv failed summary
nl: Een of meer vereiste beveiligingsopties *niet* ingesteld (Beveiligingsopties)

source: test siteappsecpriv info description
nl: Ter informatie: *Niet* alle optionele beveiligingsopties, dat wil zeggen security headers en security.txt, zijn ingesteld voor je website ([Beveiligingsopties](/faqs/appsecpriv/)). Met security headers kan je browsermechanismen activeren om bezoekers te beschermen tegen aanvallen met bijvoorbeeld cross-site scripting (XSS) of framing. Via een security.txt-bestand kan je onderzoekers die een kwetsbaarheid op je systemen hebben gevonden, voorzien van je contactgegevens en je Coordinated Vulnerability Disclosure policy. Merk op dat HTTPS een voorwaarde is voor alle geteste beveiligingsopties. Verder is het zo dat security headers (behalve Referrer-Policy) niet relevant zijn voor domeinen die redirecten (via een 301/302 HTTP Status Code).

source: test siteappsecpriv info summary
nl: Een of meer optionele beveiligingsopties *niet* ingesteld (Beveiligingsopties)

source: test siteappsecpriv label
nl: Beveiligingsopties

source: test siteappsecpriv passed description
nl: Goed gedaan! Alle beveiligingsopties, dat wil zeggen security headers en security.txt, zijn ingesteld voor je website ([Beveiligingsopties](/faqs/appsecpriv/)). Met security headers kan je browsermechanismen activeren om bezoekers te beschermen tegen aanvallen met bijvoorbeeld cross-site scripting (XSS) of framing. Via een security.txt-bestand kan je onderzoekers die een kwetsbaarheid op je systemen hebben gevonden, voorzien van je contactgegevens en je Coordinated Vulnerability Disclosure policy. Merk op dat HTTPS een voorwaarde is voor alle geteste beveiligingsopties. Verder is het zo dat security headers (behalve Referrer-Policy) niet relevant zijn voor domeinen die redirecten (via een 301/302 HTTP Status Code).

source: test siteappsecpriv passed summary
nl: Alle beveiligingsopties ingesteld (Beveiligingsopties)

source: test siteappsecpriv title
nl: Beveiligingsopties ingesteld?

source: test siteappsecpriv warning description
nl: Waarschuwing: *Niet* alle aanbevolen beveiligingsopties, dat wil zeggen security headers en security.txt, zijn ingesteld voor je website ([Beveiligingsopties](/faqs/appsecpriv/)). Met security headers kan je browsermechanismen activeren om bezoekers te beschermen tegen aanvallen met bijvoorbeeld cross-site scripting (XSS) of framing. Via een security.txt-bestand kan je onderzoekers die een kwetsbaarheid op je systemen hebben gevonden, voorzien van je contactgegevens en je Coordinated Vulnerability Disclosure policy. Merk op dat HTTPS een voorwaarde is voor alle geteste beveiligingsopties. Verder is het zo dat security headers (behalve Referrer-Policy) niet relevant zijn voor domeinen die redirecten (via een 301/302 HTTP Status Code).

source: test siteappsecpriv warning summary
nl: Een of meer aanbevolen beveiligingsopties *niet* ingesteld (Beveiligingsopties)

source: test sitednssec failed description
nl: Helaas! Je domeinnaam is *niet* ondertekend met een geldige handtekening ([DNSSEC](/faqs/dnssec/)). Daardoor zijn bezoekers die controle van domein-handtekeningen geactiveerd hebben, *niet* beschermd tegen gemanipuleerde vertaling van jouw domeinnaam naar kwaadaardige internetadressen. Vraag je nameserver-beheerder (vaak je registrar en/of hostingprovider) om DNSSEC te activeren.

source: test sitednssec failed summary
nl: Domeinnaam *niet* ondertekend (DNSSEC)

source: test sitednssec info description
nl: Helaas! Je domeinnaam is *niet* ondertekend met een geldige handtekening ([DNSSEC](/faqs/dnssec/)). Daardoor zijn bezoekers die controle van domein-handtekeningen geactiveerd hebben, *niet* beschermd tegen gemanipuleerde vertaling van jouw domeinnaam naar kwaadaardige internetadressen. Vraag je nameserver-beheerder (vaak je registrar en/of hostingprovider) om DNSSEC te activeren.

source: test sitednssec info summary
nl: Domeinnaam *niet* ondertekend (DNSSEC)

source: test sitednssec label
nl: Ondertekende domeinnaam (DNSSEC)

source: test sitednssec passed description
nl: Goed gedaan! Je domeinnaam is ondertekend met een geldige handtekening ([DNSSEC](/faqs/dnssec/)). Daardoor zijn bezoekers die controle van domein-handtekeningen geactiveerd hebben, beschermd tegen gemanipuleerde vertaling van jouw domeinnaam naar kwaadaardige internetadressen.

source: test sitednssec passed summary
nl: Domeinnaam ondertekend (DNSSEC)

source: test sitednssec title
nl: Domeinnaam ondertekend?

source: test sitednssec warning description
nl: Helaas! Je domeinnaam is *niet* ondertekend met een geldige handtekening ([DNSSEC](/faqs/dnssec/)). Daardoor zijn bezoekers die controle van domein-handtekeningen geactiveerd hebben, *niet* beschermd tegen gemanipuleerde vertaling van jouw domeinnaam naar kwaadaardige internetadressen. Vraag je nameserver-beheerder (vaak je registrar en/of hostingprovider) om DNSSEC te activeren.

source: test sitednssec warning summary
nl: Domeinnaam *niet* ondertekend (DNSSEC)

source: test siteipv6 failed description
nl: Helaas! Je website is *niet* bereikbaar voor bezoekers die een modern internetadres ([IPv6](/faqs/ipv6/)) gebruiken, of er is verbetering mogelijk. Daardoor maakt je website nog geen onderdeel uit van het moderne internet. Vraag je hostingprovider om IPv6 volledig aan te zetten.

source: test siteipv6 failed summary
nl: *Niet* bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)

source: test siteipv6 info description
nl: Helaas! Je website is *niet* bereikbaar voor bezoekers die een modern internetadres ([IPv6](/faqs/ipv6/)) gebruiken, of er is verbetering mogelijk. Daardoor maakt je website nog geen onderdeel uit van het moderne internet. Vraag je hostingprovider om IPv6 volledig aan te zetten.

source: test siteipv6 info summary
nl: *Niet* bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)

source: test siteipv6 label
nl: Modern adres (IPv6)

source: test siteipv6 passed description
nl: Goed gedaan! Je website is bereikbaar voor bezoekers die een moderne internetadres ([IPv6](/faqs/ipv6/)) gebruiken, en daardoor volledig onderdeel van het moderne internet.

source: test siteipv6 passed summary
nl: Bereikbaar via moderne internetadres (IPv6)

source: test siteipv6 title
nl: Bereikbaar via modern adres?

source: test siteipv6 warning description
nl: Helaas! Je website is *niet* bereikbaar voor bezoekers die een modern internetadres ([IPv6](/faqs/ipv6/)) gebruiken, of er is verbetering mogelijk. Daardoor maakt je website nog geen onderdeel uit van het moderne internet. Vraag je hostingprovider om IPv6 volledig aan te zetten.

source: test siteipv6 warning summary
nl: *Niet* bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)

source: test siterpki failed description
nl: Helaas! Ten minste één van de IP-adressen van je ontvangende webserver en bijbehorende nameservers heeft een route-aankondiging die *niet* wordt gematcht door de gepubliceerde route-autorisatie ([RPKI](/faqs/rpki/)). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je webhoster of je nameserver-hoster (interne fout) óf door een derde partij (externe fout). In beide gevallen kan het leiden tot de onbereikbaarheid van je server of het onderscheppen van internetverkeer naar je server. Neem zo spoedig mogelijk contact op met je webhoster of nameserver-hoster. Bij een interne fout moeten zij hun netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.

source: test siterpki failed summary
nl: *Ongeautoriseerde* route-aankondiging (RPKI)

source: test siterpki info description
nl: Ter informatie: Je domein bevat *geen* nameservers en dus ook geen IP-adressen van webservers. Er zijn geen routeerbare IP-adressen die kunnen worden getest ([RPKI](/faqs/rpki/)).

source: test siterpki info summary
nl: *Geen* routeerbare IP-adressen gevonden (RPKI)

source: test siterpki label
nl: Route-autorisatie (RPKI)

source: test siterpki passed description
nl: Goed gedaan! Alle IP-adressen van je webserver en bijbehorende nameservers hebben een route-aankondiging die wordt gematcht door de gepubliceerde route-autorisatie ([RPKI](/faqs/rpki/)). Daardoor zijn bezoekers met ingeschakelde route-validatie beter beschermd tegen verschillende onbedoelde of kwaadwillige route-configuratiefouten, die kunnen leiden tot de onbereikbaarheid van je servers of de onderschepping van internetverkeer naar je servers.

source: test siterpki passed summary
nl: Geautoriseerde route-aankondiging (RPKI)

source: test siterpki title
nl: Route-autorisatie?

source: test siterpki warning description
nl: Waarschuwing! Ten minste één van de IP-adressen van je webserver en bijbehorende nameservers heeft een route-aankondiging waarvoor *geen* route-autorisatie is gepubliceerd ([RPKI](/faqs/rpki/)). Als gevolg daarvan zijn bezoekers met ingeschakelde routevalidatie *niet* (volledig) beschermd tegen verschillende onbedoelde of kwaadwillige route-configuratiefouten, die kunnen leiden tot de onbereikbaarheid van je servers of de onderschepping van internetverkeer naar je servers. Neem hierover contact op met je webhoster of nameserver-hoster. Zij kunnen hun netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren.

source: test siterpki warning summary
nl: Route-autorisatie *niet* gepubliceerd (RPKI)

source: test sitetls failed description
nl: Helaas! De verbinding met je website is *niet* of *onvoldoende* beveiligd ([HTTPS](/faqs/https/)). Gegevens die onderweg zijn tussen je website en haar bezoekers, zijn daardoor *niet* voldoende beschermd tegen afluisteren en manipulatie. Vraag je hostingprovider om HTTPS aan te zetten en veilig te configureren.

source: test sitetls failed summary
nl: Verbinding *niet* of onvoldoende beveiligd (HTTPS)

source: test sitetls info description
nl: Helaas! De verbinding met je website is *niet* of *onvoldoende* beveiligd ([HTTPS](/faqs/https/)). Gegevens die onderweg zijn tussen je website en haar bezoekers, zijn daardoor *niet* voldoende beschermd tegen afluisteren en manipulatie. Vraag je hostingprovider om HTTPS aan te zetten en veilig te configureren.

source: test sitetls info summary
nl: Verbinding *niet* of onvoldoende beveiligd (HTTPS)

source: test sitetls label
nl: Beveiligde verbinding (HTTPS)

source: test sitetls passed description
nl: Goed gedaan! De verbinding met je website is voldoende beveiligd ([HTTPS](/faqs/https/)). Gegevens die onderweg zijn tussen je website en haar bezoekers, zijn daardoor beschermd tegen afluisteren en manipulatie.

source: test sitetls passed summary
nl: Verbinding voldoende beveiligd (HTTPS)

source: test sitetls title
nl: Beveiligde verbinding?

source: test sitetls unreachable description
nl: Je webserver was niet bereikbaar voor ons. Daardoor was het onmogelijk om de test voor HTTPS (volledig) uit te voeren. Dit kan worden veroorzaakt door netwerkconnectiviteitsproblemen of door het niet accepteren van connecties door jouw webserver.

source: test sitetls unreachable summary
nl: Onbereikbare webserver (HTTPS)

source: test sitetls warning description
nl: Helaas! De verbinding met je website is *niet* of *onvoldoende* beveiligd ([HTTPS](/faqs/https/)). Gegevens die onderweg zijn tussen je website en haar bezoekers, zijn daardoor *niet* voldoende beschermd tegen afluisteren en manipulatie. Vraag je hostingprovider om HTTPS aan te zetten en veilig te configureren.

source: test sitetls warning summary
nl: Verbinding *niet* of onvoldoende beveiligd (HTTPS)

source: widget content notes
nl: ## Opmerkingen * Logo: We raden aan om ons [logo](/static/logo_nl.svg) op je eigen webserver op te slaan en te gebruiken. Op die manier is er geen contact met onze webserver als je website wordt bezocht. * Content-Security-Policy (CSP): Indien je op je website gebruikmaakt van CSP, dan zou je `internet.nl` moeten toevoegen aan de regels voor `form-action` en eventueel ook voor `img-src` als je linkt naar het logo op onze webserver.

source: widget mail html-block
nl: **Test je e-mail**
