Repository: internetstandards/Internet.nl
Catalog: translations/*/main.po
Languages: nl

source: detail mail tls zero-rtt verdict bad
nl: Tenminste één van je mailservers ondersteunt 0-RTT, wat *niet* veilig is.

source: detail mail tls zero-rtt verdict good
nl: Geen van je mailservers ondersteunen 0-RTT.

source: detail mail tls zero-rtt verdict na
nl: Deze subtest is niet van toepassing aangezien je mailservers TLS 1.3 niet ondersteunen.

source: detail tech data bogus
nl: bogus

source: detail tech data good
nl: goed

source: detail tech data http-csp has-bare-https
nl: Aanbeveling: Beleid zou geen 'https:' schema zonder specifiek hoofddomein moeten bevatten (regel 9).

source: detail tech data http-csp has-data
nl: Aanbeveling: Beleid zou geen 'data:' schema moeten bevatten waar dat niet is toegestaan (regel 7).

source: detail tech data http-csp has-http
nl: Aanbeveling: Beleid zou geen 'http:' schema moeten bevatten (regel 8).

source: detail tech data http-csp has-invalid-host
nl: Aanbeveling: Beleid zou geen wildcard (d.w.z. '*') mogen bevatten voor het volledige hostgedeelte van een URL (regel 9), en geen '127.0.0.1' (regel 10).

source: detail tech data http-csp has-unsafe-eval
nl: Aanbeveling: Beleid zou niet 'unsafe-eval' moeten bevatten (regel 6).

source: detail tech data http-csp has-unsafe-hashes
nl: Aanbeveling: Beleid zou niet 'unsafe-hashes' moeten bevatten (regel 6).

source: detail tech data http-csp has-unsafe-inline
nl: Aanbeveling: Beleid zou niet 'unsafe-inline' moeten bevatten (regel 6).

source: detail tech data http-csp missing-invalid-base-uri
nl: Aanbeveling: Beleid zou 'base-uri' met voldoende veilige waarde moeten bevatten (regel 2).

source: detail tech data http-csp missing-invalid-default-src
nl: Aanbeveling: Beleid zou 'default-src' met voldoende veilige waarde moeten bevatten (regel 1).

source: detail tech data http-csp missing-invalid-form-action
nl: Aanbeveling: Beleid zou 'form-action' met voldoende veilige waarde moeten bevatten (regel 5).

source: detail tech data http-csp missing-invalid-frame-ancestors
nl: Aanbeveling: Beleid zou 'frame-ancestors' met voldoende veilige waarde moeten bevatten (regel 4).

source: detail tech data http-csp missing-invalid-frame-src
nl: Aanbeveling: Beleid zou 'frame-src' met voldoende veilige waarde moeten bevatten, of als fallback een geldige 'child-src' of 'default-src' (regel 3).

source: detail tech data http-csp no-policy-found
nl: Geen Content-Security-Policy (CSP) gevonden.

source: detail tech data http-csp policy-found
nl: Opgehaalde Content-Security-Policy (CSP) waarde: {policy}

source: detail tech data http-securitytxt data_after_sig
nl: Fout: Ondertekende security.txt moet geen gegevens bevatten na de handtekening (regel {line_no}).

source: detail tech data http-securitytxt empty_key
nl: Fout: Veldnaam moet niet leeg zijn (regel {line_no}).

source: detail tech data http-securitytxt empty_value
nl: Fout: Veldwaarde moet niet leeg zijn (regel {line_no}).

source: detail tech data http-securitytxt expired
nl: Fout: Datum en tijd in het veld 'Expires' moeten niet in het verleden liggen (regel {line_no}).

source: detail tech data http-securitytxt invalid_charset
nl: Fout: Charset parameter in Content-Type header moet 'utf-8' zijn indien aanwezig.

source: detail tech data http-securitytxt invalid_expiry
nl: Fout: Datum en tijd in het veld 'Expires' moeten worden geformatteerd conform ISO 8601 (regel {line_no}).

source: detail tech data http-securitytxt invalid_lang
nl: Fout: De waarde in het veld 'Preferred-Languages' moet overeenkomen met één of meer taal-tags zoals gedefinieerd in RFC5646, gescheiden door komma's (regel {line_no}).

source: detail tech data http-securitytxt invalid_line
nl: Fout: Regel moet een veldnaam en -waarde bevatten, tenzij de regel leeg is of een commentaar bevat (regel {line_no}).

source: detail tech data http-securitytxt invalid_media
nl: Fout: Media type in Content-Type header moet 'text/plain' zijn.

source: detail tech data http-securitytxt location
nl: Fout: security.txt stond op het top-level pad (verouderde locatie), maar moet geplaatst worden onder het '/.well-known/' pad.

source: detail tech data http-securitytxt long_expiry
nl: Aanbeveling: Datum en tijd in het veld 'Expires' zouden minder dan een jaar in de toekomst moeten liggen (regel {line_no}).

source: detail tech data http-securitytxt multi_expire
nl: Fout: Het veld 'Expires' moet niet meer dan één keer voorkomen.

source: detail tech data http-securitytxt multi_lang
nl: Fout: Het veld 'Preferred-Languages' moet niet meer dan één keer voorkomen.

source: detail tech data http-securitytxt no_canonical
nl: Aanbeveling: Het veld 'Canonical' zou aanwezig moeten zijn in een ondertekend bestand.

source: detail tech data http-securitytxt no_contact
nl: Fout: Het veld 'Contact' moet minstens één keer voorkomen.

source: detail tech data http-securitytxt no_content_type
nl: Fout: HTTP Content-Type header moet worden verstuurd.

source: detail tech data http-securitytxt no_encryption
nl: Aanbeveling: Het veld 'Encryption' zou aanwezig moeten zijn wanneer het veld 'Contact' een e-mailadres bevat.

source: detail tech data http-securitytxt no_expire
nl: Fout: Het veld 'Expires' moet aanwezig zijn.

source: detail tech data http-securitytxt no_https
nl: Fout: De web URI moet beginnen met 'https://' (regel {line_no}).

source: detail tech data http-securitytxt no_line_separators
nl: Error: Every line must end with either a carriage return and line feed characters or just a line feed character.

source: detail tech data http-securitytxt no_security_txt_404
nl: Fout: security.txt kon niet gevonden worden.

source: detail tech data http-securitytxt no_security_txt_other
nl: Fout: security.txt kon niet gevonden worden (onverwachte HTTP response code {status_code}).

source: detail tech data http-securitytxt no_space
nl: Fout: Veld-scheidingsteken (dubbele punt) moet worden gevolgd door een spatie (regel {line_no}).

source: detail tech data http-securitytxt no_uri
nl: Fout: Veldwaarde moet een URI zijn (bijv. beginnend met 'mailto:') (regel {line_no}).

source: detail tech data http-securitytxt not_signed
nl: Aanbeveling: security.txt zou digitaal ondertekend moeten zijn.

source: detail tech data http-securitytxt prec_ws
nl: Fout: Er mag geen spatie staan voor het veld-scheidingsteken (dubbele punt) (regel {line_no}).

source: detail tech data http-securitytxt requested-from
nl: security.txt opgevraagd van {hostname}.

source: detail tech data http-securitytxt retrieved-from
nl: security.txt opgehaald van {hostname}.

source: detail tech data http-securitytxt signed_format_issue
nl: Fout: Ondertekende security.txt moet beginnen met de kop '-----BEGIN PGP SIGNED MESSAGE-----'.

source: detail tech data http-securitytxt unknown_field
nl: Notificatie: security.txt bevat een onbekend veld. Ofwel het gaat om een aangepast veld dat misschien niet algemeen ondersteund wordt, ofwel er is sprake van een typfout in een gestandaardiseerde veldnaam (regel {line_no}).

source: detail tech data http-securitytxt utf8
nl: Fout: Inhoud moet utf-8 gecodeerd zijn.

source: detail tech data insecure
nl: insecure

source: detail tech data insufficient
nl: onvoldoende

source: detail tech data no
nl: nee

source: detail tech data not-applicable
nl: niet van toepassing

source: detail tech data not-reachable
nl: niet bereikbaar

source: detail tech data not-testable
nl: niet testbaar

source: detail tech data not-tested
nl: niet getest

source: detail tech data phase-out
nl: uit te faseren

source: detail tech data secure
nl: secure

source: detail tech data sufficient
nl: voldoende

source: detail tech data yes
nl: ja

source: detail verdict could-not-test
nl: Testfout. Graag later opnieuw proberen.

source: detail verdict not-tested
nl: Deze subtest is niet uitgevoerd, omdat een bovenliggende test waarvan deze subtest afhankelijk is een negatief testresultaat gaf, of omdat onvoldoende informatie beschikbaar was om de subtest uit te kunnen voeren.

source: detail web appsecpriv http-csp exp
nl: Wij testen of je webserver een HTTP-header voor `Content-Security-Policy` (CSP) aanbiedt. Verder controleren we op verschillende veilige CSP-instellingen, hoewel we de effectiviteit van je CSP-configuratie *niet* uitputtend testen. CSP beschermt een website tegen aanvallen via content injection zoals cross-site scripting (XSS). Door met CSP een 'allowlist' met *bronnen van goedgekeurde content* in te stellen, kan je voorkomen dat browsers die jouw website tonen daarbij kwaadaardige content van aanvallers laden. Wij testen op onderstaande regels die gebaseerd zijn op good pracrices voor een veilige CSP-configuratie. 1. De `default-src` richtlijn moet zijn gedefinieerd en de waarde moet zijn óf `'none'`, óf `'self'` en/of één of meer URL's van het domein zelf (inclusief het subdomein of superdomein ervan). Dit is om een restrictief default fallback beleid te hebben voor bron-typen die gebruikt worden in je website waarvoor geen specifiek beleid is gedefinieerd. Naast deze waarden kan `'report-sample'` als waarde zijn ingesteld als je wil dat in de 'violation reports' code-voorbeelden worden opgenomen. 2. De `base-uri` richtlijn moet zijn gedefinieerd en de waarde moet zijn óf `'none'`, óf `'self'` en/of één of meer URL's van het domein zelf (inclusief het subdomein of superdomein ervan). Dit limiteert de `baseURI` zodat de injectie van een gemanipuleerd `<base>` element wordt geblokkeerd. Dit beperkt de mogelijkheden van aanvallers om de locaties van bronnen (bijv. scripts) die vanaf relatieve URL's worden geladen te manipuleren. 3. De `frame-src` richtlijn moet zijn gebruikt (hetzij per definitie of via de fallback naar `child-src` en `default-src`) en de waarde moet zijn óf `'none'`, óf `'self'` en/of één of meer specifieke URL's. Dit voorkomt dat inhoud van niet-geautoriseerde locaties wordt geframed of ge-embed in je website (met HTML-elementen zoals `<frame>` en `<iframe>`). 4. De `frame-ancestors` richtlijn moet zijn gedefinieerd zijn en de waarde moet zijn óf `'none'`, óf `'self'` en/of één of meer specifieke URL's. Dit voorkomt dat ongeautoriseerde websites je website kunnen framen of embedden (met de HTML-elementen `<frame>`, `<iframe>`, `<object>`, `<embed>`, of `<applet>`). 5. De `form-action` richtlijn moet zijn gedefinieerd en de waarde ervan moet zijn óf `'none'`, óf `'self'` en/of één of meer specifieke URLs. Dit limiteert de URL's die gebruikt kunnen worden als doel voor formulierverzendingen. 6. `unsafe-inline`, `unsafe-eval` en `unsafe-hashes` moeten *niet* gebruikt worden, omdat deze XSS-aanvallen mogelijk maken. 7. `data:` moet *niet* gebruikt worden in `default-src`, `script-src` en `object-src`, omdat dit XSS-aanvallen mogelijk maakt. 8. Bij het opnemen van een domein moet `http://` als schema *niet* gebruikt worden, omdat dit het mogelijk maakt dat bronnen worden gedownload over een onveilige verbinding. Gebruik in plaats daarvan `https://`. 9. Een wildcard (dat wil zeggen `*`) voor volledige host-gedeelte van een URL moet *niet* gebruikt worden in een CSP-richtlijn, omdat daardoor iedere externe bron is toegestaan. Gebruik bovendien *niet* alleen `https:` omdat dit gelijk staat aan `https://*`. Specificeer altijd het hoofddomein (bijvoorbeeld `https://scripts.example.nl` of `https://*.example.nl`). 10. `127.0.0.1` moet *niet* gebruikt worden in een CSP-richtlijn, omdat dit aanvallen via content injection mogelijk maakt in een gecompromitteerd systeem. Aanvullende aanbevelingen: 1. Sta alleen zo specifiek mogelijke domeinen toe in CSP-richtlijnen. Dit wordt in deze subtest voor CSP tot op zekere hoogte automatisch getest. * Sta *niet* alle domeinen onder een TLD (`*.nl`) of SLD (`*.gov.uk`) toe, hoewel we hier momenteel *niet* op testen. * Sta *niet* een ander domein onder een SLD toe in `default-src` (bijvoorbeeld `voorbeeld2.gov.nl` voor `voorbeeld1.gov.nl`), hoewel we hier momenteel *niet* op testen. 2. Gebruik *niet* inline scripts of styles. In gevallen waarin je het gebruik van inline scripts of styles niet kunt vermijden, gebruik dan *niet* `unsafe-inline` (zoals hierboven vermeld) maar gebruik bij voorkeur CSP-hashes of anders CSP-nonces. 3. Gebruik de HTTP-header als mechanisme voor het serveren van je CSP-beleid. Gebruik *niet* het HTML `<meta>` element om je CSP-beleid te serveren. Het laatste is minder veilig en ondersteunt niet alle CSP-richtlijnen (bijvoorbeeld niet het vereiste `frame-ancestors`). Daarom controleren we *niet* op CSP die wordt aangeboden via het HTML `<meta>`-element. 4. Gebruik de HTTP-header voor `Content-Security-Policy-Report-Only` om te experimenteren met je CSP-configuratie door het effect ervan te controleren maar nog niet af te dwingen. 5. Merk op dat een lege bronnenlijst (d.w.z. een CSP-richtlijn zonder waarde) gelijk is aan een bronnenlijst met `none`. Merk bovendien op dat als er andere bronnen in een bronnenlijst naast `none` staan, het attribuut `none` wordt genegeerd. Zie ook ['Webapplicatie-richtlijnen van NCSC, Verdieping'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties), richtlijn U/PW.03. *Niveau van vereistheid: Aanbevolen*

source: detail web appsecpriv http-csp label
nl: Content-Security-Policy

source: detail web appsecpriv http-csp tech table
nl: Webserver-IP-adres|Bevindingen

source: detail web appsecpriv http-csp verdict bad
nl: Je webserver biedt *geen* Content-Security-Policy (CSP) aan, of biedt CSP aan met bepaalde *onveilige* instellingen .

source: detail web appsecpriv http-csp verdict good
nl: Je webserver biedt Content-Security-Policy (CSP) aan en maakt geen gebruik van bepaalde onveilige CSP-instellingen.

source: detail web appsecpriv http-referrer-policy exp
nl: We testen of je webserver een HTTP header voor `Referrer-Policy` aanbiedt. Met deze HTTP header kan je browsers laten weten welke zogenoemde referer-informatie, die wordt verzonden in de `Referer` header, onderdeel mag zijn van de website-opvraging. De `Referer` header bevat het adres van de vorige webpagina waarop de bezoeker een link volgde naar de opgevraagde pagina. De informatie in de `Referer` header wordt meestal gebruikt voor analytics en logging. Er kunnen echter privacy- and beveiligingsrisico's aan kleven. De informatie kan bijvoorbeeld gebruikt worden voor user tracking en de informatie kan lekken naar derden die de verbinding afluisteren. Met de HTTP header voor `Referrer-Policy` kan je deze risico's mitigeren. Momenteel beoordelen we *niet* de effectiviteit van de ingestelde `Referrer-Policy` waarde. We adviseren wel om een geïnformeerde beslissing te nemen, met privacy- en beveiligingsrisico's in gedachte, over het gebruik van één van de policy-waarden uit de onderstaande eerste twee categorieën. *Aanbevolen policy-waarden:* 1. Geen gevoelige informatie naar derde-partijen - `no-referrer` - `same-origin` 2. Gevoelige informatie naar derde-partijen alleen via beveiligde verbindingen (HTTPS) - `strict-origin` - `strict-origin-when-cross-origin` (default policy van browsers volgens huidige "Editor’s Draft") *Niet aanbevolen policy-waarden:* 3. Gevoelige informatie naar derde-partijen mogelijkerwijs via onbeveiligde verbindingen (HTTP) - `no-referrer-when-downgrade`(default policy van browsers volgens "Candidate Recommendation, 26 January 2017") - `origin-when-cross-origin` - `origin` - `unsafe-url` *Niveau van vereistheid: Aanbevolen*

source: detail web appsecpriv http-referrer-policy label
nl: Referrer-Policy aanwezigheid

source: detail web appsecpriv http-referrer-policy tech table
nl: Webserver-IP-adres|Referrer-Policy waarde

source: detail web appsecpriv http-referrer-policy verdict bad
nl: Je webserver biedt *geen* Referrer-Policy aan.

source: detail web appsecpriv http-referrer-policy verdict good
nl: Je webserver biedt Referrer-Policy aan.

source: detail web appsecpriv http-securitytxt exp
nl: We testen of je webserver een `security.txt` bestand op de juiste locatie aanbiedt, of het opgehaald kan worden, en of de inhoud ervan syntactisch geldig is. `security.txt` is een tekstbestand met contactinformatie dat je op je webserver plaatst. Beveiligingsonderzoekers kunnen deze informatie gebruiken om direct contact met de juiste afdeling of persoon binnen je organisatie op te nemen over kwetsbaarheden die zij in je website of IT-systemen hebben gevonden. Dit kan het verhelpen van gevonden kwetsbaarheden versnellen, waardoor kwaadwillenden minder kans hebben om er misbruik van te maken. Het formaat van het bestand is bedoeld om machinaal en menselijk leesbaar te zijn. De contactinformatie kan een e-mailadres, een telefoonnummer en/of een webpagina (bijvoorbeeld een webformulier) zijn. Merk op dat gepubliceerde contactinformatie openbaar is en ook kan worden misbruikt, bijvoorbeeld om spam te sturen naar een gepubliceerd e-mailadres. Naast contactinformatie moet het `security.txt` bestand ook een vervaldatum bevatten. Om te voorkomen dat de informatie niet meer actueel is, wordt aanbevolen een vervaldatum op te nemen die minder dan een jaar in de toekomst ligt. Het is optioneel om ook andere relevante informatie voor beveiligingsonderzoekers op te nemen, zoals een link naar je beleid voor het omgaan met meldingen van beveiligingskwetsbaarheden (meestal Coordinated Vulnerability Disclosure policy genoemd). Het wordt aanbevolen om het `security.txt` bestand te ondertekenen met PGP en daarbij de web URI waarop het bestand staat in een `Canonical` veld op te nemen. Momenteel controleren we de waarde van de `Canonical` velden niet, omdat de security.txt-specificatie niet duidelijk is over de betekenis ervan, met name wanneer het om redirects gaat. Wij controleren of het bestand security.txt ondertekend is. We *valideren* de handtekening echter niet, omdat er helaas geen gestandaardiseerde plaats is om een publieke PGP-sleutel (die nodig is voor handtekeningvalidatie) op te halen. Het bestand moet gepubliceerd worden onder het `/.well-known/` pad. Merk op dat het plaatsen onder het top-level pad verouderd is. Elk web(sub)domein dient zijn eigen `security.txt` bestand te hebben. Doorverwijzen met een redirect naar een `security.txt` op een ander domein is toegestaan. Een voorbeeldbestand is te vinden op [`https://example.nl/.well-known/security.txt`](https://example.nl/.well-known/security.txt). Merk op dat `security.txt` bestanden normaal gesproken slechts enkele kilobytes groot zijn. We lezen en evalueren daarom maximaal de eerste 100 kB van een gevonden `security.txt` bestand. *Niveau van vereistheid: Aanbevolen*

source: detail web appsecpriv http-securitytxt label
nl: Security.txt

source: detail web appsecpriv http-securitytxt tech table
nl: Webserver-IP-adres|Bevindingen

source: detail web appsecpriv http-securitytxt verdict bad
nl: Je webserver biedt *geen* security.txt-bestand op de juiste plaats aan, het kon *niet* worden opgehaald, of de inhoud ervan is syntactisch *niet* geldig.

source: detail web appsecpriv http-securitytxt verdict good
nl: Je webserver biedt een security.txt-bestand op de juiste plaats aan en de inhoud ervan is syntactisch geldig.

source: detail web appsecpriv http-securitytxt verdict recommendations
nl: Je webserver biedt een security.txt-bestand op de juiste plaats aan en de inhoud ervan is syntactisch geldig. Echter, er zijn een of meer aanbevelingen voor verbetering.

source: detail web appsecpriv http-x-content-type exp
nl: We testen of je webserver een HTTP header voor `X-Content-Type-Options` aanbiedt. Met deze HTTP header kan je webbrowsers laten weten dat zij geen 'MIME type sniffing' mogen uitvoeren en altijd het `Content-Type` zoals gedeclareerd door jouw webserver moeten volgen. De enige geldige waarde voor deze HTTP header is `nosniff`. Indien actief, dan zal een browser verzoeken voor `style` en `script` blokkeren als deze geen corresponderende `Content-Type` (dat wil zeggen `text/css` of een 'Javascript MIME type' zoals `application/javascript`) hebben. 'MIME type sniffing' is een techniek waarbij de browser de inhoud van een bestand scant om te bepalen wat het formaat van het bestand is, ongeacht het door de webserver gedeclareerde `Content-Type`. Deze techniek is kwetsbaar voor de zogenaamde 'MIME confusion attack' waarbij de aanvaller de content van een bestand zodanig manipuleert dat de browser deze behandelt als een andere `Content-Type`, zoals een executeerbaar bestand. *Niveau van vereistheid: Aanbevolen*

source: detail web appsecpriv http-x-content-type label
nl: X-Content-Type-Options

source: detail web appsecpriv http-x-content-type tech table
nl: Webserver-IP-adres|X-Content-Type-Options waarde

source: detail web appsecpriv http-x-content-type verdict bad
nl: Je webserver biedt *geen* X-Content-Type-Options aan.

source: detail web appsecpriv http-x-content-type verdict good
nl: Je webserver biedt X-Content-Type-Options aan.

source: detail web appsecpriv http-x-frame exp
nl: We testen of je webserver een HTTP header voor `X-Frame-Options` aanbiedt die een voldoende veilige instelling heeft. Met deze HTTP header kan je webbrowsers laten weten of het toegestaan is om jouw website te 'framen'. Het voorkomen van 'framen' beschermt bezoekers tegen aanvallen zoals clickjacking. We beschouwen de volgende waarden als voldoende veilig: * `DENY` ('framen' niet toegestaan); of * `SAMEORIGIN` ('framen' alleen door je eigen website toegestaan). Alhoewel de waarde `ALLOW-FROM` (alleen genoemde websites mogen jouw website 'framen') onderdeel is van de specificatie voor`X-Frame-Options` ([RFC 7034](https://tools.ietf.org/html/rfc7034)), wordt deze *niet* ondersteund door moderne webbrowsers. Om die reden beschouwen we deze waarde *niet* als voldoende veilig. Merk op dat `Content-Security-Policy` ([CSP](#control-panel-29)) via `frame-ancestors` vergelijkbare bescherming en daarnaast nog veel meer biedt voor bezoekers met moderne webbrowsers. Maar `X-Frame-Options` kan nog steeds bescherming bieden aan bezoekers van oudere browsers die geen CSP ondersteunen. Bovendien kan `X-Frame-Options` waardevolle bescherming aan alle bezoekers bieden, indien CSP niet (goed) is ingesteld voor de desbetreffende website. Zie ook ['Webapplicatie-richtlijnen van NCSC, Verdieping'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties), richtlijn U/PW.03. *Niveau van vereistheid: Optioneel*

source: detail web appsecpriv http-x-frame label
nl: X-Frame-Options

source: detail web appsecpriv http-x-frame tech table
nl: Webserver-IP-adres|X-Frame-Options waarde

source: detail web appsecpriv http-x-frame verdict bad
nl: Je webserver biedt *geen* veilig ingestelde X-Frame-Options aan.

source: detail web appsecpriv http-x-frame verdict good
nl: Je webserver biedt veilig ingestelde X-Frame-Options aan.
