Repository: internetstandards/Internet.nl
Catalog: translations/*/news.po
Languages: nl

source: article mail-over-ipv6-waar-moet-ik-op-letten body
nl: ## Aanvullende eisen voor IPv6 Vergeleken met mail die via IPv4 binnenkomt, stellen verschillende (grote) mailproviders extra eisen aan mail die ze over IPv6 ontvangen. Deze aanvullende eisen zorgen ervoor dat de mailproviders kunnen filteren op basis van domeinnaamreputatie in plaats van of naast IP-adresreputatie. Daardoor kunnen ze over IPv6 verstuurde spam en phishing mail beter tegengaan. Bij Gmail staat IPv6-ontvangst overigens standaard aan. Bij Office365 kan Microsoft het nu op verzoek van de klant aanzetten. ### Meer IP-adressen dan ooit Dankzij IPv6 is er een bijna onuitputtelijke voorraad IP-adressen bijgekomen. Dat betekent ook dat er veel meer IP-adressen zijn waarvandaan internetcriminelen spam en phishing mails kunnen versturen. Daardoor heeft het werken met bloklijsten ('block lists') – zoals we gewend zijn met IPv4 – bij IPv6-adressen minder zin. We illustreren dit met het volgende voorbeeld. ### Voorbeeld: blocklisting werkt minder goed Stel dat er spam vanaf jouw thuis-aansluiting komt (omdat je besmet bent met een spam botnet zoals Cutwail), dan kan een mailprovider je IPv4-adres snel op een blocklist zetten. Mocht het je nog lukken om een ander IPv4-adres te krijgen, dan wordt dat ook geblocklist. Maar heb je thuis IPv6, dan heb je meestal een subnet met heel veel IPv6-adressen. De spambot kan dan vrijwel eindeloos van adres wisselen en dat jaren volhouden, want in een IPv6-subnet van /64 zitten 18.446.744.073.709.551.616 adressen. Hoewel het mogelijk is om een subnet op een blocklist te zetten, is het niet altijd duidelijk hoe groot een individueel subnet is. De blokkade van een subnet kan al snel als negatief bijeffect hebben dat anderen onbedoeld ook gehinderd worden. ### Koppeling e-mail en domeinaam Wat is de oplossing? Mailproviders, zoals [Gmail](https://support.google.com/mail/answer/81126?hl=nl#authentication) en [MS Office365](https://technet.microsoft.com/en-us/library/dn720852(v=exchg.150).aspx), willen een via IPv6 ontvangen e-mail ook aan een domeinnaam kunnen koppelen – en niet alleen aan een IPv6-adres. Zo nodig kunnen ze dan e-mails vanaf een bepaalde domeinnaam filteren. De mailproviders stellen de volgende twee eisen die zijn gebaseerd op de best practice ['Policy Issues for Receiving Email in a World with IPv6 Hosts'](https://www.m3aawg.org/sites/default/files/document/M3AAWG_Inbound_IPv6_Policy_Issues-2014-09.pdf) van M³AAWG : **1. E-mailauthenticatie** De verzonden mail moet óf de SPF-controle (“mag dit IP-adres mailen voor dit afzenderdomein?”) óf de DKIM-controle (“is deze mail ondertekend met de geldige digitale handtekening van dit afzenderdomein?”) succesvol doorstaan. **2. Reverse DNS** Het IPv6-adres van de verzendende mailserver moet een via reverse DNS opvraagbare PTR-record (d.w.z. domeinnaam) hebben. Gmail vereist aanvullend dat dit IPv6-adres overeenkomt met het IPv6-adres dat kan worden verkregen via normale (voorwaartse) DNS-omzetting van de domeinnaam uit de PTR-record (d.w.z. Forward-confirmed reverse DNS). ## Wat kan je doen? ### Mail via provider Bent je klant bij een e-mailprovider die IPv6 ondersteunt, dan kun je te maken hebben met deze ‘best practice’. Wanneer een verzendende partij die IPv6 gebruikt zijn SPF-, DKIM-, rDNS-instellingen niet op orde heeft, dan kan het gebeuren dat je geen e-mails meer van deze partij ontvangt. De kans daarop is echter niet heel groot. Verzenders die via IPv6 versturen, zijn doorgaans op de hoogte van de ‘best practice’ en passen deze toe. Gaat het toch mis met bepaalde inkomende mails over IPv6? Wijs de verzendende partij dan op de beschreven 'best practice'. ### Mail via eigen mailserver Als je IPv6 aanzet voor mail en zelf je mailservers draait, dan is er weinig aan de hand qua inkomende mail. Het is uiteraard ook dan verstandig om controles op e-mailauthenticatie en eventueel aanvullend reverse DNS uit te voeren om spam en phishing te voorkomen. Omdat je zelf aan de knoppen zit, kun je meteen zien wanneer een mail die je via IPv6 ontvangt niet door de controles komt. Voor uitgaande mail is het aan te raden om je mailservers conform bovengenoemde ‘best practice’ in te richten. Anders loop je het risico dat jouw mails over IPv6 niet aankomen. ### Gebruik je alleen IPv4 en nog geen IPv6? Ook in het geval van IPv4 is het van belang om in ieder geval e-mailauthenticatie (SPF, DKIM en aanvullend DMARC) op orde te hebben. Deze standaarden helpen ook bij IPv4 om spam en phishing te voorkomen en de afleveringszekerheid van je mail te vergroten. Bovendien toont [Gmail](https://support.google.com/mail/answer/180707?hl=nl) sinds enige tijd aan de gebruiker een vraagteken naast de naam van de afzender als zowel de SPF- als DKIM-check hebben gefaald, ook bij mail over IPv4. En zo'n vraagteken bij je afzendernaam dat wil toch niemand? Zorg er daarnaast voor dat je snel ook via een modern IPv6-adres mailt. ### Test via Internet.nl In de mailtest op [Internet.nl](/) kan je eenvoudig testen of je mail via IPv6 kan ontvangen en of je voor uitgaande mail SPF-, DKIM-, en DMARC-records hebt gepubliceerd.

source: article mail-over-ipv6-waar-moet-ik-op-letten date
nl: 16 september 2016

source: article mail-over-ipv6-waar-moet-ik-op-letten lead
nl: Mail versturen en ontvangen via IPv6 werkt prima. Verschillende partijen, zoals Gmail, Office365, TransIP, BIT en Internet.nl zelf, doen dat ook al. Toch zijn er een paar zaken waar je op moet letten om te zorgen dat je mail zonder problemen afgeleverd wordt.

source: article mail-over-ipv6-waar-moet-ik-op-letten title
nl: Mail over IPv6: waar moet ik op letten?

source: article nederland-voor-veilig-emailverkeer body
nl: In de coalitie nemen de volgende partijen deel: PostNL, KPN, Betaalvereniging Nederland, DDMA, Thuiswinkel.org, VNO-NCW, MKB-Nederland, Stichting Zeker-OnLine, Dutch Datacenter Association, Stichting DINL, XS4all, Ministerie van Binnenlandse Zaken en Koninkrijksrelaties (Rijks-CIO), Fraudehelpdesk, Nederland ICT en de Belastingdienst. De deelnemers aan de 'Veilige E-mail Coalitie' gaan binnen hun organisaties aan de slag met het invoeren van maatregelen voor het beveiligen van e-mailverkeer. Daarvoor wordt gebruik gemaakt van gezamenlijke vastgestelde standaarden. Op die manier kan zowel phishing als het afluisteren van e-mail worden tegengegaan. Daarnaast gaan zij het gebruik van e-mailbeveiliging verder versnellen door onderlinge kennisdeling en promotie. De betrokken partijen nodigen andere bedrijven en overheden uit om zich aan te sluiten en gebruik te maken van de kennis binnen de coalitie. Marcel Krom, CIO bij PostNL: "We zijn zelf vergevorderd met de implementatie van de moderne e-mailbeveiligingsstandaarde. Maar we realiseren ons dat alle partijen in het mail-ecosysteem mee moeten doen om het echt te laten werken. Daarom sluiten we graag aan bij de coalitie." ## E-mail populair maar ook kwetsbaar E-mail is een zeer veel gebruikt communicatiemiddel. Miljoenen Nederlanders verzenden en ontvangen dagelijks samen tientallen miljoenen e-mailberichten. Onveilige e-mail zorgt helaas dagelijks voor misbruik en schade. Gelukkig kan e-mail veiligere. Daarvoor is het wel belangrijk dat verzenders en ontvangers in de gehele keten moderne beveiligingsmaatregelen en daarbij behorende standaarden toepassen. Steeds meer partijen doen dat al. De standaarden waar de 'Veilige E-mail Coalitie' voor staat, zorgen ervoor dat internetcriminelen niet zomaar uit naam van andermans e-mailadres phishingmails kunnen versturen. Daarnaast helpen ze om het afluisteren van bedrijfs- en privacy-gevoelige informatie in e-mails te voorkomen. Door het open karakter van deze standaarden zijn die voor alle organisaties beschikbaar. Het initiatief is tot stand gekomen onder regie van Ministerie van Economische Zaken en Forum Standaardisatie. De coalitie heeft de support van Platform Internetstandaarden (Internet.nl), waarin de volgende partijen deelnemen: Dutch Hosting Provider Association (DHPA), ECP, Forum Standaardisatie, Internet Society internationaal, Internet Society Nederland, ISPConnect, Ministerie van Economische Zaken, Nationaal Cyber Security Centrum (NCSC), NLnet, NLnet Labs, RIPE NCC, SIDN en SURFnet. <video controls width="640" height="360" poster="/static/article/nederland-voor-veilig-emailverkeer/20170202_ondertekening_veilige_email_coalitie_PNG_1280x720.png"> <source src="/static/article/nederland-voor-veilig-emailverkeer/20170202_ondertekening_veilige_email_coalitie_WEBM_1280x720.webm" type="video/webm"> <source src="/static/article/nederland-voor-veilig-emailverkeer/20170202_ondertekening_veilige_email_coalitie_MP4_1280x720.mp4" type="video/mp4"> I'm sorry; your browser doesn't support this video. </video> * [Intentieverklaring Veilige E-mail Coalitie](/static/article/nederland-voor-veilig-emailverkeer/20170201a_Intentieverklaring_Veilige_E-mail_Coalitie.pdf)

source: article nederland-voor-veilig-emailverkeer date
nl: Den Haag, 2 februari 2017

source: article nederland-voor-veilig-emailverkeer lead
nl: Bedrijfsleven, brancheorganisaties en overheid gaan gezamenlijk misbruik zoals phishing en het afluisteren van e-mail aanpakken. Daartoe hebben zij met steun van het ministerie van Economische Zaken de 'Veilige E-mail Coalitie' opgericht. Dit is vandaag bekend gemaakt tijdens het symposium van het Forum Standaardisatie.

source: article nederland-voor-veilig-emailverkeer title
nl: Nederland zorgt voor veilig e-mailverkeer

source: article new-release-with-improved-tests-for-TLS-and-CSP body
nl: ## Laatste TLS-richtlijnen van NCSC-NL ondersteund De onlangs bijgewerkte [ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS)](https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1) van NCSC-NL hebben geleid tot de volgende wijzigingen in de website- en mailtest: 1. Het beveiligingsniveau van TLS 1.2 is afgewaardeerd van *Goed* naar *Voldoende* (richtlijn B1-1). TLS 1.3 is nog steeds *Goed*. Dit heeft geen invloed op het testresultaat van Internet.nl, omdat wij *Voldoende* TLS-versies ook al genoeg achtten om voor de subtest te slagen. Wel hebben we de afwaardering opgenomen in de testuitleg van de subtest voor TLS-versie. 2. De eisen voor de volgorde van algoritme selecties zijn vereenvoudigd. De volgorde wordt enkel nog op het niveau van veiligheidsniveau's voorgeschreven (richtlijn B2-5). We hebben de subtest voor cipher-volgorde hierop aangepast. 3. Het ondersteunen van client-initiated renegotation is niet langer *Onvoldoende*, maar *Voldoende* (richtlijn B8-1). Internet.nl heeft het [niveau van vereistheid](/faqs/report/) voor de client-initiated renegotation subtest gewijzigd in 'Optioneel'. ## CSP-instellingen getest Content-Security-Policy ([CSP](https://www.w3.org/TR/CSP3/)) bewaakt een website tegen aanvallen met content injection, waaronder cross-site scripting (XSS). We controleren vanaf nu op een aantal (on)veilige CSP-instellingen (zoals `unsafe-inline` en `unsafe-eval`), hoewel we de effectiviteit van je CSP-configuratie niet uitputtend testen. Het [niveau van vereistheid](/faqs/report/) van de CSP-subtest is verhoogd van 'Optioneel' naar 'Aanbevolen'. ## Niet-mail domeinen beter ondersteund We controleren vanaf nu expliciet op niet-verzendende en niet-ontvangende mailconfiguraties, en verwachten het volgende. * Niet-verzendend domein: Gebruik de meest strikte DMARC policy (`p=reject`) en SPF policy (`-all`) voor je domein dat je niet gebruikt voor het verzenden van mail, om misbruik ('spoofing') te voorkomen. Merk op dat DKIM in dit geval niet nodig is. * Niet-ontvangend domein: In het geval dat je geen mail wilt ontvangen op je domein dat A-/AAAA-records heeft, adviseren wij je om [Null MX](https://tools.ietf.org/html/rfc7505) te gebruiken. In het geval dat je domein geen A-/AAAA-records heeft en je geen mail wilt ontvangen op je domein, adviseren we je om helemaal geen MX-record te configureren (d.w.z. ook geen Null MX record). ## Minimale max-age voor HSTS uitgebreid HTTP Strict Transport Security ([HSTS](https://tools.ietf.org/html/rfc6797)) dwingt een webbrowser om direct via HTTPS te verbinden bij het opnieuw bezoeken van je website. Dit helpt bij het voorkomen van man-in-the-middle aanvallen. We hebben besloten om de minimum HSTS cache geldigheidsduur te verlengen van 6 maanden naar 1 jaar (`max-age=31536000`). Dit is in overeenstemming met de gangbare good practices. Meer details over de bovenstaande verbeteringen zijn te vinden in de testuitleg van de betreffende subtests van de [websitetest](/test-site/) en de [e-mailtest](/test-mail/). ## Over Internet.nl De testtool Internet.nl is een initiatief van het **Platform Internetstandaarden**, een samenwerkingsverband van partijen uit de Internetgemeenschap en de Nederlandse overheid. Het doel van het platform is om gezamenlijk het gebruik van moderne internetstandaarden verder te vergroten om daarmee het internet voor iedereen toegankelijker, veiliger en betrouwbaarder te maken. --- ## Release notes: - New: - NCSC-NL's TLS guidelines 2.1; - Validate CSP directives; - Support non email sending domains in mailtest for DKIM test; - Explicitly test for NULL MX; - Support for SSL_OP_PRIORITIZE_CHACHA; - Keep and display the organizational domain for DMARC; - 100% badges page in knowledge base; - Ignore nonces for IPv4 vs IPv6 comparison; - Accessibility statement for Internet.nl; - Use IDNA2008. - Changes: - Minimum max-age for HSTS is now 1 year; - Accept all 3xx+3xx and 3xx+2xx DANE rollover schemes; - Ignore PKIX TLSA records for email test; - Make X-Frame-Options optional and no longer consider ALLOW-FROM as sufficiently secure. - Bugfixes: - Detect more ciphers that are available only with the modern openssl library; - Better exception handling for untrusted certificate in OCSP check; - Better exception handling for invalid IDNs.

source: article new-release-with-improved-tests-for-TLS-and-CSP date
nl: 15 maart 2021

source: article new-release-with-improved-tests-for-TLS-and-CSP lead
nl: Vanaf vandaag kunt u gebruik maken van een nieuwe versie van Internet.nl met verbeterde testen voor TLS en voor Content Security Policy. Verder zijn er verschillende wijzigingen, zoals verbeterde ondersteuning voor niet-mail domeinnamen en de verlenging van de minimale HSTS cache-geldigheidsduur. Veel plezier met het nog beter testen op moderne internetstandaarden!

source: article new-release-with-improved-tests-for-TLS-and-CSP title
nl: Nieuwe Internet.nl met verbeterde testen voor TLS en CSP

source: article next-major-release-will-use-new-TLS-guidelines body
nl: Op 23 april, heeft het NCSC een nieuwe [ICT-beveiligingsrichtlijn voor TLS](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-transport-layer-security-tls) gepubliceerd (versie 2.0). Platform Internetstandaarden heeft aan de nieuwe versie van de TLS-richtlijnen bijgedragen door feedback te leveren tijdens de review fase. Bij de eerstvolgende grote release zal Internet.nl TLS-verbindingen gaan beoordelen op basis van deze nieuwe richtlijnen. Op dit moment gaat Internet.nl uit van de vorige versie van de ICT-beveiligingsrichtlijnen voor TLS (versie 1.0 uit 2014) en test of TLS-instellingen tenminste de status “Voldoende” hebben. Op basis van de vernieuwde richtlijnen kunnen organisaties hun internetverbindingen goed beveiligen. De geadviseerde instellingen zijn toekomstvast; naar verwachting behoeven TLS-configuraties die op basis van de nieuwe richtlijnen zijn ingesteld de komende tijd weinig tot geen aanpassing. Bovendien zorgen de richtlijnen ervoor dat systemen interoperabel blijven en wordt voorkomen dat TLS-instellingen incompatibel zijn met elkaar. De open standaard TLS vormt de basis voor onder andere HTTPS (beveiligde websiteverbindingen) en STARTTLS (beveiligde mailserver-verbindingen). De update van de TLS-richtlijnen omvat ook TLS versie 1.3 die sinds eind 2018 op de [‘pas toe of leg uit’-lijst](https://www.forumstandaardisatie.nl/open-standaarden/lijst/verplicht?f%5B0%5D=field_standard_domain%3A4) van Forum Standaardisatie staat. Naast de toevoeging van TLS versie 1.3 zijn er in de nieuwe richtlijnen nog wat andere wijzigingen doorgevoerd. Zo krijgen TLS 1.0 en 1.1 de nieuwe status “Uitfaseren”. De Autoriteit Persoonsgegevens heeft [aangegeven](https://autoriteitpersoonsgegevens.nl/nl/nieuws/nieuwe-ict-beveiligingsrichtlijnen-voor-transport-layer-security-tls) dat organisaties die gebruik maken van een ‘uit te faseren’ TLS-configuratie, deze op termijn moeten vervangen omdat er anders mogelijk niet wordt voldaan aan de beveiligingseisen die volgen uit de AVG.

source: article next-major-release-will-use-new-TLS-guidelines date
nl: 2 mei 2019

source: article next-major-release-will-use-new-TLS-guidelines lead
nl: Bij de eerstvolgende grote release zal Internet.nl TLS-verbindingen gaan beoordelen op basis van de nieuwe ICT-beveiligingsrichtlijnen voor TLS (versie 2.0) van het NCSC. Op dit moment gaat Internet.nl uit van de vorige versie van de ICT-beveiligingsrichtlijnen voor TLS (versie 1.0 uit 2014) en test of TLS-instellingen tenminste de status “Voldoende” hebben.

source: article next-major-release-will-use-new-TLS-guidelines title
nl: Volgende grote release van Internet.nl gebruikt nieuwe TLS-richtlijnen

source: article nieuwe-versie-internetnl-met-aanvullingen-https-test body
nl: De meest in het oog springende verbeteringen staan hieronder. 1. De vorige versie van Internet.nl testte de veiligheid van de HTTPS-configuratie over IPv6 óf over IPv4. Omdat we via handmatig testen regelmatig websites tegen zijn gekomen die onbedoeld verschillende HTTPS-configuraties over IPv6 en IPv4 hanteren, wordt vanaf nu de **HTTPS-configuratie zowel over IPV6 als over IPv4** getest. Het resultaat van dit uitgebreide testonderdeel weegt **vanaf nu** mee in de score van de websitetest. 2. Voor websites wordt nu ook getest of er een **HSTS-policy** aanwezig is. HSTS zorgt ervoor dat een webbrowser na het eerste bezoek weet dat een website alleen over HTTPS bezocht mag worden. Hiermee kunnen zogeheten man-in-the-middle-aanvallen (bijvoorbeeld als gebruik wordt gemaakt van een publieke wifi-hotspot) worden voorkomen. Het resultaat van dit nieuwe testonderdeel komt nu bij afwijking terug als oranje waarschuwing en telt nog niet mee in de score van de websitetest. **Vanaf juli 2016** weegt het resultaat wel mee in de score. 3. De website-test controleert nu ook of door websites **HTTPS afgedwongen** wordt. Het afdwingen kan op de twee onderstaande manieren. Het resultaat van dit nieuwe testonderdeel komt bij afwijking terug als oranje waarschuwing en telt nog niet mee in de score van de websitetest. **Vanaf juli 2016** weegt het resultaat wel mee in de score. 1. Door HTTP naar HTTPS te 'redirecten'. Dat kan door `http://example.nl` naar `https://example.nl` te laten verwijzen. Het is belangrijk dat het identieke domeinen zijn omdat een webbrowser alleen een HSTS-policy voor een bepaalde domeinnaam accepteert over een HTTPS-verbinding. Als `http://example.nl` doorverwijst naar `https://www.example.nl` dan zal de HSTS-policy bij normaal gebruik niet voor `example.nl` in de browser worden opgeslagen, tenzij een gebruiker bewust `https://example.nl` intoetst of hierop als link klikt. 2. Door alleen HTTPS en geen HTTP te ondersteunen. Doordat een browser normaal gesproken bij het intoetsen van een domeinnaam een HTTP-verbinding opzet moeten gebruikers bewust `https://example.nl` intoetsen om de website te bereiken of daarop als link klikken. 4. De websitetest controleert in de nieuwe versie of er sprake is van **HTTP-compressie**. Het inschakelen van HTTP-compressie maakt veel websites kwetsbaar voor de BREACH-aanvalstechniek als geen andere mitigerende maatregelen zijn genomen. Het uitschakelen van HTTP-compressie kan een negatieve invloed hebben op de prestaties van het systeem. Indien HTTP-compressie wordt gedetecteerd dan wordt dat vermeld als **oranje waarschuwing** . 5. De websitetest van de vorige versie van Internet.nl controleerde al of de **content van een website gelijk is over IPv6 en IPv4**. Dit testonderdeel hield ook al rekening met kleine terechte verschillen zoals bijvoorbeeld vanwege verschillende advertenties. Het resultaat van dit testonderdeel weegt **vanaf nu** mee in de score van de websitetest. 6. Als een gebruiker een **niet-bestaande domeinnaam** intoetst dan wordt een rode foutmelding gegeven. *** **Meer informatie:** * [ICT-Beveiligingsrichtlijnen voor Webapplicaties van NCSC](https://www.ncsc.nl/actueel/whitepapers/ict-beveiligingsrichtlijnen-voor-webapplicaties.html) * [ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS)](https://www.ncsc.nl/actueel/whitepapers/ict-beveiligingsrichtlijnen-voor-transport-layer-security-tls.html) * [RFC 6797: HTTP Strict Transport Security (HSTS)](https://tools.ietf.org/html/rfc6797) * [Breach Attack](http://breachattack.com/)

source: article nieuwe-versie-internetnl-met-aanvullingen-https-test date
nl: 19 maart 2016

source: article nieuwe-versie-internetnl-met-aanvullingen-https-test lead
nl: Vanaf vandaag staat er een nieuwe versie van [Internet.nl](https://Internet.nl) online. Deze versie bevat verbeteringen en uitbreidingen, met name voor het HTTPS/TLS-onderdeel van de websitetest. Sinds april 2015 hebben bezoekers 80.000 tests uitgevoerd op [Internet.nl](https://Internet.nl). Hopelijk vind je de nieuwe functionaliteit nuttig en blijf je testen en jouw internet verbeteren. Happy testing!!!

source: article nieuwe-versie-internetnl-met-aanvullingen-https-test title
nl: Nieuwe versie Internet.nl met uitgebreidere HTTPS-test
