Repository: internetstandards/Internet.nl
Catalog: translations/*/news.po
Languages: nl

source: article securitytxt-test-toegevoegd body
nl: ## Wat is je meldpunt voor beveiligingslekken? Elke dag kunnen beveiligingsonderzoekers (ook wel goedwillende of ethische hackers) digitale kwetsbaarheden vinden in je website of IT-systemen. Als organisatie wil je het natuurlijk snel weten als zoiets bij jou geconstateerd wordt, zodat je snel kunt reageren en het lek kunt dichten. Nu is het vaak niet duidelijk wáár een beveiligingsonderzoeker de gevonden kwetsbaarheid kan melden. Er gaat daardoor mogelijk kostbare tijd verloren aan het zoeken naar en het bereiken van de juiste afdeling of persoon binnen een organisatie. Sterker nog, het kan zelfs zo zijn dat het goedbedoelde bericht niemand bereikt. ## Sneller gewaarschuwd met security.txt Aangezien kwaadwillenden deze kwetsbaarheden ook op het spoor kunnen komen, mag er geen onnodige tijd verloren gaan om de getroffen organisaties te waarschuwen. Dat deze snelheid belangrijk is, ervaart het [Digital Trust Center](https://www.digitaltrustcenter.nl) (DTC) zelf ook regelmatig bij het waarschuwen van Nederlandse bedrijven. Security.txt kan hierbij helpen. Door als organisatie contactgegevens beschikbaar te stellen via security.txt, kunnen beveiligingsonderzoekers direct de juiste persoon of afdeling waarschuwen. Het DTC adviseert daarom aan ieder bedrijf om een security.txt-bestand te publiceren en dat actueel te houden. ## Internet.nl test op security.txt De aan Internet.nl toegevoegde test voor security.txt is bedoeld als hulpmiddel voor bedrijven en andere organisaties. De test controleert of het security.txt-bestand op de geteste domeinnaam aanwezig is en of de opgenomen informatie het juiste formaat heeft. Gerben Klein Baltink, voorzitter Platform Internetstandaarden: > "Samen met het DTC hebben we eraan gewerkt dat Internet.nl nu ook test op security.txt. Door een eenvoudige toevoeging van dit gestandaardiseerde format aan jouw webdomein is het voor “helpende hackers” makkelijker geworden om de juiste contacten te leggen als zij bij jou een kwetsbaarheid aantreffen. Ik wil daarom organisaties van harte aanmoedigen om een security.txt-bestand te publiceren en via Internet.nl te checken of dit op de juiste manier is gedaan. Zo houden we het internet samen open, vrij en veilig!" Voorlopig heeft de security.txt-standaard binnen Internet.nl de aanbevolen status. De resultaten van de security.txt-test wegen nog niet mee in de totaalscore van het testresultaat. Later dit jaar zal de security.txt-test ook worden toegevoegd aan de API en het dashboard van Internet.nl. [Forum Standaardisatie](https://forumstandaardisatie.nl/) onderzoekt momenteel of de security.txt-standaard geschikt is om te verplichten aan de overheid via plaatsing op de 'pas toe of leg uit'-lijst. ## Meer weten? Heeft jouw bedrijf of organisatie al een security.txt-bestand? Voer je website-URL in op [Internet.nl](https://internet.nl) en je weet het binnen enkele seconden. Benieuwd hoe je eenvoudig een eigen security.txt-bestand maakt? Lees dan verder over [security.txt op de website van DTC](https://www.digitaltrustcenter.nl/securitytxt). ## Over Internet.nl De testtool [Internet.nl](https://internet.nl) is een initiatief van het Platform Internetstandaarden, een samenwerkingsverband van partijen uit de Internetgemeenschap en de Nederlandse overheid. Het doel van het platform is om gezamenlijk het gebruik van moderne internetstandaarden verder te vergroten om daarmee het internet voor iedereen toegankelijker, veiliger en betrouwbaarder te maken. De softwarecode van Internet.nl is online beschikbaar onder een open source licentie. --- ## Release notes 1.6.0 - Add [security.txt support](https://github.com/internetstandards/Internet.nl/pull/730). For all IPs of web servers, this looks for the existence and validity of a [RFC9116](https://www.rfc-editor.org/rfc/rfc9116.html) security.txt file. #### Upgrading to 1.6 from 1.5.x See the [change overview](https://github.com/internetstandards/Internet.nl/blob/main/documentation/Operational%20Changes.md#change-overview-for-version-16) for the steps to upgrade if you have your own deployment of the internet.nl codebase.

source: article securitytxt-test-toegevoegd date
nl: 11 oktober 2022

source: article securitytxt-test-toegevoegd lead
nl: Aan de websitetest op Internet.nl is in samenwerking met het Digital Trust Center (DTC) een nieuw testonderdeel voor security.txt toegevoegd. Security.txt is een gestandaardiseerd tekstbestand met contactinformatie dat je op je webserver plaatst. Beveiligingsonderzoekers kunnen deze informatie gebruiken om direct contact met de juiste afdeling of persoon binnen je organisatie op te nemen over kwetsbaarheden die zij in je website of IT-systemen hebben gevonden. Dit kan het verhelpen van de gevonden kwetsbaarheden versnellen, waardoor kwaadwillenden minder kans krijgen om er misbruik van te maken. Kortom: test je eigen domein en voeg een security.txt-bestand toe!

source: article securitytxt-test-toegevoegd title
nl: Internet.nl voegt test voor security.txt toe

source: article stilstand-is-achteruitgang author
nl: marco-davids

source: article stilstand-is-achteruitgang body
nl: Dat we al in een vroeg stadium het Internet in al zijn facetten hebben omarmd, is iets waar we vandaag de dag volop de vruchten van plukken. Het heeft geleid tot veel kennis en expertise, die tot ver over de landsgrenzen wordt erkend en gewaardeerd. Ons nationale onderzoeksnetwerk SURFnet staat internationaal hoog aangeschreven. De Amsterdam Internet Exchange (AMS-IX) behoort tot de grootste en beste ter wereld. En het is niet zomaar dat organisaties zoals RIPE in Nederland zijn gevestigd of dat ons nationale top-level domein (TLD) .nl een van de meest gevestigde en betrouwbare TLD&#39;s ter wereld is. Nederland heeft het dus goed gedaan. Op de &#39;[Internet Hall of Fame](http://www.internethalloffame.org/inductees/all)&#39; prijken klinkende, Nederlandse namen. Maar minstens zo belangrijk: na Rotterdam en Schiphol resulteerde dit in nog een [derde "mainport"](http://dinl.nl/Digital_Infrastructure_-_Driver_for_the_Online_Ecosystem__2014__v_1_1.pdf) van groot economisch belang: de digitale mainport. Naar schatting staat deze digitale mainport garant voor zo&#39;n 140.000 banen. ## Actie Maar er loert een gevaar: de "wet op de remmende voorsprong". Neem het verouderde, inmiddels te krappe adresseringsschema op Internet. In de ons omringende landen gaat de adoptie van de opvolger daarvan (IPv6) veel voortvarender dan bij ons. Bij onze zuiderburen maakt inmiddels een op elke drie internetters gebruik van IPv6. [Nederland](https://www.google.com/intl/en/ipv6/statistics.html#tab=per-country-ipv6-adoption) steekt daarbij schril af met onze schamele 2,17% (stand per maart 2015). Dat is reden tot zorg en alle aanleiding voor actie. Als early adopter heeft Nederland zich een geweldige &quot;digitale positie&quot; verworven, met alle economische en sociale voordelen van dien. Het behoeft geen betoog dat stilstand op dit gebied achteruitgang betekent. Want nieuwe uitdagingen op het gebied van digitale veiligheid, betrouwbaarheid en schaalbaarheid dienen zich aan en vragen om een oplossing. De internationale [gemeenschap](http://www.arkko.com/tools/allstats/thenetherlands.html) komt ook met die oplossingen, in de vorm van nieuwe protocollen en internetstandaarden. Maar draagvlak creëren voor de adoptie daarvan vormt dikwijls weer een uitdaging op zich. SIDN onderkent dat als geen ander en zet zich in voor een betrouwbaar, modern Internet. De afgelopen jaren hebben we ons sterk gemaakt voor de adoptie van DNSSEC, een beveiligingsstandaard voor het domeinnaamsysteem. En met succes: Inmiddels is meer dan 40% van alle .nl-domeinnamen met DNSSEC ondertekend. Nederland staat daarmee weer stevig op de kaart. Dat is waarom SIDN het Platform Internetstandaarden een warm hart toedraagt en van harte ondersteunt. Wij zijn verheugd dat de andere initiatiefnemers onze visie delen en trekken graag samen met hen op in ons streven naar een veiliger, betrouwbaarder en toekomstgerichter Internet.

source: article stilstand-is-achteruitgang lead
nl: Nederland mag met recht een pionier genoemd worden. Kennelijk zit dat in onze aard. Of het nu gaat om het verkennen van verre wereldzeeën, onze bijdragen aan de wetenschap of om het ontdekken van de ongekende mogelijkheden van het Internet, we hebben beslist een goede naam hoog te houden.

source: article stilstand-is-achteruitgang title
nl: Stilstand is achteruitgang

source: article uitnodiging-masterclass-DMARC body
nl: Tijdens deze masterclass zal de Amerikaan Tim Draegen, die aan de basis stond van DMARC, u bijpraten over de ins en outs van deze beveiligingsstandaard. Masterclass DMARC Datum: dinsdag 21 april Tijdstip: 15 tot 17 uur (met aansluitend een borrel) Locatie: 7AM, Buitenhof 47, Den Haag ## Deelname Deelname is kosteloos. Het aantal deelnemers is beperkt. U kunt zich aanmelden via de [website van ECP](https://ecp.nl/agenda/masterclass-dmarc/).

source: article uitnodiging-masterclass-DMARC lead
nl: Op dinsdag 21 april organiseert het Platform Internetstandaarden een Masterclass over DMARC. Graag nodigen wij u hiervoor uit.

source: article uitnodiging-masterclass-DMARC title
nl: Uitnodiging Masterclass DMARC

source: article website-internet-nl-drukbezocht-na-cybertop body
nl: Het doel van initiatiefnemer Platform Interstandaarden is om het gebruik van moderne en veilige internetstandaarden sneller te laten groeien zodat het Internet betrouwbaarder wordt voor iedereen. In het Platform Internetstandaarden participeren de internetgemeenschap en de Nederlandse overheid. ## Sessie moderne internetstandaarden Internet.nl werd gelanceerd en gedemonstreerd tijdens een goedbezochte GCCS-sessie met veel internationale belangstelling. Melissa Hathaway, voormalig cyber-adviseur voor de regeringen Bush en Obama, en tegenwoordig verbonden aan het Belfer Center for Science and International Affairs van de Harvard Kennedy School, benadrukte het belang van moderne internetstandaarden. Olaf Kolkman, Chief Internet Technology Officer bij ISOC Internationaal, legde uit dat veel van deze standaarden al jaren bestaan maar moeilijk ingevoerd worden. Deelnemers aan het Internet &mdash; wij allemaal! &mdash; moeten leren verder te kijken dan alleen ons eigen stukje. &quot;Internet is een gedeelde infrastructuur. Meedoen brengt een gezamenlijke verantwoordelijkheid met zich mee.&quot; Michiel Leenaars, directeur bij ISOC Nederland en directeur Strategie bij NLnet, nam de demonstratie van de nieuwe website voor zijn rekening. Daarbij sprak hij de ambitie uit om deze portal door te laten groeien naar een internationaal platform. Nu al kunnen bezoekers testen op de moderne internetstandaarden IPv6, DNSSEC, TLS, DKIM, SPF en DMARC. Deze mogelijkheden zullen in de toekomst worden uitgebreid met nieuwe tests en nieuwe functionaliteit. Gerben Klein Baltink, voormalig directeur van TNO Defensie en Veiligheid en voormalig secretaris van de Nederlandse Cyber Security Raad, is kwartiermaker voor het Platform Internetstandaarden en voortrekker voor Internet.nl. ## Website druk bezocht In de korte periode tussen de lancering gisteren aan het eind van de dag en vanochtend tien uur werd de Internet.nl site al druk bezocht. Er werden meer dan 1000 unieke webdomeinen, 340 unieke mail-domeinen en 540 verbindingen getest. Bij elkaar ging het in deze korte tijd al om 5000 unieke bezoekers. ![introduction at GCCS 2015 conference - Olaf Kolkman](/static/article/website-internet-nl-drukbezocht-na-cybertop/GCCS2015-OlafKolkman-600x399.jpg)

source: article website-internet-nl-drukbezocht-na-cybertop date
nl: 17 april 2015

source: article website-internet-nl-drukbezocht-na-cybertop lead
nl: De website Internet.nl is gisteren op de internationale Cybertop in Den Haag gelanceerd. Op Internet.nl kunnen bezoekers hun internet-verbinding, webserver en mail-domein testen op het gebruik van moderne internetstandaarden. De website werd na de lancering gelijk al veel gebruikt. In een halve dag waren er meer dan 5000 unieke bezoekers.

source: article website-internet-nl-drukbezocht-na-cybertop title
nl: Website Internet.nl drukbezocht na Cybertop

source: article x-xss-protection-removed-and-improvement-for-no-mx-domains body
nl: ## X-XSS-Protection test verwijderd We hebben besloten om de test voor X-XSS-Protection te verwijderen. De meeste browsers hebben [ondersteuning voor X-XSS-Protection laten vervallen](https://caniuse.com/#feat=mdn-http_headers_x-xss-protection) waardoor het in de praktijk nog maar zeer beperkte beveiligingswaarde heeft. Bovendien kunnen browser-implementaties kwetsbaar zijn voor zogenaamde [cross-site leak attacks](https://www.chromium.org/developers/design-documents/xss-auditor). We adviseren website-eigenaren om met behulp van Content-Security-Policy (CSP) unsafe-inline scripts te blokkeren in plaats van X-XSS-Protection te gebruiken. ## No MX configured Als er geen mailserver (MX) is geconfigureerd of wanneer we een zogenaamd 'Null MX' record detecteren dan zijn bepaalde testen niet van toepassing. Vanaf nu toont Internet.nl blauwe info-iconen (in plaats van oranje waarschuwingen) voor deze testresultaten en zijn de bijbehorende resultaatteksten passender gemaakt. Zoals eerder ook al het geval was, is er geen impact op de score. Het is dus prima om geen MX geconfigureerd te hebben, zolang je je er bewust van bent en je de andere relevante standaarden (zoals DMARC) wel hebt ingesteld. We adviseren om 'Null MX' (RFC 7505) te gebruiken voor een domein zonder mailserver. Op die manier maakt het domein expliciet dat het geen e-mail accepteert. Merk op dat de test niet terugvalt op A/AAAA-records voor mailservers als een MX-record afwezig is. ## Over Internet.nl De testtool Internet.nl is een initiatief van het **Platform Internetstandaarden**, een samenwerkingsverband van partijen uit de Internetgemeenschap en de Nederlandse overheid. Het doel van het platform is om gezamenlijk het gebruik van moderne internetstandaarden verder te vergroten om daarmee het internet voor iedereen toegankelijker, veiliger en betrouwbaarder te maken. ECP biedt de administratieve basis voor het platform. De technische realisatie van Internet.nl is in handen van Open Netlabs / NLnet Labs. --- ## Release notes - New: - Remove test for X-XSS-Protection - No MX configured: informational status/icons and more suitable category verdict - Bugfixes: - Fix breaking bug when the cert chain could not be received - Fix breaking bug for DANE-TA - Make sure to pick and test the same mailservers when the number of configured mailservers is greater than the allowed one - Mailservers without STARTTLS support give wrong verdict - Make sure only one SMTP connection is active at a time - Fix IPv6 connectivity for nameservers - Fix uncaught exception when decrypting HTTPS data - Fix for connecting to either IPv4 or IPv6 for the mail test

source: article x-xss-protection-removed-and-improvement-for-no-mx-domains date
nl: 13 juli 2020

source: article x-xss-protection-removed-and-improvement-for-no-mx-domains lead
nl: Vanaf vandaag is er een nieuwe versie van Internet.nl beschikbaar die een aantal kleine verbeteringen en bugfixes bevat. Alhoewel het geen grote verandering is, hopen we dat je er plezier aan beleeft. Veel succes met testen en verbeteren op het vlak van moderne internetstandaarden!

source: article x-xss-protection-removed-and-improvement-for-no-mx-domains title
nl: Nieuwe versie Internet.nl: X-XSS-Protection verwijderd en verbetering voor geen-MX-domeinen

source: author erik-huizer bio
nl: Erik Huizer is technisch directeur bij SURFnet, het netwerk voor hoger onderwijs en onderzoek. Daarnaast is hij ook deeltijd-hoogleraar &quot;Internet toepassingen&quot; bij de afdeling Media- en Cultuurwetenschappen van de Universiteit Utrecht. Voorheen was hij algemeen directeur van TNO Informatiemaatschappij. Huizer is lid van het Topteam Creatieve Industrie en van het bestuur van ECP.nl. Daarnaast is hij Chairman of the Board van Enset, een Amerikaanse non-profit start-up gericht op het online brengen van NGO&#39;s over de hele wereld. In 2014 werd hij vanwege zijn eerdere verdiensten bij de introductie van Internet in Nederland en de verdere internationale ontwikkeling van Internet opgenomen in de Internet Hall of Fame van de Internet Society. Huizer houdt zich momenteel vooral bezig met ICT in onderwijs en onderzoek, Internet Governance, Privacy en Security, en Internet als creatief medium.

source: author erik-huizer name
nl: Erik Huizer

source: author gerben-klein-baltink bio
nl: Gerben Klein Baltink is werkzaam als ondernemer, zowel op het gebied van digitale veiligheid (MKB Cyber Advies Nederland) als op het gebied van moderne technologie (Trefecta Mobility). Zijn grote passie is het leggen van verbindingen tussen verschillende mensen, organisaties en disciplines. Als kwartiermaker voor het Platform Internetstandaarden probeert hij nut en noodzaak van de geselecteerde standaarden bij een breed publiek duidelijk te maken.

source: author gerben-klein-baltink name
nl: Gerben Klein Baltink

source: author marco-davids bio
nl: Marco Davids is Technisch Adviseur bij SIDN, de beheerder van het .nl-domein. Hij doet onderzoek naar en geeft advies over technologische ontwikkelingen en concepten, zodat technische verbeteringen en vernieuwingen tot stand komen. Het gaat dan in het bijzonder om de relevantie, de mogelijkheden voor "new business" en de impact op de processen en systemen van SIDN. Samen met de andere Technisch Adviseurs behartigt hij de belangen van SIDN en de lokale internetgemeenschap in, onder andere, de IETF en RIPE community.

source: author marco-davids name
nl: Marco Davids

source: author olaf-kolkman bio
nl: Olaf Kolkman is de Chief Internet Technology Officer (CITO) van ISOC internationaal. Hij is verantwoordelijk voor de "Strategic Technical"-activiteiten, met name voor wat betreft problemen en kansen bij de verdere evolutie van het Internet.

source: author olaf-kolkman name
nl: Olaf Kolkman
