Repository: internetstandards/Internet.nl
Catalog: translations/*/news.po
Languages: nl

source: article onderhouds-en-bugfixrelease-van-internet-nl body
nl: ## Sneller, stabieler en accurater De verbeteringen maken Internet.nl stabieler en sneller. Bovendien kunnen andere ontwikkelaars de Internet.nl-software eenvoudiger zelf installeren of code bijdragen aan het project. Tot slot is er een klein aantal inhoudelijke wijzigingen en bugfixes geïmplementeerd waardoor de testen en begeleidende teksten accurater zijn. ## Over Internet.nl De testtool Internet.nl is een initiatief van het Platform Internetstandaarden, een samenwerkingsverband van partijen uit de Internetgemeenschap en de Nederlandse overheid. Het doel van het platform is om gezamenlijk het gebruik van moderne internetstandaarden verder te vergroten om daarmee het internet voor iedereen toegankelijker, veiliger en betrouwbaarder te maken. De softwarecode van Internet.nl is online beschikbaar onder een open source licentie. --- ## Release notes 1.4.0 Software update and development & documentation release. New - Mention LinkedIn next to Twitter in footer [(#496)] - Add security.txt based on https://securitytxt.org/ [(#493)] Changes - Improve description of the ipv4-ipv6 comparison results and what may be a reason for the differences [(#540)] - Refer to https://dutchcloudcommunity.nl/ on https://internet.nl/about/ [(#589)] - Check for max of 10 DNS lookups in SPF test [(#286)] - System administrators can disable/enable categories of tests (for example, only run IPv6 tests) - Files from the /static/ directory are now cached by the client for one day by default (instead of none) Bugfixes - Fix some minor typos and broken link [(#574)] [(#575)] - Add a missing ' in the frame-ancestors explanation [(#578)] - An empty part of Content Security Policy gives an error [(#583)] - Recursion error when stripping nonces in IPv4 and IPv6 comparison [(#587)] - Remove certificate from the certificate chain in the shipped cert chain file [(#614)] Dependencies - Update Django version to latest LTS version, together with dependencies [(#486)] - Update version of Celery to the latest LTS version, together with dependencies [(#586)] - Updated jQuery (also stops support for very old browsers) [(#565)] - Pinned all dependencies on specific versions with pip-tools. Settings - Moved Django settings to an environment file, so it can be more easily configured in automated environments (containers) - Made a clear distinction between user confgured settings and 'standard app settings' - Add DEFAULT_AUTO_FIELD to default config file [(#599)] - Increased the test duration 50%-100% for all tests on single mode, to deal with slow servers or servers that have a lot of MX records. - Made the rate limiting feature of starting new scans configurable in the settings (not via environment) Migrations - Administrative movements of models to a new subproject (checks). Development & documentation - Added installation steps to makefile for easier installation of the virtual environment and custom python dependencies - Added Github action that checks for code linting and runs tests. More QA tools to come. - Added various tests and moved the existing tests to be run in pytest. Coverage today: 32% - Added a partial admin web interface that is available during development, to more easily inspect the contents of the database - Added an ERD diagram image of the database to the documentation - Removed infinite wait on Unbound pipe, to reduce complexity in the connection leakage issue (see ahead) - Added example and usable configuration examples for Redis, workers, services, Apache etc - Added a logger with dictconfig, this allows run time logging of the application - Added (debug) log statements for further code inspection, especially on expiring tasks - Separate scanning code from UI code via a new django app "checks" - Added workaround / configs for Redis-backend-connection leak [(#676)] on single scan mode. Cron settings and some bash scripts that restart the scan services every 6 hours. This allows tens of thousands of scans per recycle. - Spread out tasks over more dedicated workers to be able to inspect and manage bottlenecks - Fixed Django-app bootstrapping, which prevented the app from loading correctly - Building and testing for Python 3.7 and 3.10 to transit to the new version - Added caching of static files in the apache config - Simplified and deduplicated the apache config

source: article onderhouds-en-bugfixrelease-van-internet-nl date
nl: 4 april 2022

source: article onderhouds-en-bugfixrelease-van-internet-nl lead
nl: Vanaf vandaag kunt u gebruik maken van een nieuwe, verbeterde versie van Internet.nl. In deze nieuwe versie is de onderliggende, hergebruikte software geüpgraded. Ook zijn er verbeteringen aan de documentatie en softwarecode doorgevoerd.

source: article onderhouds-en-bugfixrelease-van-internet-nl title
nl: Onderhouds- en bugfixrelease van Internet.nl

source: article open-source-release body
nl: ## Open source De software-broncode van Internet.nl is op [Github](https://github.com/NLnetLabs/Internet.nl) gepubliceerd onder een een Apache Licentie, versie 2.0. Internet.nl is mede mogelijk gemaakt door andere open source software te gebruiken en te combineren. De belangrijkste open source bouwstenen van Interrnet.nl zijn Python 3, Django, PostgreSQL, Celery, Redis, RabbitMQ, nassl, unbound/libunbound and Postfix. Zie de [auteursrechtpagina](/copyright) voor meer informatie. ## Test voor applicatie-beveiligingsopties De website test heeft een nieuwe testcategorie voor [applicatie-beveiligingsopties](/faqs/appsecpriv/) . Deze instellingen kunnen worden verzonden naar de browser via HTTP-headers en worden vaak 'security headers' genoemd. De nieuwe categorie bevat testen voor X-Frame-Options, X-Content-Type-Options, X-XSS-Protection, Content-Security-Policy and Referrer-Policy. Voor de laatste twee controleren we alleen de aanwezigheid, maar we beoordelen nog niet de effectiviteit van het ingestelde beleid. Momenteel wegen de resultaten van deze nieuwe testen nog niet mee in de totaalscore. ## Over Internet.nl De testtool Internet.nl is een initiatief van het Platform Internetstandaarden, samenwerkingsverband van partners uit de internetcommunity en Nederlandse overheid. De missie van het platform is om gezamenlijk het gebruik van moderne internetstandaarden te stimuleren zodat het internet voor iedereen veilig en toegankelijk blijft. ECP biedt de administratieve basis voor het platform. De technische realisatie en implmentatie van Internet.nl is in handen van NLnet Labs. --- ## Release notes - New features: - New "Security Options" for the website test to check security HTTP headers; - Changes: - DMARC verification now uses Mozilla's public suffix list for finding the organizational domain; - DMARC validation now gives a warning if rua/ruf is not valid; - Added link to test explanation on connection results; - New way of showing verdict for failed categories; - Bug fixes: - Fixed DMARC external report addresses and validation when multiple URIs; - Ignore MX records that include 'localhost'; - Home page statistics numbers sometimes weren't adding up; - Several content improvements.

source: article open-source-release date
nl: 21 februari 2019

source: article open-source-release lead
nl: Vanaf vandaag is de broncode van Internet.nl beschikbaar onder een opensource-licentie. Dit maakt het mogelijk voor iedereen om de werking te verifiëren en om een eigen lokale versie te draaien. Bovendien hebben we een nieuwe testcategorie voor applicatie-beveiligingsopties oftewel security headers toegevoegd.

source: article open-source-release title
nl: Open source vrijgave Internet.nl inclusief 'security headers'

source: article paneldiscussie-the-power-of-internet-standards body
nl: Ons dagelijks leven is onlosmakelijk verbonden met het functioneren van technologieën als het internet en mobiele netwerken. Deze technologieën werken samen, wat voor een groot deel is toe schrijven aan de onderliggende technische standaarden. Net als andere technologieën, zijn **standaarden niet neutraal**. Standaarden representeren de waarden van hun maker. Ze kunnen bijvoorbeeld zijn ontworpen om controle te decentraliseren of te centraliseren. Of om openheid te bevorderen of censuur en surveillance toe te staan. Naast technische argumenten, zien we dat **commerciële en geopolitieke belangen** een rol zijn gaan spelen in het standaardisatieproces. DNS over HTTPS (DoH) en New IP zijn hiervan goede voorbeelden. Dit kan een probleem en een risico worden voor de evolutie van het internet. Hoe houden we een **open, vrij en veilig internet** in stand, welke rol spelen overheden hierin en zijn we als Nederland of als Europese Unie voldoende gepositioneerd om onze rol in het internationale standaardisatieproces te spelen? Deze vragen gaan we onderzoeken in een paneldiscussie met onderzoekers, experts en beleidsmakers. ## Het panel Panelleden **Marietje Schaake** van Stanford University, **Olivier Bringer** van de Europese Commissie, **Marco Hogewoning** van het RIPE NCC en **Niels ten Oever** van de Universiteit van Amsterdam delen hun perspectieven. **Gerben Klein Baltink**, voorzitter van het Platform Internetstandaarden, modereert de discussie. Het publiek wordt uitgenodigd om deel te nemen aan de discussie door mogelijke oplossingsrichtingen aan te dragen of vragen te stellen. ## Aanmelden Houd **26 en 27 oktober** vrij in uw agenda en meldt u alvast aan! Het volledige programma en registratieformulier vindt u op [de website van het NCSC](https://www.ncsc.nl/onderwerpen/onderzoekssymposium). Deelname is kosteloos.

source: article paneldiscussie-the-power-of-internet-standards date
nl: 4 oktober 2021

source: article paneldiscussie-the-power-of-internet-standards lead
nl: Op 26 en 27 oktober presenteert het NCSC het symposium “Let’s do Cybersecurity Research Together”. Dit symposium draait om het verbinden van multidisciplinair academisch en toegepast onderzoek(ers) met de professionals die dagelijks bezig zijn met het voorkomen en afhandelen van cybersecurity incidenten. Op 27 oktober organiseert Platform Internetstandaarden een paneldiscussie over “The Power of Internet Standards”. U kunt zich hier nu voor inschrijven.

source: article paneldiscussie-the-power-of-internet-standards title
nl: Paneldiscussie: The Power of Internet Standards

source: article release-1.7 body
nl: ## Verbeterde CSP-test In de testresultaten voor Content-Security-Policy (CSP) zijn specifieke foutmeldingen toegevoegd aan de technische details. Dit maakt het voor gebruikers duidelijker wat er niet goed is aan hun CSP-beleid en stelt hen in staat hun beleid veiliger te maken. Verder controleert de CSP-test nu ook op veilige configuratie van de directives voor `base-uri` en `form-action`. Volgens de CSP-specificatie worden beide directives niet afgedekt door het fallback-beleid van `default-src` en is het dus van belang om ze expliciet te configureren. ## Security.txt- en TLS-test verbeteringen Voor de security.txt-test zijn Nederlandse vertalingen toegevoegd, is de validatie-bibliotheek bijgewerkt, en zijn er verschillende bugfixes gedaan. Verder kunnen gebruikers in de test voor TLS-versie nu alle gedetecteerde TLS-versies zien. Dus, indien gedetecteerd, worden nu ook TLS-versie 1.2 en 1.3 met respectievelijk een 'voldoende' en 'goed' beveiligingsniveau getoond in de technische tabel van de test voor TLS-versie. ## Over Internet.nl De testtool [Internet.nl](https://internet.nl) is een initiatief van het Platform Internetstandaarden, een samenwerkingsverband van partijen uit de Internetgemeenschap en de Nederlandse overheid. Het doel van het platform is om gezamenlijk het gebruik van moderne internetstandaarden verder te vergroten om daarmee het internet voor iedereen toegankelijker, veiliger en betrouwbaarder te maken. De softwarecode van Internet.nl is online beschikbaar onder een open source licentie. --- ## Release notes 1.7.0 - Added specific [error messages in the technical details](https://github.com/internetstandards/Internet.nl/issues/577) for Content-Security-Policy results. - Added requirements for [base-uri](https://github.com/internetstandards/Internet.nl/issues/525) and [form-action](https://github.com/internetstandards/Internet.nl/issues/524) to the Content-Security-Policy test. - Added translations for [security.txt error messages](https://github.com/internetstandards/Internet.nl/issues/774). - The TLS versions tech table [now shows the detected TLS versions](https://github.com/internetstandards/Internet.nl/issues/512) instead of only TLS versions with issues. - Fixed an [uncaught exception](https://github.com/internetstandards/Internet.nl/issues/494) in the security.txt text which could cause the entire test to fail for some HTTP responses. - Corrected handling of [bogus TLSA records](https://github.com/internetstandards/Internet.nl/issues/681). - A bare "https:" is [no longer allowed in Content-Security-Policy](https://github.com/internetstandards/Internet.nl/pull/925) as it matches any HTTPS host. - [Loosened requirement for null MX](https://github.com/internetstandards/Internet.nl/issues/748) when a domain has no A or AAAA. - Fixed an issue where the [frame-src test was inconsistent with the documentation](https://github.com/internetstandards/Internet.nl/issues/643). - [Added the version number](https://github.com/internetstandards/Internet.nl/issues/494) to the footer. - [Added Sentry support](https://github.com/internetstandards/Internet.nl/issues/770) for error reporting. - Code quality was cleaned up in various places. - Dependencies were updated. - New content for extended tests and several other content improvements. This release has API version 2.3.0: - The `record_org_domain` was added for DMARC ([#489](https://github.com/internetstandards/Internet.nl/issues/489)). - The `securitytxt_errors` and `securitytxt_recommendations` types were changed. They now contain error codes (and possibly context) rather than full sentences. - The `content_security_policy_errors` field was added with error codes for CSP. - An issue was fixed where the `mx_nameservers` field was not included in results ([#882](https://github.com/internetstandards/Internet.nl/issues/882)).

source: article release-1.7 date
nl: 11 april 2023

source: article release-1.7 lead
nl: Vanaf vandaag kan je een nieuwe versie van Internet.nl gebruiken met een verbeterde test voor Content-Security-Policy en voor security.txt. Daarnaast zijn er diverse andere verbeteringen aangebracht, waaronder bugfixes, opruiming van code, updates van gebruikte externe softwarebibliotheken, en content-verbeteringen.

source: article release-1.7 title
nl: Verbeterde testen voor CSP en security.txt op Internet.nl
