Repository: internetstandards/Internet.nl
Catalog: translations/*/news.po
Languages: nl

source: article report-IPv6-meeting body
nl: ## IPv6, een modern protocol met veel adresruimte IPv6 is de laatste versie van het Internet Protocol, dat ervoor zorgt dat alle apparaten die met het internet zijn verbonden, ook bereikbaar zijn. IPv4, de voorganger van IPv6, is inmiddels meer dan 40 jaar oud en technisch achterhaald. Bovendien is de beschikbare adresruimte van IPv4 uitgeput. IPv6-adressen zijn kosteloos beschikbaar, terwijl voor de schaarser wordende IPv4-adressen steeds meer moet worden betaald. Dit zorgt voor een toetredingsdrempel voor nieuwe (innovatieve) dienstaanbieders. Denk aan een nieuwe internetaanbieder, die om te beginnen veel IPv4-adressen nodig heeft. IPv6 kan naast IPv4 worden gebruikt en gaat uiteindelijk IPv4 volledig vervangen. Inmiddels ondersteunt bijna alle apparatuur zowel IPv4 als IPv6. Beide versies zijn echter niet compatibel met elkaar. Organisaties die IPv6 niet installeren, zijn in de toekomst niet bereikbaar voor gebruikers die via IPv6 contact zoeken. ## Adoptie van IPv6 in Nederland vergelijkbaar met wereldwijde gemiddelde APNIC Labs, de onderzoeksafdeling van de Regional Internet Registry (RIR) voor de Asia-Pacific (APAC) regio, [meet wereldwijd het IPv6-gebruik aan clientzijde](https://stats.labs.apnic.net/ipv6). Volgens de cijfers van APNIC Labs, is de adoptie van IPv6 wereldwijd op dit moment 30%. De adoptie in Nederland is 33%, ongeveer gelijk aan het wereldwijde gemiddelde. In West-Europa is de adoptie gemiddeld 45%. Nederland doet het dus zeker niet slecht, maar loopt ook zeker niet voorop in Europa. Metingen van SIDN met betrekking tot de serverzijde laten een vergelijkbaar beeld zien. Het percentage .nl-domeinen waarvan de webserver of de mailserver (met bijbehorende nameservers) via IPv6 bereikbaar zijn, blijft sinds 2020 hangen tussen 34% en 36%. Terwijl het gebruik van IPv6 wereldwijd langzaam, maar gestaag toeneemt, lijkt de groei van IPv6 bij .nl al enkele jaren te stagneren. ## Nederlandse overheid: veel progressie maar nog niet volledig op IPv6 bereikbaar De Nederlandse overheid heeft het gebruik van IPv6 voor zichzelf verplicht gesteld. Sinds 2010 staat IPv6 op de ‘Pas toe of leg uit’-lijst van Forum Standaardisatie. Dit betekent dat bij inkoop van ICT-systemen en -diensten boven € 50.000,- organisaties verplicht zijn te vragen naar toepassing van IPv6 (indien relevant). Aanvullend heeft het Overheidsbreed Beleidsoverleg Digitale Overheid (OBDO) de ‘streefbeeldafspraak’ gemaakt dat alle overheidswebsites en e-maildomeinen van de overheid voor het einde van 2021, naast IPv4, volledig bereikbaar moeten zijn via IPv6. Forum Standaardisatie onderzoekt ieder half jaar het gebruik van verplichte standaarden voor de beveiliging van websites en e-mail bij overheidsorganisaties. In die meting wordt ook de adoptie van IPv6 meegenomen. Voor de herhaaldelijk gemeten set met 559 kerndomeinnamen van de overheid, is het beeld nu dat ruim 89% van de websites en 61% van de e-mailservers bereikbaar zijn via IPv6. In maart 2019 was dat nog respectievelijk 48% en 17%. De streefbeeldafspraak van het OBDO, die betrekking heeft op alle domeinen van de overheid en niet alleen op de eerdergenoemde kerndomeinen, is niet gehaald. In vergelijking met andere landen in Europa, neemt de Nederlandse overheid inmiddels wel een vooraanstaande positie in qua IPv6-adoptie. Dit laat zien dat afspraken maken, meten en rapporteren helpt. De kerndomeinen doen het ook beter dan andere overheidsdomeinen, die niet structureel worden gemeten en waarover niet structureel wordt gerapporteerd. Voor al die andere overheidsdomeinen is dus zeker nog werk aan de winkel! IPv6TeamOverheidNL heeft de afgelopen jaren een groot aantal overheidsorganisaties geholpen om hun externe bereikbaarheid via IPv6 te realiseren. Het team heeft ook metingen uitgevoerd met behulp van [Internet.nl](https://internet.nl). In de laatste metingen zijn ruim 20.000 bekende web- en e-maildomeinen van de overheid meegenomen. Volgens de cijfers van IPv6TeamOverheidNL was in februari van alle actieve webdomeinen van de overheid 36% via IPv6 bereikbaar en van alle actieve e-maildomeinen van de overheid 85% via IPv6 bereikbaar. ## Grote internet access providers zijn onderweg; mobiel blijft aandachtspunt Om landelijk echt een verschil te maken, moeten de grote access providers overstappen op IPv6. En dat gebeurt. De twee grootste access providers in Nederland, KPN en VodafoneZiggo, hebben de afgelopen twee jaar grote stappen gezet. KPN onderschrijft het belang van de transitie naar IPv6 en is al geruime tijd geleden gestart met een programma om IPv6 te introduceren in haar internettoegangsdiensten. Inmiddels zijn alle internettoegangsdiensten aangepast en kunnen alle klanten, zowel bij vast als mobiel, gebruikmaken van IPv6. Ook een groot deel van de websites van KPN is toegankelijk gemaakt voor IPv6. KPN blijft werken aan de transitie naar IPv6 voor haar overige diensten en denkt graag mee over vormgeving en stimulering van de IPv6-transitie binnen Nederland. VodafoneZiggo heeft ook het traject ingezet om IPv6 in te voeren. Het doel hierbij is ‘dual-stack’: ondersteuning van zowel IPv4 als IPv6. VodafoneZiggo hoopt dit voor het einde van het jaar overal aan te bieden. Op dit moment zit 65% van haar klanten voor vast internet ook op IPv6. Mobiel blijft iets achter en kan nog wel een zetje gebruiken. Veel kleinere partijen moeten echter nog beginnen. Eén van de uitzonderingen hierop, is nieuwkomer Freedom Internet. Freedom Internet zet in op statische IPv4-adressen en dual-stack. Voor haar is ondersteuning van moderne internetstandaarden onderdeel van de waardepropositie. Op dit moment kan 71% van haar klanten op de toegangsdiensten ook gebruikmaken van IPv6. ## Hosters moeten in beweging komen Een andere groep aanbieders die de overstap naar IPv6 moeten maken, zijn de hosters. Er zijn hosters die dual-stack bereikbaarheid zien als logisch onderdeel van de dienstverlening en dit standaard bieden zonder enige extra kosten. Andere hosters bieden IPv6-geschiktheid tegen betaling en op verzoek. Helaas is de vraag van klanten hiernaar niet zo groot. En er zijn hosters die alleen maar IPv4 bieden. Een hoster met de ambitie om IPv6 standaard aan te hebben staan, is Total Webhosting Solutions (TWS). TWS vindt het belangrijk dat klanten haar diensten kunnen gebruiken op een modern en veilig internet. Om die reden heeft IPv6, naast DNSSEC en TLS, een hoge prioriteit op haar agenda's. Alle infrastructuur die TWS bouwt, is al volledig voorzien van IPv6 en ze is druk bezig om overal waar het nog niet aan staat, dit zo spoedig mogelijk te implementeren. In de [Hall of Fame voor Hosters op Internet.nl](https://internet.nl/halloffame/hosters/) kunnen klanten zien welke hosters up-to-date zijn qua toepassing van IPv6 en andere moderne internet- en e-mailstandaarden. ## Implementatie van IPv6 niet zonder uitdagingen De IPv6 Task Force en later het Platform Internetstandaarden hebben Nederland in samenwerking met de community stap voor stap in beweging gekregen richting IPv6. Het is deze coalities van overheid en bedrijfsleven echter nog lang niet gelukt om de adoptie van IPv6 naar 100% te brengen. Daarvoor zijn uiteenlopende redenen te geven. Een veelgehoorde reden is dat klanten niet vragen om IPv6-ondersteuning en dat implementatie van IPv6 daarom geen prioriteit krijgt. Klanten willen een werkende dienst. Het is een verantwoordelijkheid van de leverancier om daarvoor te zorgen, nu en in de toekomst. Als je IPv6 niet installeert, is je dienst in de toekomst mogelijk niet bereikbaar voor gebruikers die via IPv6 contact zoeken. Het bovenstaande speelt zeker in de zakelijke markt, waar de situatie complexer is dan in de consumentenmarkt. De implementatie van IPv6 door een leverancier kan bijvoorbeeld betekenen dat een ondernemer zijn eigen verouderde systemen, die nog geen IPv6 ondersteunen, moet vervangen. Vanuit de zakelijke markt is er nauwelijks vraag naar IPv6. Daar zou beweging in moeten komen. Met de aanwezige access providers is afgesproken om te zoeken naar manieren om de vraag vanuit de zakelijke markt te stimuleren. Het ontbreekt grotere organisaties vaak aan een centrale domeinregistratie. Het is lang niet altijd bekend bij wie een website of e-maildomein in beheer is. Een model dat navolging verdient, is dat van de Dienst Publiek en Communicatie (DPC), onderdeel van het ministerie van Algemene Zaken. DPC registreert en beheert de domeinnamen van de Rijksoverheid in het Domeinnaamregister. De volledige lijst met websites van de Rijksoverheid (een deelverzameling van het Domeinnaamregister) wordt gepubliceerd als Websiteregister en wordt maandelijks geactualiseerd. Wat de implementatie van IPv6 verder bemoeilijkt, is dat het in beroepsopleidingen niet altijd aan bod komt. Daar wordt nog vaak IPv4 onderwezen. Scholen en andere onderwijsinstellingen die worden gefinancierd door de overheid, zouden toch eigenlijk het goede voorbeeld moeten geven? ## IPv6 straks wettelijk verplicht? Volgens de aangenomen tekst van “De EU-strategie inzake cyberbeveiliging voor het digitale tijdperk”, wil de Europese Commissie de toepassing van essentiële internetstandaarden, waaronder IPv6, versnellen, eventueel door middel van regelgevingsmaatregelen, indien er onvoldoende vooruitgang wordt gemaakt met de toepassing van de desbetreffende standaarden. Als mogelijke maatregel wordt een Europese uitdovingsclausule (‘sunset clause’) voor IPv4 genoemd, om de markt aan te sturen. In Nederland heeft Forum Standaardisatie het ministerie van Binnenlandse Zaken en Koninkrijksrelaties geadviseerd om te verkennen of een verplichting voor IPv6-ondersteuning voor website- en e-mailverkeer van de overheid kan worden gecreëerd via een algemene maatregel van bestuur (AMvB) op grond van de Wet digitale overheid (Wdo). Misschien dat regelgeving uiteindelijk toch voor de doorbraak moet zorgen. ## Kom in beweging! Wil Nederland tot de digitale koplopers blijven behoren en eventuele regelgeving voor zijn, dan zullen de achterblijvers in beweging moeten komen. Voor internetproviders en grote organisaties die zelf hun IPv6-adresblokken beheren (de zogenaamde LIR's, Local Internet Registries), is er RIPE NCC. RIPE NCC kent IPv6-adresblokken toe en biedt met de [RIPE NCC Academy](https://academy.ripe.net/) verschillende online IPv6-cursussen. De cursussen zijn gratis, aan de examens zijn kosten verbonden. In het kader van een pilot van RIPE NCC met Logius, Forum Standaardisatie en de VNG om IPv6-kennis op te bouwen bij de centrale en lokale overheid, hebben ongeveer 100 medewerkers van de Nederlandse overheid (waaronder gemeente Apeldoorn, gemeente Rotterdam, VNG, DICTU, SSC-ICT en NCSC) kosteloos deelgenomen aan de cursussen “IPv6 Fundamentals” en “IPv6 security”. Afgesproken is dat in 2022 in ieder geval nog 50 medewerkers van de overheid kunnen deelnemen aan deze cursussen. Overheidsorganisaties die stappen willen zetten, kunnen hiervoor tot 31 maart 2022 terecht bij IPv6TeamOverheidNL en daarna bij Forum Standaardisatie. De handreikingen, podcasts en overige informatie van IPv6TeamOverheidNL blijven beschikbaar op de [website van Forum Standaardisatie](https://forumstandaardisatie.nl/ipv6). Voor registrars heeft SIDN in 2017 een IPv6-incentiveregeling ingesteld. Om het kantelpunt voor een investering in IPv6 dichterbij te brengen, heeft SIDN het incentivebedrag de afgelopen jaren twee keer verhoogd. De huidige incentive is € 0,10 per domeinnaam per halfjaar. De SIDN Academy biedt registrars een (gratis) IPv6-e-learningmodule en workshops om de theorie in praktijk te brengen. Wil je zelf weten of jouw website, e-mail en internetverbinding IPv6 gebruiken? En, als dat niet zo is, wat je daaraan kunt doen? Ga dan naar [Internet.nl](https://internet.nl), waar je eenvoudig kunt testen of je internet up-to-date is.

source: article report-IPv6-meeting date
nl: 24 maart 2022

source: article report-IPv6-meeting lead
nl: Op 17 februari kwam Platform Internetstandaarden bijeen om te spreken over de adoptie van IPv6. Ook de voormalige IPv6 Task Force en de IPv6-TF-mailinglist-abonnees waren uitgenodigd. Onder voorzitterschap van Gerben Klein Baltink en aan de hand van presentaties van achtereenvolgens RIPE NCC, SIDN, Forum Standaardisatie, IPv6TeamOverheidNL, Total Webhosting Solutions (TWS), KPN en VodafoneZiggo, gingen ruim 30 deelnemers met elkaar in gesprek. Cijfers, ambities, plannen, activiteiten, ervaringen en uitdagingen, het kwam allemaal aan bod. De inmiddels volwassen technologie en inspanningen van de deelnemers ten spijt, stagneert de groei van IPv6-gebruik in Nederland en blijft het nodig om aandacht te houden voor verdere adoptie. Met de aanwezige internet access providers is afgesproken om te zoeken naar manieren om de vraag vanuit de zakelijke markt te stimuleren.

source: article report-IPv6-meeting title
nl: Platform Internetstandaarden: "Aandacht voor verdere adoptie IPv6 blijft hard nodig!"

source: article rol-IPv6-task-force-ondergebracht-bij-platform-internetstandaarden body
nl: De jaren daarna werden specifieke doelgroepen (zoals corporates, MKB, rijksoverheid en gemeentes) benaderd met voorlichting, trainingen en workshops. De laatste jaren is de aandacht verlegd naar de grote Internet Service Providers (met name Ziggo en KPN) om zo ook de particuliere markt mee te krijgen. Op elk van deze fronten is vooruitgang geboekt. Wellicht niet zo snel als gehoopt, maar wel gestaag. KPN en Ziggo zijn nu nagenoeg gereed voor IPv6, en dus komt de komende tijd IPv6 beschikbaar voor alle klanten van deze twee grote providers. Klanten van providers als XS4ALL hebben al jaren IPv6. Andere kleinere Internet Service Providers volgen hopelijk snel. De overheid heeft een overheidsbreed IPv6-nummerplan en daarmee een basis waarop ook IPv6 bij de overheid nu gestaag wordt ingevoerd. Een recent onderzoek van de Europese Commissie laat zien dat de Nederlandse overheid voorop loopt qua invoering t.o.v. nagenoeg alle andere EU-landen. Voor gemeenten heeft VNG acties in gang gezet en is er duidelijk beweging zichtbaar. Kortom, bijna iedereen is zich bewust van het belang van IPv6, zowel in het publieke als het private domein, en waar nodig zijn projecten onderweg die de invoering van IPv6 gaan borgen. Daarmee komt de taak van de Tastforce IPv6 langzamerhand ten einde. We zijn er nog lang niet, maar er zijn genoeg resultaten bereikt om de noodzaak voor een aparte IPv6 Task Force ter discussie te stellen. Om die reden is besloten de IPv6 Task Force na 13 jaar op te heffen. De resterende taken qua stimulering passen uitstekend bij het Platform Internetstandaarden. Dit platform heeft als missie het gebruik van moderne internet standaarden zoals HTTPS, DNSSEC, DMARC en uiteraard ook IPv6 te stimuleren. Met de inzet van de tool [Internet.nl](https://internet.nl) worden publieke en private partijen geholpen het internet betrouwbaarder te maken. Voorzitter Gerben Klein Baltink van het Platform Internetstandaarden: > "De IPv6 Task Force heeft onder de bezielende leiding van Erik Huizer Nederland stap-voor-stap in beweging gekregen richting IPv6. Veel dank aan alle leden van de IPv6 Task Force, voorzitter Erik Huizer en het ministerie van Economische Zaken en Klimaat voor de inzet, tijd en energie die zij de afgelopen jaren hebben gestoken in het waarmaken van IPv6 in Nederland. IPv6 is van vitaal belang voor verdere groei en toegankelijkheid van internet. Vanuit Platform Internetstandaarden zullen we daarom in samenwerking met experts, bedrijven en de overheid IPv6 actief blijven promoten en de voortgang in Nederland blijven monitoren." ![IPv6 presentatie](/static/article/rol-IPv6-task-force-ondergebracht-bij-platform-internetstandaarden/ipv6-task-force.jpg) --- * [De e-maildiscussielijst van de IPv6 Task Force zal in stand blijven](https://lists.ams-ix.net/mailman/listinfo/ipv6-tf) * [Zie ook "So long... and thanks for all the IPv6?"](https://labs.ripe.net/Members/marco_hogewoning/so-long-and-thanks-for-all-the-ipv6) * [oude website "ipv6-taskforce.nl" op Internet Archive](https://web.archive.org/web/20190109111838/http://new.ipv6-taskforce.nl/) * [IPv6 pagina op internet.nl](https://www.internet.nl/faqs/ipv6/)

source: article rol-IPv6-task-force-ondergebracht-bij-platform-internetstandaarden date
nl: 6 juni 2018

source: article rol-IPv6-task-force-ondergebracht-bij-platform-internetstandaarden lead
nl: De in april 2005 in opdracht van het ministerie van Economische Zaken opgerichte IPv6 Task Force had als doel de bekendheid van IPv6 in Nederland te vergroten en kennisuitwisseling te bevorderen. Deelname aan de IPv6 Task Force stond vanaf het begin voor iedereen open. Onder andere SURFnet, SIDN, AMS-IX, ISOC en RIPE NCC waren partners van het eerste uur. In de beginjaren lag de focus vooral op het vergroten van de bewustwording over het belang van IPv6 via onder meer communicatie-uitingen en het organiseren van evenementen.

source: article rol-IPv6-task-force-ondergebracht-bij-platform-internetstandaarden title
nl: Rol IPv6 Task Force ondergebracht bij Platform Internetstandaarden

source: article rpki-test-toegevoegd body
nl: ## Route-lekken en -hijacks Resource Public Key Infrastructure (RPKI) is een techniek met als doel om bepaalde route-lekken en -hijacks te voorkomen. Het gaat om gevallen waarbij internetverkeer wordt omgeleid naar de systemen van een niet-geautoriseerd netwerk. Een dergelijke omleiding kan het gevolg zijn van een simpele typefout van een netwerkbeheerder die daarmee onbedoeld internetverkeer omleidt, of het gevolg zijn van een doelgerichte aanval op de infrastructuur van het internet om bijvoorbeeld websites onbereikbaar te maken of om gegevens van internetgebruikers afhandig te maken. Een relevant Nederlands voorbeeld hiervan betreft een incident waarbij een set IP-adressen van het ministerie van Buitenlandse Zaken in 2014 [tijdelijk gekaapt](https://zoek.officielebekendmakingen.nl/ah-tk-20142015-3181.html) is door een Bulgaarse netwerkbeheerder. ## Werking van RPKI Met RPKI kan de rechtmatige houder van een blok IP-adressen een digitaal getekende verklaring publiceren met betrekking tot de intenties van de routering vanaf zijn netwerk. Deze verklaringen, genaamd Route Origin Authorisations (ROA’s), kunnen andere netwerkbeheerders cryptografisch valideren en vervolgens gebruiken om filters in te stellen. Hiermee filteren routers routes uit die in strijd zijn met de voor de betreffende IP-adressen gepubliceerde ROA’s (invalid = reject). RPKI vraagt dus om actie vanuit twee partijen. Ten eerste moet de houder van de IP-adressen ROA’s publiceren. Ten tweede moet de partij die via Border Gateway Protocol (BGP) routes ontvangt van andere netwerken filteren op basis van alle wereldwijd gepubliceerde ROA’s, waarbij invalide routes nooit geaccepteerd of geadverteerd mogen worden. ## RPKI-test in Internet.nl De nieuwe RPKI-test is onderdeel van de [websitetest](/test-site/) en van de [e-mailtest](/test-mail/). Alle gevonden IP-adressen die horen bij de webserver, mailservers en nameservers van een domein worden getest. Eerst wordt per IP-adres gecontroleerd of er tenminste één ROA is gepubliceerd. Vervolgens checkt de test of de route-aankondiging van ieder IP-adres wordt gematcht door de eventueel gevonden ROA. Voorlopig wegen de resultaten van de RPKI-test nog niet mee in de totaalscore van het testresultaat. Vanaf begin 2023 zal dat wel het geval zijn. Later dit jaar zal de RPKI-test ook worden toegevoegd aan de API en het dashboard van Internet.nl. Speciale dank gaat uit naar NCSC-NL dat een groot deel van de nieuwe RPKI-test heeft ontwikkeld en, in overeenstemming met staand [overheidsbeleid ](https://zoek.officielebekendmakingen.nl/kst-26643-676.html)("open, tenzij"), als open source beschikbaar heeft gesteld. Daarij werd intensief samengewerkt met de kernontwikkelaars van Internet.nl die voor Platform Internetstandaarden werken. Het fundament van de nieuwe RPKI-test wordt gevormd door [Routinator](https://www.nlnetlabs.nl/projects/rpki/routinator/), open source RPKI Relying Party software die wordt ontwikkeld door NLnet Labs. ## Aanvullende maatregelen Naast RPKI zijn er andere, aanvullende technieken die internetroutering veiliger maken. Het [MANRS](https://www.manrs.org/)-initiatief geeft een overzicht van 'best practices' die wij aanbevelen om ook te implementeren. ## Over Internet.nl De testtool [Internet.nl](https://internet.nl) is een initiatief van het Platform Internetstandaarden, een samenwerkingsverband van partijen uit de Internetgemeenschap en de Nederlandse overheid. Het doel van het platform is om gezamenlijk het gebruik van moderne internetstandaarden verder te vergroten om daarmee het internet voor iedereen toegankelijker, veiliger en betrouwbaarder te maken. De softwarecode van Internet.nl is online beschikbaar onder een open source licentie. --- ## Release notes 1.5.0 #### New - RPKI support [(#613)]. For all IPs of all name servers, mail servers and web server, this check looks for the existence of an RPKI ROA, and whether all BGP routes covering these IPs are valid. As this is a new check, the total score does not yet include RPKI results. #### Other changes - Fixed issues with the IPv4/IPv6 consistency test for large pages [(#665)] - Various dependencies updated [(#721)] [(#725)] [(#695)] [(#688)] [(#712)] - Internal documentation improvements [(#717)] - Small improvements in cache reset requests [(#724)] - Small improvements in various test explanations. - The privacy statement was updated to clarify the use of third party services. #### Upgrading to 1.5 from 1.4.x See the [change overview](https://github.com/internetstandards/Internet.nl/blob/main/documentation/Operational%20Changes.md#change-overview-for-version-15=) for the steps to upgrade if you have your own deployment of the internet.nl codebase.

source: article rpki-test-toegevoegd date
nl: 31 augustus 2022

source: article rpki-test-toegevoegd lead
nl: Vanaf vandaag kan je met Internet.nl testen of jouw website en mailvoorziening worden beschermd door RPKI. Door toepassing van deze moderne internetstandaard zul je minder snel last hebben van onbedoelde of kwaadwillige internetrouteringsfouten. Fouten die bijvoorbeeld kunnen leiden tot onbereikbaarheid van je website en mailvoorziening. Veel plezier met testen en, zo nodig, succes met verbeteren!

source: article rpki-test-toegevoegd title
nl: Nieuwe release van Internet.nl met RPKI-test
