Repository: internetstandards/Internet.nl
Catalog: translations/*/news.po
Languages: nl

source: article internet-draait-om-samenwerking body
nl: De basis onder deze samenwerking wordt gevormd door een aantal open standaarden en werkwijzen die door alle betrokken netwerkbeheerders vrijwillig zijn overgenomen. Vrijwillige overname is trouwens ook een van de belangrijkste punten van de [&#39;Open Stand&#39;-principes](https://open-stand.org/infographic-the-5-core-principles-of-openstand/). ## Meedoen Als je je met het Internet verbindt wordt je onderdeel van dat ecosysteem. Sterker nog, op Internet is er geen duidelijk onderscheid tussen consumenten en leveranciers; elke deelnemer is iemand die bijdraagt. Daar is wel een gezamenlijke verantwoordelijkheid aan verbonden: je moet niet alleen nadenken over de vraag hoe dat wereldwijde systeem jou beïnvloedt, maar ook hoe de dingen die je doet en nalaat weer invloed hebben op dat systeem. Deze manier van kijken is met name van belang als het gaat over veiligheid. Voor een eindgebruiker betekent dit dat hij alles doet om zijn eigen systemen veilig te houden, maar ook om het risico te verkleinen dat hij overgenomen en misbruikt wordt door anderen. Voor dienstverleners betekent dit dat zij bepaalde veiligheidsmaatregelen implementeren. Die diensten en maatregelen leveren misschien niet direct rendement op, en kunnen op de korte termijn zelfs tot extra kosten leiden. Maar zij helpen om het veiligheidsniveau van het systeem omhoog te brengen en het vertrouwen in het Internet te versterken. En daar zit &#39;m gelijk het probleem: er is geen direct economisch belang voor individuele providers om sommige van deze technologieën toe te passen. Kunnen we de implementatie daarvan dan niet afdwingen? In theorie wel, maar die aanpak zou tegen een van de fundamentele en oorspronkelijke principes van het Internet ingaan: als een organisch systeem, een netwerk van zelfstandige netwerken, niet ontwikkeld vanaf een ontwerpplan maar afhankelijk vanuit lokale behoeften en randvoorwaarden, is de toepassing afhankelijk van vrijwillige deelname en samenwerking. Het afdwingen van veiligheid en schaalbaarheid door wereldwijde mandaten op te leggen kan te langzaam zijn en onbedoelde bijwerkingen hebben. De vrijwillige, gezamenlijke aanpak, gecombineerd met een doorlopende dialoog met degenen die bepaalde maatregelen invoeren en anderen die daar weer door beïnvloed worden &mdash; de eindgebruikers, beleidsmakers en technici &mdash; levert uiteindelijk meer flexibiliteit en wendbaarheid op. Eenmaal genomen maatregelen kunnen bovendien makkelijker worden aangepast om onbedoelde negatieve bijwerkingen te minimaliseren. ## &quot;De Internet-manier&quot; Het wereldwijd doorvoeren van veilige, robuuste, toekomstbestendige internettechnologieën kan beter gedaan worden op &quot;de Internet-manier&quot;: op initiatief van individuele partijen, gebaseerd op hun beslissingen en hun eigen voortrekkersrol; en door het delen van kennis en ervaring, zowel op vrijwillige als professionele basis. Belangrijke aspecten bij de invoering van innovaties zijn bewustzijn en zichtbaarheid. Het doorvoeren van deze internettechnologieën is als het installeren van nieuwe waterleidingen: er is iets verbeterd, maar het water smaakt nog steeds hetzelfde. Voortrekkers die hun collega&#39;s willen aanmoedigen hen te volgen zullen moeten laten zien wat die innovaties opleveren. Een belangrijk initiatief is het Internet.nl-project dat binnenkort gelanceerd wordt. Daarbij hebben de Nederlandse Internet-gemeenschap, een ministerie en een overheidsorganisatie gezamenlijk een website opgezet die de huidige status van invoering van belangrijke internettechnologieën laat zien. De website geeft gebruikers eenvoudige en directe informatie over hun eigen toegang tot innovatieve technologieën. Sommige van deze technologieën dragen bij aan de verdere schaalbaarheid van het Internet (IPv6-ondersteuning en de transparantie van het netwerk), terwijl andere de veiligheid verhogen (DNSSEC, anti-spam en anti-virus, en de ondersteuning van encryptie). Op die manier helpt deze site om open standaarden te bevorderen die het Internet veiliger en schaalbaarder maken. Het laat zien wie de voortrekkers zijn, en het biedt gereedschap en kennis aan de volgers.

source: article internet-draait-om-samenwerking lead
nl: Het wereldwijde Internet is een netwerk van netwerken, bij elkaar gehouden door een geest van samenwerking. Informatie die over het Internet reist kan door een meerdere netwerken lopen, waarbij het netwerk waar de reis begon waarschijnlijk geen formele relatie heeft met het netwerk waar de informatie uiteindelijk terecht komt. Dat dit werkt heeft te maken met samenwerking, zowel bij het uitwisselen en transporteren van verkeer van andere netwerken, als wanneer het gaat om het oplossen van problemen die mogelijk verschillende stappen eerder veroorzaakt werden.

source: article internet-draait-om-samenwerking title
nl: Internet draait om samenwerking

source: article internetnl-checks-strictness-anti-mail-spoofing-standards body
nl: Sinds het redesign van Internet.nl in de zomer van 2017, is het aantal bezoekers dat testen uitvoert enorm toegenomen. Bezoekers voerden dit jaar tot juli rond de 100.000 testen uit. In de tweede helft van het jaar, dat wil zeggen na het redesign, zijn er ongeveer 650 duizend uitgevoerde testen bijgekomen. Gerben Klein Baltink, voorzitter van Platform Internetstandaarden: > "De groei is prachtig maar klaar is modern internet helaas nog niet. We zien gelukkig wel ook een sterk groeiend aantal domeinen met een 100%-score die in onze Hall of Fame staan. Tegelijkertijd zijn er nog teveel domeinen die niet of niet helemaal voldoen aan moderne internetstandaarden. Blijf daarom testen, leren en vragen om moderne internet!". ## Controle op policy voor DMARC en SPF Deze nieuwe versie van Internet.nl controleert nu ook of de syntax van je DMARC- en SPF-record geldig is. Bovendien controleert de testtool of deze records een voldoende strikte policy bevatten om misbruik van je domein door phishers en spammers tegen te gaan. ## Controle op geldigheidsduur voor HSTS Daarnaast controleert de nieuwe versie van Internet.nl nu ook de geldigheidsduur van de HSTS-policy. Een HSTS-geldigheidsduur van tenminste zes maanden achten we voldoende veilig. Een lange geldigheidsduur heeft als voordeel dat ook infrequente bezoekers beschermd zijn. Het nadeel is dat wanneer je wil stoppen met HTTPS, je langer moet wachten totdat de geldigheid van de HSTS-policy in alle browsers die je website bezochten, is verlopen. ## Impact op testscore De DMARC-/SPF-policy en de HSTS-geldigheidsduur tellen voorlopig nog niet mee in de procentuele totaalscore. Afwijkingen worden als oranje waarschuwingen weergegeven in de testresultaten. Vanaf **april 2018** wegen de resultaten van deze testonderdelen wel mee in de score. --- ## Release notes: - New: DMARC and SPF record parsers to check the record's syntax and policy strictness; - New: Check if HSTS 'max-age' value is at least 6 months; - Various UI/webdesign fixes/improvements; - Bugfixes: - DANE test is split into 'existence' and 'validity' tests. Previously, failed requests for the TLSA record resulted in an invalid result; - DNSSEC-signed domains signed with algorithms that our validating resolver currently does not support are now reported as DNSSEC-signed but insecure.

source: article internetnl-checks-strictness-anti-mail-spoofing-standards date
nl: 9 januari 2018

source: article internetnl-checks-strictness-anti-mail-spoofing-standards lead
nl: Vandaag lanceert Platform Internetstandaarden een verbeterde versie van de testtool Internet.nl waarmee gebruikers in 2017 meer dan 750 duizend testen uitvoerden. Vanaf nu controleert de testtool niet alleen of standaarden tegen mailspoofing op een domeinnaam aanwezig zijn, maar ook of ze voldoende strikt zijn ingesteld zodat misbruik van een domein echt wordt tegengegaan.

source: article internetnl-checks-strictness-anti-mail-spoofing-standards title
nl: Internet.nl controleert nu ook striktheid anti-mailspoofing-standaarden

source: article internetnl-vernieuwd-hsts-en-afgedwongen-https-tellen-mee body
nl: De onderstaande verbeteringen zijn doorgevoerd op Internet.nl. ## Generiek * De mogelijkheid om voor een andere taal te kiezen via een dropdown-menu. Bezoekers krijgen dan de equivalente pagina in de gekozen taal (als die beschikbaar is). * De eis dat alle nameservers via IPv6 beschikbaar moeten zijn is komen te vervallen. Het is voldoende als er tenminste evenveel nameservers via IPv6 als via IPv4 beschikbaar zijn. Dit geldt voor de webite- én de mailtest. ## Verbindingtest * De detectie van een internetprovider is nauwkeuriger en heeft minder vaak time-outs. ## Websitetest * De test checkt of er een HSTS-policy aanwezig is. Door HSTS 'weet' een webbrowser na het eerste bezoek dat een website alleen via een beveiligde verbinding (HTTPS en niet HTTP) bezocht mag worden. Dit kan zogeheten man-in-the-middle-aanvallen voorkomen, zoals bij het gebruik van publieke WiFi. Bij afwijkingen is de melding niet langer 'oranje' maar 'rood'. * In de test telt nu mee of de website HTTPS afdwingt door een server redirect (301 of 302) of door alleen HTTPS (en geen HTTP) toe te passen. Bij afwijkingen is de melding niet langer 'oranje' maar 'rood'. * De TLS-resultaten gaven bij een aantal sites onterecht de melding dat 'client-initiated renegotiation' was toegestaan. Dit is opgelost. * Bij websites met een redirect van IPv6/IPv4 naar IPv4-only werd de HSTS-policy over IPv6 onterecht niet gedetecteerd. Dit is opgelost. * De test controleert nu of er daadwerkelijk HTTP-verkeer over poort 443 gaat. Als dat niet het geval is, trekt de test niet langer onterechte HTTPS-gerelateerde conclusies. ## Mailtest * Als Internet.nl (o.a. door 'rate limiting') geen verbinding kan opzetten met een mailserver, dan krijgen bezoekers nu de suggestie het later nog eens te proberen. * Dankzij het beter afstellen van timeouts voor het testonderdeel STARTTLS, faalt de test minder snel en kunnen bepaalde mailservers nu ook zonder probleem getest worden. * Het serieel uitvoeren en minimaliseren van het aantal connecties moet helpen om het risico op 'rate limiting' van mailservers te verminderen. Daardoor kunnen bepaalde mailservers nu ook getest worden waarvoor dat eerder onmogelijk was. ## Achtergrondinformatie * [ICT-beveiligingsrichtlijnen voor webapplicaties van NCSC - Verdieping](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) onder '05 Versleutel communicatie' op p.29; * [ICT-beveiligingsrichtlijnen voor TLS van NCSC](https://www.ncsc.nl/actueel/nieuws/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1).

source: article internetnl-vernieuwd-hsts-en-afgedwongen-https-tellen-mee date
nl: 27 juni 2016

source: article internetnl-vernieuwd-hsts-en-afgedwongen-https-tellen-mee lead
nl: Vandaag (27 juni 2016) lanceert Platform Internetstandaarden een nieuwe versie van de website [Internet.nl](/). Vanaf nu tellen 'HSTS' en 'afgedwongen HTTPS' mee in de score van de websitetest. Dit werd al bij de [vorige release](/article/nieuwe-versie-internetnl-met-aanvullingen-https- test/) aangekondigd. Naast deze wijziging bevat de nieuwe versie van [Internet.nl](/) diverse verbeteringen die het testen sneller en stabieler maken.

source: article internetnl-vernieuwd-hsts-en-afgedwongen-https-tellen-mee title
nl: Internet.nl vernieuwd: 'HSTS' en 'afgedwongen HTTPS' tellen mee

source: article introducing-new-TLS-guidelines body
nl: ## TLS in Internet.nl De testtool [Internet.nl](https://internet.nl) controleert TLS-configuraties voor websites onder de testcategorie 'HTTPS' en voor mailservers onder de testcategorie 'STARTTLS en DANE'. De laatste ICT-beveiligingsrichtlijnen voor TLS van NCSC vormen daarvoor het uitgangspunt. Als een 'goede' of 'voldoende' instelling wordt gedetecteerd dan toont Internet.nl een groen vinkje ('geslaagd'). In geval van een 'uit te faseren' instelling, zoals TLS 1.0 en 1.1, zie je een oranje uitroepteken ('waarschuwing'), en bij een 'onnvoldoende' configuratie een rood kruis ('gezakt'). ## ICT-beveiligingsrichtlijnen voor TLS In april 2019 heeft NCSC de ['ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.0'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-transport-layer-security-tls) gepubliceerd. De door NCSC geadviseerde instellingen zijn toekomstvast; naar verwachting behoeven TLS-configuraties die op basis van de nieuwe richtlijnen zijn ingesteld de komende tijd weinig tot geen aanpassing. Bovendien zorgen de richtlijnen ervoor dat systemen interoperabel blijven en wordt voorkomen dat TLS-instellingen incompatibel zijn met elkaar. ## 'Uit te faseren' TLS-instellingen Over 'uit te faseren' instellingen is bekend dat deze fragiel zijn en het risico lopen in de toekomst onvoldoende veilig te worden. Neem het volgende in overweging bij het nemen van een besluit over de 'uit te faseren' instellingen. Browsermakers hebben aangekondigd dat ze in het eerste kwartaal van 2020 zullen stoppen met de ondersteuning van TLS 1.1 en 1.0. Daardoor zullen websites die geen TLS1.2 en/of 1.3 ondersteunen onbereikbaar worden. Behoorlijk wat mailservers ondersteunen alleen oudere TLS-versies. Als de verzendende en ontvangende mailserver niet allebei dezelfde TLS-versie ondersteunen, dan zullen ze doorgaans terugvallen op onversleuteld transport. Om die reden kan het raadzaam zijn om de TLS-versies met status 'uit te faseren' voorlopig te blijven ondersteunen. Maak op basis van loggegevens een weloverwogen keuze voor het uitzetten van deze 'uit te faseren' TLS-versies. ## Over Internet.nl De testtool Internet.nl is een initiatief van het **Platform Internetstandaarden**, een samenwerkingsverband van partijen uit de Internetgemeenschap en de Nederlandse overheid. Het doel van het platform is om gezamenlijk het gebruik van moderne internetstandaarden verder te vergroten om daarmee het internet voor iedereen toegankelijker, veiliger en betrouwbaarder te maken. ECP biedt de administratieve basis voor het platform. De technische realisatie van Internet.nl is in handen van Open Netlabs / NLnet Labs. --- ## Release notes - Various UI/webdesign fixes/improvements - New: - Updated TLS tests to conform to the new v2 NCSC guidelines - TLS1.3 is supported in the TLS tests - Improved Hall of Fame which adds mail tests and champions - Widget for starting the website and email test from other websites - Bugfixes: - Connection test: DNSSEC no longer defaults to secure when the bogus url is not visited and none of the others tests could be performed. It falls back to not tested instead

source: article introducing-new-TLS-guidelines date
nl: 9 december 2019

source: article introducing-new-TLS-guidelines lead
nl: Vanaf vandaag kan je met Internet.nl testen of jouw website en mail voldoen aan de laatst nieuwe 'ICT-beveiligingsrichtlijnen voor TLS' van NCSC. Dit betekent ook dat TLS 1.3 nu ondersteund wordt in de website- en mail-test.

source: article introducing-new-TLS-guidelines title
nl: Nieuwe TLS-richtlijnen geland in Internet.nl

source: article ipv6-vergt-de-medewerking-van-iedereen-in-de-wereld author
nl: erik-huizer

source: article ipv6-vergt-de-medewerking-van-iedereen-in-de-wereld body
nl: ## Bindende factor Het Internet Protocol (IP) is de bindende factor die alle internetgebruikers ter wereld in staat stelt met elkaar te communiceren. IP dateert uit de jaren zeventig van de vorige eeuw en biedt ruimte aan vier miljard IP-adressen voor op Internet aangesloten apparatuur. Dat was destijds ruim voldoende &mdash; de PC was nog niet eens uitgevonden! &mdash; maar met een toenemend aantal toestellen dat met het Internet verbonden wordt &mdash; laptops, smartphones en zelfs huishoudelijke apparatuur &mdash; neemt de behoefte aan IP-adressen toe. Daarbij komt de opkomst van Internet in regio&#39;s als China, India en Afrika met hun miljarden inwoners. Door deze ontwikkelingen is er inmiddels een groot tekort aan IP-adressen. Internet-adressen zijn dus schaars goed geworden. Op het moment dat de IPv4-adressen opraken, kunnen bestaande internetgebruikers (vooral dus de Westerse wereld) gewoon doorgaan met internetten. Google en Facebook blijven bereikbaar en e-mail blijft werken. Maar men zal niet meer iedereen en elke dienst kunnen bereiken. Want elders in de wereld zullen nieuwe ondernemers en nieuwe gebruikers niet de beschikking hebben over IPv4-adressen. Langzaamaan zal het Internet zoals we dat nu kennen daarmee verdwijnen. De economische en maatschappelijke rol van het Internet is echter te groot om dat te laten gebeuren. ## Nu u! De internationale groep die het Internet Protocol ontwikkeld, IETF, voorzag het opraken van de IPv4-adressen al geruime tijd geleden. Vandaar dat er begin jaren &#39;90 een nieuwe versie van het Internet Protocol werd ontwikkeld: IP versie 6. IPv6 lijkt erg veel op de huidige versie, IPv4, maar dan met een veel grotere adresruimte: 2 tot de macht 128 adressen, hetgeen in praktijk nagenoeg oneindig veel adressen zijn. Zaken die nu reeds beschikbaar zijn als toevoeging aan het bestaande IPv4 protocol, zoals beveiliging (IPsec), mobiliteit en automatische adresconfiguratie zijn bovendien in het IPv6-protocol ingebouwd. Een verandering in de infrastructuur van het Internet, zoals de introductie van IPv6 naast het bestaande IPv4, kost tijd en vergt de medewerking van iedereen in de wereld. Gebruikers, bedrijven, ICT-leveranciers en internet service providers moeten allemaal meewerken om IPv6 succesvol te maken. Het Platform Internet Standaarden en SURFnet zetten zich daarvoor in. Nu u nog!

source: article ipv6-vergt-de-medewerking-van-iedereen-in-de-wereld lead
nl: Een open, toegankelijk en betrouwbaar Internet is inmiddels een onmisbaar onderdeel van onze maatschappij en onze economie. Om de ontwikkeling van Internet in die rol blijvend mogelijk te maken is het toepassen van open internetstandaarden absolute noodzaak. SURFnet maakt zich daar dan ook sterk voor &mdash; bijvoorbeeld voor de IPv6-standaard.

source: article ipv6-vergt-de-medewerking-van-iedereen-in-de-wereld title
nl: IPv6 vergt de medewerking van iedereen in de wereld

source: article lancering-internet-nl-tijdens-cyber-week-2015 body
nl: Het Internet is van ons allemaal en wordt dagelijks intensief gebruikt door ondernemers, overheden en burgers. Voor heel veel gebruikers is het Internet niet meer weg te denken. Toch is met name het technische deel van Internet voor de meeste gebruikers volledig onzichtbaar en onbekend. Mede daardoor worden moderne, veilige standaarden vaak laat of helemaal niet geïmplementeerd. In dat kader is het Platform Internetstandaarden opgericht en wordt de website Internet.nl gelanceerd. ## Internet.nl Via Internet.nl kunnen internetgebruikers op eenvoudige en op geheel geautomatiseerde wijze checken of hun internetverbinding, e-mail en website voldoen aan moderne, veilige internetstandaarden. Als één of meerdere standaarden niet up-to-date zijn, dan krijgt de bezoeker advies over wat hij/zij kan verbeteren. In eerste instantie gaat het om de volgende zes standaarden: - IPv6: een uitgebreide, moderne reeks internetadressen - DNSSEC: beveiliging van domeinnamen - TLS: beveiligde verbindingen - DKIM, SPF en DMARC: anti-phishing en anti-spoofing De huidige website is de eerste publieksversie. Het platform streeft ernaar de website blijvend te verbeteren en uit te breiden. Feedback is uiteraard welkom. ## Platform Internetstandaarden Het doel van het Platform Internetstandaarden is om het gebruik van moderne en veilige internetstandaarden sneller te laten groeien zodat het Internet betrouwbaarder wordt voor iedereen. In het Platform Internetstandaarden participeren de volgende organisaties: Dutch Hosting Provider Association (DHPA), ECP, Forum Standaardisatie, Internet Society internationaal, Internet Society Nederland, Ministerie van Economische Zaken, Nationaal Cyber Security Centrum (NCSC), NLnet, RIPE NCC, SIDN en SURFnet. De technische realisatie van Internet.nl is in handen van NLnet Labs.

source: article lancering-internet-nl-tijdens-cyber-week-2015 date
nl: 15 april 2015

source: article lancering-internet-nl-tijdens-cyber-week-2015 lead
nl: Tijdens de Cyber Week 2015 is de website Internet.nl gelanceerd door het Platform Internetstandaarden, een samenwerkingsverband met partijen uit de internetgemeenschap en de Nederlandse overheid. Op deze website kunnen bezoekers eenvoudig checken of hun internet up-to-date is. Gebruiken jouw internetverbinding, e-mail en website wel moderne, veilige internetstandaarden? En als dat niet zo is, wat kan je daaraan doen?

source: article lancering-internet-nl-tijdens-cyber-week-2015 title
nl: Lancering Internet.nl tijdens Cyber Week 2015
