Repository: internetstandards/Internet.nl
Catalog: translations/*/news.po
Languages: nl

source: article .index
nl: release-1.7 UA-day-2023 securitytxt-test-toegevoegd rpki-test-toegevoegd onderhouds-en-bugfixrelease-van-internet-nl report-IPv6-meeting paneldiscussie-the-power-of-internet-standards new-release-with-improved-tests-for-TLS-and-CSP hall-of-fame-for-hosters x-xss-protection-removed-and-improvement-for-no-mx-domains introducing-new-TLS-guidelines next-major-release-will-use-new-TLS-guidelines open-source-release email-test-on-internetnl-extended rol-IPv6-task-force-ondergebracht-bij-platform-internetstandaarden internetnl-checks-strictness-anti-mail-spoofing-standards improved-internetnl-test-for-modern-internet-standards nederland-voor-veilig-emailverkeer mail-over-ipv6-waar-moet-ik-op-letten internetnl-vernieuwd-hsts-en-afgedwongen-https-tellen-mee nieuwe-versie-internetnl-met-aanvullingen-https-test DMARC-masterclass-authenticatie-afzender-noodzaak-geworden website-internet-nl-drukbezocht-na-cybertop lancering-internet-nl-tijdens-cyber-week-2015 uitnodiging-masterclass-DMARC het-internet-is-van-ons-allemaal internet-draait-om-samenwerking ipv6-vergt-de-medewerking-van-iedereen-in-de-wereld stilstand-is-achteruitgang

source: article DMARC-masterclass-authenticatie-afzender-noodzaak-geworden body
nl: Op de masterclass waren meer dan 60 geïnteresseerden afgekomen. De sessie werd geopend door [Gerben Klein Baltink](/article/het-internet-is-van-ons-allemaal/), kwartiermaker voor het Platform Internetstandaarden, die de [Internet.nl portal](https://internet.nl/) aan het publiek demonstreerde. De site werd anderhalve week geleden [tijdens de GCCS Cybertop gelanceerd](/article/website-internet-nl-drukbezocht-na-cybertop/) Er zijn sindsdien ruim 20 duizend tests uitgevoerd. DMARC is een van de zes [standaarden](/standards/) die door het Platform gepromoot worden. ![Demonstratie Internet.nl portal](/static/article/DMARC-masterclass-authenticatie-afzender-noodzaak-geworden/BK-IMAG1620-unsh-cropped-600x468.jpg) ## Authenticatie van de afzender Draegen schetste in zijn sessie het belang van e-mail: mail is meerdere orden groter dan het web en social media. Hoewel het mail-protocol inmiddels meer dan 35 jaar oud is, is de authenticatie van de afzender nog steeds niet geïmplementeerd. Draegen wijt dit aan het moeizame proces waarmee standaarden tot stand komen en uitgerold worden. Specifiek voor authenticatie van de afzender bestaat de oplossing nu uit drie verschillende protocollen: DKIM ondertekent zowel de "envelope" als de inhoud van een bericht. Zo wordt voorkomen dat kwaadwillenden een bericht namens een ander kunnen verzenden (spoofing) of de inhoud van een bericht onderweg kunnen veranderen. SPF publiceert een lijst van geldige verzenders, zodat ontvangende systemen deze kunnen controleren voor zij een bericht aannemen. DMARC geeft tenslotte een aanwijzing (policy) aan ontvangers hoe om te gaan met inkomende berichten waarvan de DKIM- of SPF-controle niet in orde blijkt te zijn. Bovendien kunnen ontvangers terugrapporteren naar de beheerder van een mail-domein. Op die manier krijgt een beheerder inzicht in de berichten die door of namens zijn domein worden verstuurd. ![DKIM, SPF en DMARC](/static/article/DMARC-masterclass-authenticatie-afzender-noodzaak-geworden/TimDraegen-slide19-600x450.png) De dmarcian.com portal is een commerciële dienst die de rapportages van ontvangers tot nette overzichten verwerkt. De werking van afzender-authenticatie werd ook gedemonstreerd door de Gemeente Heerlen en dienstverlener Measuremail. Zij lieten zien hoe geauthenticeerde mail wel aankomt en vervalste mail wordt geblokkeerd voor beveiligde domeinen. ## "Zeer waarschijnlijk echt" De standaarden voor mail-authenticatie zijn op dit moment volwassen en zowel voor commerciële als open source mail-systemen beschikbaar. Draegen hamert dan ook op de invoering van DKIM, SPF en DMARC. De verwerking van binnenkomende mail is namelijk peperduur. Grote mail-verwerkers hebben een hele batterij van systemen staan die elk binnenkomend bericht moeten scannen op phishing, spamming, virussen en andere malware. Tegelijkertijd kan het ten onrechte afwijzen van een echt bericht voor een organisatie grote schade opleveren. Authenticatie van de afzender helpt de ontvangende systemen om binnenkomende mail gelijk als "zeer waarschijnlijk echt" te kwalificeren. Er staat immers een elektronische handtekening onder (DKIM) en/of het verzendende systeem is geauthenticeerd (SPF). ![Tim Draegen over DMARC](/static/article/DMARC-masterclass-authenticatie-afzender-noodzaak-geworden/BK-IMAG1622-unsh-cropped-600x468.jpg) Het huidige systeem, waarbij verzendende systemen op basis van hun internet-adres als betrouwbaar of onbetrouwbaar worden bestempeld, is bovendien niet houdbaar in een wereld die nu naar IPv6 beweegt, een van de andere internetstandaarden die door het Platform gepromoot wordt. Waar IPv4 "slechts" vier miljard internet-adressen ondersteunt, zijn dat er voor IPv6 "oneindig veel". Lijsten bijhouden is daarmee praktisch onmogelijk geworden. Dat betekent dat we sowieso naar een systeem moeten waarbij niet de reputatie van het versturende IP-adres van belang is maar die van het mail-domein van de afzender. En dat maakt authenticatie van de afzender onderdeel van de merkstrategie en -betrouwbaarheid van een organisatie. Draegen vat het belang van DKIM, SPF en DMARC als volgt samen: "Als je geen DMARC doet, dan concurreer je met de slechterikken om er zelf niet als een slechterik uit te zien. Waarom zou je?" ## Presentaties - [State of DMARC](/static/article/DMARC-masterclass-authenticatie-afzender-noodzaak-geworden/3_DMARC_NL.pdf), door Tim Draegen - [Measuremail en dmarcian](/static/article/DMARC-masterclass-authenticatie-afzender-noodzaak-geworden/4_DMARC_masterclass_april_2015.pdf) - [End user awareness of security](/static/article/DMARC-masterclass-authenticatie-afzender-noodzaak-geworden/internet.nl-NL_2.pdf), door Gerben Klein Baltink

source: article DMARC-masterclass-authenticatie-afzender-noodzaak-geworden date
nl: 28 april 2015

source: article DMARC-masterclass-authenticatie-afzender-noodzaak-geworden lead
nl: Afgelopen dinsdag organiseerde het Platform Internetstandaarden een [DMARC masterclass](/article/uitnodiging-masterclass-DMARC/). De hoofdspreker was Tim Draegen, een van de bedenkers van de DMARC-standaard en mede-oprichter van [dmarcian.com](https://dmarcian.com/). Hij betoogde dat de invoering van DKIM, SPF en DMARC niet alleen nuttig is maar inmiddels ook noodzaak is geworden.

source: article DMARC-masterclass-authenticatie-afzender-noodzaak-geworden title
nl: DMARC masterclass: authenticatie afzender is noodzaak

source: article UA-day-2023 body
nl: UA gaat over nieuwe TLD's (die bijvoorbeeld meer dan 2 of 3 karakters hebben zoals .amsterdam), maar ook over domeinnamen en emailadressen met niet-latijnse karakters (zoals `straße.de`, `example.ελ` of `überhaupt@example.nl`). Platform Internetstandaarden organiseert op 28 maart een open dialoog bijeenkomst over UA met deelnemers van onder andere ICANN, SIDN, en Rijksdienst voor Identiteitsgegevens. Het doel is om meer zicht te krijgen op de problematiek en daarnaast op mogelijke oplossingen en acties. "Universele acceptatie is een fundament voor een echt wereldwijd, meertalig internet", aldus Sally Costerton, interim-president en CEO van ICANN. "De allereerste Universal Acceptance Day zal helpen dit tot bloei te brengen door bewustzijn van UA te creëren en de tools te bieden die nodig zijn om ervoor te zorgen dat alle internettoepassingen, apparaten en systemen werken met alle geldige domeinnamen en e-mailadressen." Voor meer informatie: - https://uasg.tech/ua-day/ - https://www.icann.org/ua

source: article UA-day-2023 date
nl: 22 maart 2023

source: article UA-day-2023 lead
nl: Dinsdag 28 maart staat wereldwijd in het teken van de eerste "Universal Acceptance Day". Universal Acceptance (UA) heeft als doel dat alle geldige domeinnamen en e-mailadressen werken in alle softwaretoepassingen.

source: article UA-day-2023 title
nl: Universal Acceptance Day - #Internet4all

source: article email-test-on-internetnl-extended body
nl: ## Voorkomen van spoofing Spoofing van e-mail is een veel voorkomende aanvalstechniek waarbij de aanvaller mail verstuurd vanaf andermans e-mailadres. Deze techniek wordt bijvoorbeeld vaak gebruikt voor het phishen van wachtwoorden en andere waardevolle informatie. Het kan worden tegengegaan met echtheidskenmerken gebaseerd op de standaarden DMARC, DKIM en SPF. Daarbij is het van belang om een voldoende strikte instelling ('policy') te kiezen, dat wil zeggen `p=quarantine` of `p=reject` voor DMARC en `~all` of `-all` voor SPF. Internet.nl testte hier al op maar vanaf nu tellen de resultaten mee in de score, zoals aan het begin van het jaar al was aangekondigd. ## Beveiligen van mailserververbindingen Als e-mail onderweg niet versleuteld is, kan een aanvaller deze afluisteren. De standaard STARTTLS voorkomt dat passieve aanvallers e-mails onderweg kunnen lezen. Aanvullend beschermt DANE tegen actieve aanvallers, die door manipulatie van het mailverkeer de STARTTLS-encryptie kunnen verwijderen. Internet.nl controleerde al op deze standaarden. De nieuwe versie van Internet.nl checkt uitgebreider conform de [factsheet "Beveilig verbindingen van mailservers"](https://www.ncsc.nl/documenten/factsheets/2019/juni/01/factsheet-beveilig-verbindingen-van-mailservers) van het Nationaal Cyber Security Centrum (NCSC). Bovendien wegen de testresultaten nu mee in de score. ## Over Internet.nl Op Internet.nl kan je eenvoudig testen of je internet up-to-date is, dat wil zeggen of jouw website, e-mail en internetverbinding wel moderne, betrouwbare Internetstandaarden gebruiken. Internet.nl is een initiatief van het Platform Internetstandaarden. Het platform is een samenwerking tussen partners uit de internetgemeenschap en Nederlandse overheid. ECP biedt de administratieve basis voor het platform. De technische realisatie van Internet.nl is in handen van Open Netlabs / NLnet Labs. --- ## Release notes: - New features: - Email test is now conformant with NCSC guidelines (TLS+DANE are scored); - Test for Denial of Existence when checking DANE; - Introduce the DANE rollover scheme test; - Anonymize IPs and reverse names in the connection test; - Revised privacy statement; - Changes: - Weight HSTS and DMARC/SPF policies; - Intermediate screen now only shows the status of the test running instead of results when it is finished; - Display DANE records in test details; - New icon for test results with 'optional' requirement level; - Use "ALL" ciphers when testing HTTP features (not for the TLS tests); - Old results that no longer can be rendered in the UI, cause the retest of the domain and show new results; - Several content improvements; - Bug fixes: - Now we parse only the first HSTS header; - Miscalculation on the nameserver test when a nameserver had no address; - A bogus DANE record now results in warning instead of an error for the website test as it has no impact on the score; - Several UI fixes.

source: article email-test-on-internetnl-extended date
nl: 16 juli 2018

source: article email-test-on-internetnl-extended lead
nl: Is jouw domein zo ingesteld dat mailspoofing actief wordt tegengegaan? Biedt jouw mailserver gedegen transportversleuteling aan? Vanaf vandaag kan je beide aspecten testen met de nieuwe versie van Internet.nl die Platform Internetstandaarden heeft gelanceerd.

source: article email-test-on-internetnl-extended title
nl: E-mailtest op Internet.nl uitgebreid

source: article hall-of-fame-for-hosters body
nl: ## Vermelding Je komt als hoster voor een vermelding in de [Hall of Fame voor hosters](/halloffame/hosters/) in aanmerking als jouw website en e-mail 100% scoren op Internet.nl, én als je deze dubbele perfecte score ook kan leveren aan klanten. Vermelding vindt alleen plaats op verzoek van de hoster. Toetreders tot de Hall of Fame voor Hosters krijgen een naamsvermelding op Internet.nl, een feestelijk pakket, en mogen de *Internet.nl compliant badge* gebruiken in hun eigen communicatie-uitingen. ## Campagne E-mail Veilig In de zomer is de campagne ['E-mail Veilig'](https://emailveilig.internet.nl/hosters/) gestart om bedrijven en hosters te stimuleren om veilige e-mailstandaarden toe te passen. De campagne is een initiatief van Platform Internetstandaarden in samenwerking met Bouwend Nederland, VNO-NCW, Thuiswinkel.org, MKB-Nederland, Cybersecurity Alliantie, Veilige Email Coalitie, DDMA, DHPA, ISPConnect en Vereniging van Registrars. Tijdens de campagne is ook aangekondigd dat we in het najaar een Hall of Fame voor Hosters zouden lanceren. ## Hulp nodig? We helpen hosters heel graag om de laatste stappen richting de Hall of Fame voor Hosters te zetten. In veel gevallen is het een kwestie van de puntjes op de "i" zetten. Check de [toolbox van Internet.nl](https://toolbox.internet.nl) voor informatie en tips. Of stel je vraag via vraag@internet.nl. We helpen je graag de digitale veiligheid van Nederland te vergroten!

source: article hall-of-fame-for-hosters date
nl: 5 oktober 2020

source: article hall-of-fame-for-hosters lead
nl: Er is iets nieuws op Internet.nl: een Hall of Fame voor Hosters! Dat is dé plek waar je als hoster gevonden wil worden. Klanten kunnen daar namelijk zien welke hoster up-to-date is qua toepassing van moderne internet- en e-mailstandaarden.

source: article hall-of-fame-for-hosters title
nl: Lancering Hall of Fame voor Hosters

source: article het-internet-is-van-ons-allemaal author
nl: gerben-klein-baltink

source: article het-internet-is-van-ons-allemaal body
nl: Het Platform Internetstandaarden biedt via deze website Internet.nl zowel achtergrondinformatie als hulpmiddelen. Doel van dit initiatief is ervoor te zorgen dat het Internet voor iedere Nederlander &mdash; maar eigenlijk voor iedere wereldburger &mdash; open, veilig en betrouwbaar blijft. En daar hoort ook een stukje eigen verantwoordelijk bij: internetgebruikers moeten zorgen dat hun software zodanig op orde is dat zij veilig het netwerk op gaan. Dat is echter best een lastige opgave: het gaat vaak om technische materie die voor eindgebruikers moeilijk te begrijpen is: onleesbare foutmeldingen, wisselende versies van software zoals browsers en besturingssystemen, complexe standaarden en uiteenlopende adviezen over gebruik van wachtwoorden en beveiliging, om er maar eens een paar te noemen. Daarom zorgt het Platform ervoor dat via deze portal een aantal internetstandaarden kan worden gecheckt. Het gaat dan om: - IPv6 &mdash; om te zorgen voor ruimte voor groei en gegarandeerde verbindingen - DNSSEC &mdash; voor verhoogde veiligheid van internetgebruik over de hele breedte - TLS &mdash; voor het veilig verbinden met de juiste website - DKIM, SPF en DMARC &mdash; voor verhoogde veiligheid van e-mail Elders op deze website worden deze standaarden heel duidelijk uitgelegd, samen met het belang en de voordelen ervan. ## De gewenste stand van zaken Er zijn nog legio andere relevante standaarden, maar het Platform heeft er bewust voor gekozen om bovenstaande zes de komende tijd extra aandacht te geven. De standaarden zijn ook niet nieuw, maar geven de gewenste stand van zaken aan voor een open, veilige en betrouwbare internet-infrastructuur. We zijn ons ervan bewust dat een individuele gebruiker dit vaak niet zomaar zelf kan regelen; voor veel zaken zijn bijvoorbeeld hulp van de provider of aanpassingen door software-leveranciers vereist. De hulpmiddelen op deze site laten u echter wel zien of het netwerk waar u gebruik van maakt bijvoorbeeld geschikt is voor IPv6. Bovendien biedt het advies over datgene wat u kunt doen als blijkt dat dat nog niet het geval is. En zo doen we dat voor alle bovenstaande standaarden. Ik raad u dan ook aan de informatie op deze website eens op uw gemak door te nemen en de diverse tests uit te proberen. Zo zorgen we er gezamenlijk voor dat ons Internet voor iedereen open, veilig en betrouwbaar blijft, en dat is uiteindelijk in ons aller belang!

source: article het-internet-is-van-ons-allemaal date
nl: 15 april 2015

source: article het-internet-is-van-ons-allemaal lead
nl: Internet is inmiddels zodanig gemeengoed geworden dat we dreigen te vergeten hoe het netwerk eigenlijk functioneert. En dat terwijl de meesten van ons Internet dagelijks gebruiken of er zelfs afhankelijk van zijn. Voor overheid, financiële instellingen en winkels wordt het Internet immers steeds meer het primaire kanaal waarlangs zij hun klanten informeren en van dienstverlening voorzien. Tegelijkertijd hebben we steeds minder zicht op de organisaties, processen en werkwijzen achter het Internet. Deze portal gaat daar verandering in brengen.

source: article het-internet-is-van-ons-allemaal title
nl: Het internet is van ons allemaal

source: article improved-internetnl-test-for-modern-internet-standards body
nl: *"Sinds de eerste lancering in april 2015 zijn er meer dan 300.000 testen uitgevoerd op Internet.nl. Meer dan 50% van de opnieuw geteste websites laten verbeteringen zien. We hopen dat de nieuwe, verbeterde versie van Internet.nl bezoekers nog beter zal ondersteunen bij het testen, eisen en toepassen van moderne, veilige Internetstandaarden"*, aldus Gerben Klein Baltink, voorzitter van Platform Internetstandaarden. Internet.nl helpt gebruikers om te testen of hun internet up-to-date is. Gebruiken jouw website, e-mail en internetverbinding wel moderne, betrouwbare Internetstandaarden? En, als dat niet zo is, wat kun je daar aan doen? Internet.nl is een initiatief van Platform Internetstandaarden dat de adoptie van moderne Internetstandaarden, zoals IPv6, DNSSEC, HTTPS, DMARC, STARTTLS en DANE, stimuleert. In het platform werken de volgende partijen uit de internetgemeenschap en Nederlandse overheid samen: [DHPA](https://dhpa.nl/), [ECP](https://ecp.nl/), [Forum Standaardisatie](https://forumstandaardisatie.nl/), [Internet Society internationaal](https://internetsociety.org/), [Internet Society Nederland](https://isoc.nl/), [ISPConnect](https://ispconnect.nl/), [Ministerie van Economische Zaken](https://www.rijksoverheid.nl/ministeries/ministerie-van-economische-zaken), [NCSC](https://ncsc.nl/), [NLnet](https://nlnet.nl/), [NLnet Labs](https://nlnetlabs.nl/), [RIPE NCC](https://ripe.net/), [SIDN](https://sidn.nl/) en [SURFnet](https://surfnet.nl/). [Open Netlabs](https://www.opennetlabs.com/) / NLnet Labs is verantwoordelijk voor de technische realisatie van de Internet.nl-website. Het herontwerp is ontwikkeld door [WBVB](https://wbvb.nl/) en [200OK](https://www.200ok.nl/). --- ## Release notes (Engels) - Web redesing features: - Site is more easily accessible by users with disabilities; - Site is designed to be accessed by mobile devices; - Tests' details reworked: - Grouped under sections; - Test explanation for every test; - Compact technical details for all servers in a test. - Link to rerun the same test from the results' page; - Aside boxes in the results' page: - Immediately run suggested tests or start new tests; - Follow links to suggested test websites for further testing. - New: We require at least 2 IPv6-enabled nameservers for full score on the IPv6 test. - Bugfixes: - Partial IPv6 connectivity was falsely reported as good result (only visually, the score was correct); - Multiple SPF records were not resulting in error.

source: article improved-internetnl-test-for-modern-internet-standards date
nl: 17 juli 2017

source: article improved-internetnl-test-for-modern-internet-standards lead
nl: Vandaag lanceert Platform Internetstandaarden de nieuw ontworpen [Internet.nl](https://internet.nl)-testwebsite. De uitgebreide uitleg op de verbeterde testwebsite geeft gebruikers meer ondersteuning om aan moderne internetstandaarden te voldoen. Het herontwerp maakt de website beter toegankelijk op mobiele apparaten en voor gebruikers met een beperking.

source: article improved-internetnl-test-for-modern-internet-standards title
nl: Verbeterde Internet.nl-test voor moderne Internetstandaarden

source: article internet-draait-om-samenwerking author
nl: olaf-kolkman
